Repository: Debian-VN/debian-handbook
Catalog: */00a_preface.po
Languages: es_es, fa_ir, fr_fr, ja_jp, nb_no, pl_pl, pt_br, ru_ru, vi_vn, zh_cn, zh_tw

source: Preface
es_es: Prólogo
fa_ir: مقدمه
fr_fr: Préface
ja_jp: 序文
nb_no: Forord
pl_pl: Przedmowa
pt_br: Prefácio
ru_ru: Предисловие
vi_vn: Lời nói đầu
zh_cn: 序
zh_tw: 序

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to millions of users around the world... and its orbit!
es_es: Debian es un sistema operativo muy exitoso, presente en nuestras vidas digitales mucho más de lo que la gente imagina o sabe. Unos pocos ejemplos son suficientes para demostrarlo. Al momento de escribir estas palabras, Debian es la variante de GNU/Linux más popular para servidores web: según <ulink url="http://w3techs.com/">W3Techs</ulink> más de 10% de la web funciona con Debian. Considérelo cuidadosamente: ¿cuántos sitios web se habría perdido de no ser por Debian? En otras instalaciones más interesantes, Debian es el sistema operativo de preferencia en la estación espacial internacional (ISS: «International Space Station»). ¿Conoce del trabajo de los astronautas de la ISS, tal vez a través de la presencia de la NASA en las redes sociales u otras organizaciones internacionales? Tanto el trabajo en sí como los artículos al respecto fueron posibles gracias a Debian. Incontables empresas, universidades y administraciones públicas confían en Debian para su funcionamiento diario, proveyendo servicios a millones de usuarios alrededor del mundo… ¡y en su órbita!
fa_ir: دبیان سیستم عامل بسیار موفقی است که بیش از آنچه مردم تصورش را بکنند در زندگی دیجیتال ما فراگیر شده است. تنها ذکر چند نکته کافی است که به این موضوع پی ببریم. در زمان نوشتن این کتاب، دبیان محبوب‌ترین توزیع گنو/لینوکس در بین وب سرورها است: با توجه به آمار <ulink url="http://w3techs.com/">W3Techs</ulink>، بیش از ۱۰٪ وب توسط دبیان پشتیبانی می‌شود. به این موضوع فکر کنید: بدون دبیان چه تعداد وبسایت را امروز از دست می‌دادید؟ جالب است بدانید که دبیان به عنوان سیستم عامل پیش‌فرض در ایستگاه فضایی بین‌المللی استفاده می‌شود. تا به حال فعالیت‌های فضانوردان این ایستگاه را از طریق شبکه‌های اجتماعی ناسا یا سازمان‌های بین‌المللی دنبال کرده‌اید؟ تمام این‌ها توسط دبیان امکان‌پذیر شده است. تعداد بسیاری از شرکت‌ها، دانشگاه‌ها و نهادهای دولتی برای فعالیت روزانه خود به دبیان متکی هستند تا خدمات خود را به میلیون‌ها کاربر در سراسر جهان ارایه دهند.
fr_fr: Le système Debian a énormément de succès, à tel point qu'il est omniprésent dans nos vies numériques — bien plus que la plupart des gens ne l'imaginent. Quelques chiffres suffisent pour s'en convaincre. Lorsque nous écrivons ces lignes, Debian est la variante de GNU/Linux la plus populaire sur les serveurs web : d'après une étude de <ulink url="http://w3techs.com/">W3Techs</ulink>, plus de 10 % du Web est hébergé sur des serveurs Debian. Pensez-y : de combien de sites web auriez-vous dû vous passer aujourd'hui sans Debian ? Pour un exemple plus édifiant, Debian est le système d'exploitation en usage sur la Station spatiale internationale (ISS). Peut-être suivez-vous le travail des astronautes de l'ISS, peut-être via la présence sur les réseaux sociaux de la NASA ou d'autres organisations internationales ? Eh bien le travail lui-même et les articles qui vous en tiennent informés ont été rendus possibles par des systèmes Debian. D'innombrables sociétés, universités, administrations, collectivités locales, dépendent de Debian au quotidien pour leurs opérations, ce qui leur permet de rendre le service attendu à des millions d'utilisateurs partout dans le monde… et en orbite autour du monde !
ja_jp: Debian は大きな成功を収めたオペレーティングシステムで、われわれのデジタルライフに対し、人々が想像・認識するよりも深く浸透しています。これを明らかにするには、いくつかのデータで十分でしょう。本書の執筆時点で、Debian はウェブサーバ用途で最も人気のある GNU/Linux 派生物です。<ulink url="http://w3techs.com/">W3Techs</ulink> によれば、10% を超えるウェブサーバが Debian で運用されています。考えてみてください: もし今 Debian がなかったら、いくつのウェブサイトが消えてしまうのでしょうか? より魅力的な利用例としては、Debian は国際宇宙ステーション (ISS) に選ばれたオペレーティングシステムです。ソーシャルネットワーク上に存在している NASA や他の国際的な組織のアカウントを介すなどして、ISS の宇宙飛行士による業務を追いかけていますか? 業務そのもの、あるいは業務に関する投稿は、Debian によって可能になっています。数え切れないほど多くの企業・大学・行政機関が、世界中にいる何百万の (…さらに軌道上にいる) ユーザーへ向けて日々のサービスを提供するため Debian に依存しているのです!
nb_no: Debian er et svært vellykket operativsystem, mer gjennomgripende i våre digitale liv, mer enn folk flest ofte forestiller seg, eller er klar over. Noen datapunkter er nok til å gjøre dette klart. Når vi skriver dette, er Debian den mest populære GNU/Linux-varianten blant nettjenerne. Ifølge <ulink url="http://w3techs.com/">W3Techs</ulink>, er mer enn 10 % av nettet Debian-drevet. Tenk på hvor mange nettsider du gikk glipp av i dag uten Debian? Blant mer fascinerende bruksområder, er Debian operativsystem valgt for den internasjonale romstasjonen(ISS). Har du fulgt arbeidet til ISS astronauter, kanskje via det sosiale nettverket til NASA eller andre internasjonale organisasjoner? Både arbeidet i seg selv og innleggene om det er gjort mulig på Debian. Utallige selskaper, universiteter og offentlige myndigheter stoler på Debian når daglige tjenester leveres til millioner av brukere over hele verden ... og i dens bane!
pl_pl: Debian jest bardzo udanym systemem operacyjnym. Z dużym powodzeniem opanowuje kolejne obszary naszego cyfrowego życia. Ludzie często nie zdają sobie sprawy z tego, jak bardzo Debian jest wszechobecny. A oto garść faktów: podczas pisania tego tekstu Debian był uważany za najpopularniejszą odmianę wśród serwerów WWW GNU/Linux. Zgodnie z <ulink url="http://w3techs.com/">W3Techs</ulink>, ponad 10% światowej sieci komputerowej działało w oparciu o Debiana. Proszę się nad tym zastanowić: jak wiele witryn internetowych nie powstałoby, gdyby nie Debian? Jednym z najbardziej fascynujących wdrożeń Debiana było wybranie go na system operacyjny Międzynarodowej Stacji Kosmicznej. Poprzez media społecznościowe NASA lub media innych organizacji międzynarodowych można było śledzić doniesienia medialne na temat astronautów ISS (ang. International Space Station — międzynarodowa stacja kosmiczna). Dzięki Debianowi możliwe było funkcjonowanie samej stacji, jak też prace astronautów oraz doniesienia medialne na ten temat. Niezliczone firmy, uniwersytety, administracja publiczna wielu państw opierają swoje codzienne działania na Debianie, świadcząc usługi internetowe dla milionów użytkowników na całym świecie, nie mówiąc już o usługach przesyłanych na ... orbitę okołoziemską!
pt_br: Debian é um sistema operacional muito bem sucedido, que penetra nas nossas vidas digitais muito mais do que a maioria das pessoas imagina. Uns poucos dados são o suficiente para mostrar isto. No momento em que este texto foi escrito, o Debian era a variante GNU/Linux mais popular entre servidores web: de acordo com a <ulink url="http://w3techs.com/">W3Techs</ulink>, mais de 10% da web roda sobre Debian. Pense nisso, quantos sítios da web parariam se o Debian sumisse hoje? Em ambientes mais fascinantes, o Debian é o sistema operacional escolhido na Estação Orbital Internacional (International Space Station). Você tem acompanhado o trabalho dos astronautas da ISS, talvez via NASA nas redes sociais ou outras organizações internacionais? Tanto o trabalho em si quanto as postagens sobre o trabalho são possíveis graças ao Debian. Inúmeras companhias, universidades e administrações públicas se baseiam no Debian para suas operações, fornecendo serviços a milhões de usuários ao redor do planeta... e na sua órbita!
ru_ru: Debian — очень успешная операционная система, участвующая в нашей цифровой жизни в гораздо большей степени, чем многие часто предполагают или знают. На момент написания Debian — самый популярный вариант GNU/Linux на серверах: согласно <ulink url="http://w3techs.com/">W3Techs</ulink> более 10% всемирной паутины работает на Debian. Задумайтесь, скольких веб-сайтов вы бы недосчитались сегодня без Debian? Среди наиболее впечатляющих применений — использование Debian на Международной космической станции. Следили ли вы за работой астронавтов на МКС, скажем через статус в социальной сети NASA или других международных организаций? И сама работа, и сообщения о ней возможны благодаря Debian. Бесчисленные компании, университеты и государственные учреждения полагаются на Debian в своей повседневной работе, доставляя услуги миллионам пользователей по всему миру... и даже на орбиту!
vi_vn: Debian là một hệ điều hành rất thành công, được phổ biến trong cuộc sống số của chúng ta hơn mọi người tưởng tượng hoặc nhận biết. Chỉ cần nêu ra một vài cột mốc đủ làm rõ điều này. Tại thời điểm viết Debian là phiên bản GNU/Linux phổ biến nhất trong máy chủ web: theo <ulink url="http://w3techs.com/">W3Techs</ulink>, hơn 10% máy chủ web là chạy trên Debian. Hãy suy nghĩ về câu hỏi: Có bao nhiêu trang web biến mất ngày hôm này nếu không có Debian? Một ví dụ sử dụng khác hấp dẫn hơn, Debian được lựa chọn là hệ điều hành trên Trạm vũ trụ quốc tế. Bạn có theo dõi công việc của phi hành gia ISS, có thể qua mạng xã hội của NASA hoặc các tổ chức quốc tể khác? Cả hai công việc (việc làm và bài viết) đó đều thực hiện bởi Debian. Vô số các công ty, trường đại học và các cơ quan hành chính công dựa trên Debian hàng ngày để phục vụ hoạt động của họ và cung cấp cho hàng triệu người dùng trên toàn thế giới... và cả quỹ đạo xung quanh nó!
zh_cn: Debian 作为一款非常成功的操作系统，在不经意间已经渗透到我们数字生活的方方面面。一组数据可以充分证明这一点，Debian 是当时 Web 服务器端最流行的 GNU/Linux 发行版： 根据 <ulink url="http://w3techs.com/">W3Techs</ulink> 的数据，有超过10%的网页背后运行着 Debian 。试想一下：今年你错过了多少网页没有 Debian 参与？再来说个更有趣的，Debian 被部署在了国际空间站上。你曾经是否关注过国际空间站的宇航员，也许是通过 NASA 的社交网络亦或是其他国际组织？这些正是因为有了 Debian 才成为可能。无数的公司、高校，以及其他公共管理机构每天与 Debian 打交道，将这些服务传递给全球数以万计的用户……以及地球轨道上的国际空间站！
zh_tw: Debian 是非常成功的作業系統，在不經意間已經滲透到我們數位生活的各個層面。許多資料可以充分證明此點。根據<ulink url="http://w3techs.com/">W3Techs</ulink>的資料：Debian 是 Web 伺服器端最流行的 GNU/Linux 發行版，超過10% 的網頁採用 Debian 。試想一下：若沒有 Debian 你會錯過了多少網頁？再來說個更有趣的，Debian 被部署在國際太空站上。你曾經是否關注過國際太空站的太空人，也許是通過 NASA 的社交網路亦或是其他國際組織？有了 Debian 才可能看到這些資訊。無數的公司、大學、以及其他公部門依賴 Debian，提供服務給全球數以百萬計的用戶 … 以及地球軌道上的國際空間站！

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us — and Debian is used in all of the above scenarios; you should control it. People without in-depth software knowledge should enjoy those freedoms too: they should be able to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
es_es: Pero Debian es mucho más que un sistema operativo, sin importar cuán complejo, funcional y confiable pueda ser dicho sistema. Debian es una visión de las libertades que todos deberíamos disfrutar en un mundo en el que cada vez más actividades diarias dependen de software. Debian nace de las bases fundamentales del Software Libre: toda persona debe tener control de sus equipos y no a la inversa. Aquellos que posean suficiente conocimiento de software deberían poder desmantelar, modificar, rearmar y compartir con otro todo el software que les importe. No importa si se usa el software para actividades frívolas como publicar imágenes de gatitos, o tareas que podrían amenazar la vida como manejar nuestros autos o hacer funcionar los dispositivos médicos que nos curan — y Debian se usa en todos los escenarios anteriores; deberíamos tener el control completo. Aquellos que no tengan un conocimiento profundo del software también deberían disfrutar estas libertades: deberían ser capaces de delegar a quienes ellos decidan, en quienes confíen, la auditoría o modificación del software de sus dispositivos en su nombre.
fa_ir: اما دبیان چیزی بیشتر از یک سیستم عامل است، جدا از اینکه این سیستم چقدر می‌تواند پیچیده، پرقابلیت و قابل اطمینان باشد. دبیان، چشم‌اندازی از یک دنیای آزادی است که مردم در آن باید لذت ببرند، دنیایی که در آن فعالیت‌های روزانه ما بیشتر و بیشتر به نرم‌افزار وابسته می‌شود. دبیان از نظریه نرم‌افزار آزاد بوجود آمده است که اعتقاد دارد مردم باید رایانه‌های خود را کنترل کنند نه بر عکس این ماجرا. افرادی که دانش نرم‌افزاری کافی را دارند باید بتوانند نرم‌افزارهایی که برایشان اهمیت دارند را مطالعه کرده، تغییر دهند و در اختیار دیگران بگذارند. اهمیتی ندارد که این نرم‌افزار برای فعالیت‌های بیهوده مانند انتشار عکس بچه گربه‌ها روی وب یا فعالیت‌هایی که با زندگی روزانه ما سر و کار دارند مانند هدایت خودروها یا دستگاه‌های پزشکی که ما را درمان می‌کنند، استفاده می‌شود - و دبیان در همه موارد بالا کاربرد دارد؛ شما باید آن را کنترل کنید. حتی افرادی که دانش کافی نرم‌افزاری ندارند نیز باید بتوانند از این آزادی‌ها بهره‌مند شوند: آن‌ها باید بتوانند به افرادی که اطمینان دارند، این اختیار را بدهند که نرم‌افزار مورد نظرشان را بازبینی یا تغییر دهند.
fr_fr: Mais Debian, avec toute sa complexité, toutes ses fonctionnalités, et toute sa fiabilité, est bien plus qu'un système d'exploitation. Premièrement, Debian constitue une vision des libertés dont les personnes jouissent dans un monde où une proportion croissante de nos activités quotidiennes dépendent du logiciel. Debian est né avec pour point cardinal l'idée fondatrice du logiciel libre, selon laquelle les utilisateurs doivent être au contrôle de leurs ordinateurs et non le contraire. Les personnes ayant les connaissances nécessaires doivent pouvoir démonter, modifier, remonter, et partager avec d'autres tous les composants logiciels qui leur tiennent à cœur. Il importe peu qu'il s'agisse d'activités « frivoles » comme la publication de photos de chatons sur le Web ou de tâches d'importance vitale comme le fonctionnement de nos voitures et des appareils médicaux qui nous soignent — et Debian est utilisé dans tous ces scénarios : nous devons contrôler tout cela. Et les personnes qui n'ont pas ces connaissances, pour leur part, doivent elles aussi pouvoir profiter de ces libertés : il doit leur être rendu possible de déléguer à des personnes, en ayant choisi ces personnes en qui elles ont confiance, l'audit et les modifications des équipements logiciels en leur nom.
ja_jp: ですが、どれだけ複雑で有用で信頼できるオペレーティングシステムになろうとも、Debian は単なるシステムにはとどまりません。Debian は、日常生活においてソフトウェアに対する依存度が高まりつつあるこの世界において、人々は自由を謳歌すべき、という理念です。Debian は、人々は自分のコンピュータを己の支配下におくべきであり、コンピュータに支配されるべきではない、という根幹的なフリーソフトウェアの理念から生まれています。ソフトウェアに関して十分な知識を持っている人々は、自分にとって重要なすべてのソフトウェアを分解、改変、再構築してその成果を他の人と共有するべきです。ここで重要なのは、ソフトウェアの用途に関わらず成果を共有するという思想です。子猫の写真をウェブに投稿するようなたわいもない作業に使われるソフトウェアも、車の制御や治療に使われる医療機器への電力供給などの潜在的に命に関わるような目的に使われるソフトウェアも、そのソフトウェアに対して成された成果は同様に共有されます。そして Debian は上に挙げたようなソフトウェアの操作が必要になるさまざまな状況で使われています。さらに、ソフトウェアに関して深い知識を持っていない人々もこの自由を享受すべきです。すなわち、そのような人々は、自らの代わりに自らが選んだ信頼できる人々へ、ソフトウェアによって制御される機器の監査や変更を委ねることができるべきです。
nb_no: Men Debian er mye mer enn et operativsystem, uansett hvor komplekst, innholdsrikt og pålitelig slikt system kan være. Debian er en visjon av de friheter som folk bør ha i en verden der flere og flere av våre daglige aktiviteter er avhengig av programvare. Debian bygger på den grunnleggende Fri Programvare-ideen om at folk selv skal kontrollere sine datamaskiner, og ikke motsatt. Personer med nok programvarekunnskap skal være i stand til å åpne, modifisere, sette sammen og dele med andre all programvare som er viktig for dem. Det spiller ingen rolle om programvaren brukes for frivole aktiviteter som å legge ut bilder av kattunger på nettet, eller for potensielt livstruende oppgaver som å kjøre bilene våre, og drive medisinsk utstyr som kurerer oss - og Debian brukes i alle scenariene ovenfor; Du skal kunne kontrollere det. Folk uten inngående programvarekunnskap bør også ha disse frihetene: På sine vegne skal de kunne delegere gjennomgang eller endring av programvarebaserte enheter til folk de stoler på.
pl_pl: Lecz Debian to coś znacznie więcej niż tylko system operacyjny, niezależnie od jego skomplikowania, szeroko docenianej funkcjonalności i wiarygodności, wymaganych w tego rodzaju systemie. Debian jest też wizją wolności — wizją, jaką powinni cieszyć się wszyscy ludzie w świecie, który w coraz większym stopniu jest zależny od wszelkiego rodzaju oprogramowań. Debian narodził się z fundamentalnej idei Wolnego Oprogramowania, która głosi, że to właśnie ludzie powinni mieć kontrolę nad komputerami, a nie odwrotnie. Ludzie z wystarczającą wiedzą programistyczną powinni mieć możliwość tworzenia, modyfikowania, scalania i współdzielenia z innymi takiego oprogramowania, jeśli te działania przedstawiają dla nich jakąś wartość. Nie ma przy tym znaczenia, czy to oprogramowanie będzie użyte do tak banalnej działalności, jak umieszczanie zdjęć swoich „kociaków” w Internecie, czy też do tak (potencjalnie) niebezpiecznych działań dla zdrowia i życia ludzkiego, jak zasilanie i obsługa urządzeń stosowanych w opiece medycznej. Debian jest – może być – używany w powyższych (lub podobnych) scenariuszach, a ludzie powinni mieć nad tymi zastosowaniami kontrolę. Ludzie bez pogłębionej wiedzy programistycznej powinni również cieszyć się taką wolnością; powinni mieć możliwość wybierania spośród siebie zaufanych przedstawicieli, którzy będą dokonywać w ich imieniu audytu i /lub modyfikacji oprogramowania, a co za tym idzie — audytu i /lub modyfikacji działania urządzeń, funkcjonujących dzięki temu oprogramowaniu.
pt_br: Mas o Debian é muito mais que um sistema operacional, independente de quão complexo, funcional e confiável tal sistema possa ser. O Debian é uma visão das liberdades que as pessoas devem curtir num mundo onde mais e mais de nossas atividades diárias dependem de software. O Debian nasceu da fundamental ideia do mundo do software livre de que as pessoas devem estar no controle dos seus computadores, e não o contrário. Pessoas com suficiente conhecimento de software devem ser capazes de desmontar, modificar, remontar e compartilhar com outros todo o software importante para elas. Não importa se o software é usado para atividades triviais como postar fotos de gatinhos na Web ou para tarefas que envolvam risco de vida como dirigir nossos carros ou controlar os dispositivos médicos que nos curam — e o Debian é usado em todos os cenários acima; você deve controlar isto. Pessoas sem conhecimento profundo de software devem aproveitar esta liberdade também: elas devem ser capazes de poder delegar para pessoas que elas quiserem, que elas confiam, a auditoria ou modificação de dispositivos baseados em software.
ru_ru: Но Debian — это гораздо больше, чем операционная система, какой бы сложной, многофункциональной и надёжной она ни была. Debian — это видение свобод, которыми должны обладать люди в мире, где всё больше и больше наших повседневных занятий зависят от программного обеспечения. Debian родился из главной идеи Свободного программного обеспечения — что люди должны контролировать свои компьютеры, а не наоборот. Люди, достаточно разбирающиеся в программном обеспечении, должны иметь возможность разобрать по винтикам, модифицировать, собрать заново и поделиться с другими всем ценным для них программным обеспечением. Неважно, используется программное обеспечение для пустяковых занятий вроде публикации фотографий с котятами в сети или для задач от которых могут зависеть жизни людей, таких как управление вашим автомобилем или работа медицинского прибора, лечащего вас; вы должны контролировать его. Люди без глубоких познаний в программном обеспечении также должны обладать подобными свободами: для них они выражаются в праве уполномочить людей, которых они выбрали и которым они доверяют, произвести аудит или модификацию программируемых устройств в своих интересах.
vi_vn: Nhưng Debian còn hơn cả một hệ điều hành, bất kể phức tạp như thế nào, nhiều tính năng và đáng tin cậy như là một hệ thống. Debian là một tầm nhìn của các quyền tự do mà mọi người được hưởng thụ trong thế giới nơi mà ngày càng nhiều hoạt động thường ngày phụ thuộc vào phần mềm. Debian được sinh ra từ ý tưởng Phần mềm Tự do mà mọi người kiểm soát được máy tính của họ, chứ không phải ngược lại. Những người có đủ hiểu biết về phần mềm có thể mở mã nguồn, sửa đổi, đóng gói lại và chia sẻ với người khác đối với tất cả phần mềm mà họ thấy cần, muốn làm thế. Điều đó không quan trọng nếu như phần mềm được sử dụng cho hoạt động phù phiếm như đẩy hình chú mèo con lên trang Web, hoặc các nhiệm vụ đe doạ tính mạng như phần mềm lái xe hay phần mềm y tế chữa trị cho chúng ta. Debian được sử dụng cho các tình huống nói trên; bạn nên điều khiển điều đó. Những người không có kiến thức chuyên sâu về phần mềm nên tận hưởng những quyền tự do đó mang lại: họ nên uỷ quyền cho những người mà họ bầu chọn, những người họ tin cậy, chứng nhận hay chỉnh sửa các thiết bị dựa trên phần mềm thay mặt họ.
zh_cn: 尽管作为一个操作系统，Debian 复杂完善，可靠，有各种性能及特点，但 Debian 又不仅仅是一个操作系统。Debian 又是一个自由的王国，在这个王国中，人们应当享受依赖软件来完成日益复杂的日常任务的生活。关于自由的软件的理念认为，用户应该能直接的控制他们的电脑，而不是通过其他其他迂回的方式。而 Debian 就诞生于这种理念。拥有足够电脑知识的用户应该能够拆分，修改，重组他们感兴趣的软件，并同他人共享。只要用户能够直接的控制电脑，控制软件，那么无论这些软件是在做在网上发布小猫的图片这些日常琐事，还是替我们驾驶汽车，或是完成驱动医疗设备这样性命攸关的大事，就显得不再那么重要了。而那些相对不了解电脑知识的人也应能享受到 Debian 的自由：这些人将能够对他们所信任的，拥有审计和修改软件能力的人授权，被他们代表。
zh_tw: 儘管 Debian 複雜、功能完善、又可靠，有各種效能及特點，但 Debian 不僅僅是個作業系統而已。Debian 是個自由的領域依賴軟體在日常工作中過活。Debian 生來就符合自由軟體的理念，人控制電腦沒有其他的說法。擁有足夠的電腦知識就能拆解、修改、重組並與他人共享相關的軟體。在網頁張貼貓星人照片這種小事，或與生命相關的自動駕駛與醫療照護 -- Debian 都能勝任；您應該控制它。沒有深入軟體知識的人也應享受該等自由：祗要授權其選擇的人、受信任的人，依照雇主的意思審核與修改軟體裝置。
