Repository: Debian-VN/debian-handbook
Catalog: */00a_preface.po
Languages: es_es, fa_ir, fr_fr, ja_jp, nb_no, pl_pl, pt_br, ru_ru, vi_vn, zh_cn, zh_tw

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author's/publisher's reputation.
es_es: Pero el que Debian sea único acarrea (a veces) inesperadas consecuencias. Una consecuencia de la visión de Debian sobre libertades digitales fue la necesidad de redefinir lo que entendemos por <emphasis>software</emphasis>. Hace tiempo que el Proyecto Debian se dio cuenta que, como parte de un sistema operativo, necesita distribuir material que no es software: música, imágenes, documentación, datos en crudo, firmware, etc. ¿Cómo se aplican la libertades de <emphasis>software</emphasis> a ese material? ¿Deberían existir requisitos particulares o todo el material debería estar sujeto a los mismos, y altos, estándares de libertad? El Proyecto Debian se decidió por esto último: todo el material provisto como parte de Debian debería ofrecer las mismas libertades a sus usuarios. Esa posición filosófica tan radical tiene efectos de gran alcance. Significa que no podemos distribuir firmware privativo, u obras de arte que no pueden utilizarse en ambientes comerciales, o libros que no pueden modificarse para evitar manchar (como dice el folklore de publicadores de libros) la reputación del autor/publicador.
fa_ir: اما منحصربفرد بودن دبیان گاهی اوقات با نتایج ناخواسته‌ای همراه می‌شود. نتیجه چشم‌انداز دبیان بر آزادی‌های دیجیتال نیاز تعریف مجدد از چیزی است که به آن <emphasis>نرم‌افزار</emphasis> می‌گوییم. پروژه دبیان مدت‌ها پیش به این موضوع پی برده بود که، به عنوان بخشی از یک سیستم عامل، شما نیازمند پخش و گسترش بسیاری موارد غیرنرم‌افزاری هستید: موسیقی، عکس، مستندسازی، داده خام، فرم‌ور و ... اما چگونه آزادی‌های <emphasis>نرم‌افزاری</emphasis> را به این موارد منطبق کنیم؟ آیا باید نیازمندی‌های گوناگون داشته باشیم یا تمام موارد باید در یک استاندارد بالا از آزادی قرار بگیرند؟ پروژه دبیان راهکار دوم را در پیش گرفته است: تمام موارد و گزینه‌هایی که عضو دبیان هستند باید همان نوع از آزادی را به کاربر بدهند. البته چنین دیدگاه فلسفی رادیکالی طیف گسترده‌ای را شامل می‌شود. بدین معنا که نمی‌توانیم فرم‌ور غیرآزاد را توزیع کنیم، یا اثر هنری که نمی‌تواند در نرم‌افزارهای تجاری مورد استفاده قرار گیرد، یا کتاب‌هایی که قابلیت ویرایش نداشته باشند تا (شیوه سنتی ناشران) به اعتبار نویسنده یا ناشر لطمه‌ای وارد نشود.
fr_fr: Mais l'unicité de Debian a parfois des conséquences inattendues. Par exemple, la vision que Debian porte sur les libertés numériques a rendu nécessaire de redéfinir ce que l'on entend par <emphasis>logiciel</emphasis>. Le projet Debian a depuis longtemps pris conscience qu'un système d'exploitation nécessite tout un tas de composants qui ne sont pas du logiciel au sens traditionnel du terme : de la musique, des images, de la documentation, des données brutes, des microcodes, etc. Comment appliquer les libertés du <emphasis>logiciel</emphasis> libre à ces composants ? Est-il justifié d'avoir des critères différents pour chacun, ou est-ce qu'ils doivent tous répondre aux mêmes critères, fussent-ils exigeants ? Le projet Debian a choisi cette dernière solution : tout ce qui est distribué comme un composant de Debian doit garantir à l'utilisateur les mêmes libertés. Cette position philosophique radicale a des conséquences très vastes. À titre d'exemple, elle nous interdit de distribuer des microcodes non libres, ou des éléments graphiques dont l'utilisation serait restreinte à un usage non commercial, ou des livres dont il serait interdit de publier des versions modifiées (censément pour protéger la réputation des auteurs et éditeurs, d'après l'argumentaire habituel).
ja_jp: しかし、Debian の独自性は時に思いもよらない結果を招くことがあります。それは、デジタルにおける自由に関する Debian の理念が<emphasis>ソフトウェア</emphasis>の意味を再定義する必要性を生じさせた、という結果です。Debian プロジェクトはずっと以前から、オペレーティングシステムの一部として数多くのソフトウェアではない著作物 (音楽・画像・文書・生データ・ファームウェアなど) を配布する必要がある、という点に気が付いていました。しかし、これらの著作物に対してどのように<emphasis>ソフトウェアにおける</emphasis>自由を適用すればよいのでしょうか。個々の著作物が独自の要件を設定するべきでしょうか、それともすべての著作物に単一で高い水準の自由を求めるべきなのでしょうか? Debian プロジェクトは後者を選ぶこと (すなわち、Debian の一部として配布されるすべての著作物は、ユーザに対して一義的な自由を提供するべきだということ) に決めました。このような徹底的な哲学的姿勢は、広範囲に影響をおよぼしました。この姿勢は、フリーではないファームウェア、商業的環境で利用されることを許可していないアートワーク、(出版社が変わらない限り) 著者と出版社の評判を下げることを回避するために改変できない書籍などは配布できないということを意味しています。
nb_no: Men at Debian er spesiell eller unik har noen ganger uventede konsekvenser. En konsekvens av Debian visjon på digitale friheter har vært behovet for å redefinere hva vi mener med <emphasis>dataprogrammer</emphasis>. Som en del av et operativsystem, har Debian-prosjektet lenge innsett at det trengs å distribuere en del ikke-programvaremateriale: Musikk, bilder, dokumentasjon, rådata, firmware, etc. Men hvordan bruker du friheten til <emphasis>dataprogrammer</emphasis> for slikt materiale? Skal vi ha ulike krav, eller skal alt materiale oppfylle den samme høye standarden av frihet? For det sistnevnte materiale har Debian-prosjektet besluttet at alt materiale leveres som en del av Debian, skal gi de samme frihetene til sine brukere. Et slik radikalt filosofisk standpunkt har vidtrekkende effekter. Det betyr at vi ikke kan distribuere ufri firmware, eller visuell design som ikke er ment å bli brukt i kommersielle sammenhenger, eller bøker som ikke kan endres for å unngå å svekke (som boksutgiveres omtale går) forfatterens/utgiveres omdømme.
pl_pl: Lecz wyjątkowość Debiana prowadzi czasami do nieoczekiwanych konsekwencji. Jedną z takich konsekwencji "debianowej wizji wolności" była konieczność przedefiniowania pojęcia <emphasis>oprogramowanie</emphasis>. W Projekcie Debian już od dawna zdawano sobie sprawę z tego, że rozpowszechniając system operacyjny rozpowszechnia się również materiały, które nie są oprogramowaniem w ścisłym sensie. Są to m.in.: pliki audio, wideo, kodeki, grafika cyfrowa, dane surowe, dokumentacja, oprogramowanie urządzeń peryferyjnych, itd. Lecz jak potraktować te materiały w kategoriach <emphasis>wolności oprogramowania</emphasis>: czy ustanowić wobec nich odrębne wymagania, czy też potraktować je jako części systemu operacyjnego, a więc zastosować wobec nich tak samo wysokie standardy wolnościowe, jak wobec samego Debiana? W Projekcie Debian zdecydowano się na tę drugą ewentualność, która obowiązuje do chwili obecnej. Oznacza to, że razem z Debianem nie można rozpowszechniać nie-wolnego oprogramowania sprzętowego, lub że nie można używać komercyjnych wytworów sztuki cyfrowej lub że nie można rozpowszechniać książek, co do których istnieje zakaz modyfikacji — aby nie „sprofanować” książki (jak to głoszą niektórzy "specjaliści" od rynku wydawniczego) i nie naruszyć reputacji jej autora /wydawcy.
pt_br: Mas a unicidade do Debian vem às vezes com consequências inesperadas. Uma consequência da visão do Debian sobre liberdades digitais foi a necessidade de redefinir o que entendemos por <emphasis>software</emphasis>. O projeto Debian a muito percebeu que, junto com um sistema operacional, você precisa distribuir um monte de material que não é programa (software): música, imagens, documentação, dados brutos, firmware, etc. Mas como aplicar liberdade de <emphasis>software</emphasis> a este material? Devemos ter requisitos diferentes ou todo o material deve seguir o mesmo critério rigoroso de liberdade? O Projeto Debian decidiu pela última opção: todo material disponível como parte do Debian deve oferecer as mesmas liberdades a seus usuários. Tal posição filosófica radical teve efeitos amplos. Significa que não podemos distribuir firmware não-livre, ou arte que não possa ser usada para fins comerciais, ou livros que não podem ser modificados para evitar macular (segundo as lendas das editoras) a reputação do(a) autor(a)/editora.
ru_ru: Но уникальность Debian влечёт неожиданные последствия. Взгляд Debian на цифровые свободы привёл к переопределению того, что мы подразумеваем под <emphasis>программным обеспечением</emphasis>. Проект Debian со временем осознал, что в составе операционной системы должны распространяться и непрограммные материалы: музыка, изображения, документация, необработанные данные, «прошивки» и т. д. Но как применять свободы <emphasis>программного обеспечения</emphasis> к этим материалам? Следует ли нам предъявлять другие требования, или все материалы должны придерживаться одних и тех же высоких стандартов свободы? Проект Debian решил в пользу второго варианта: все материалы, поставляемые как часть Debian, должны предоставлять одинаковые свободы своим пользователям. Такая радикальная философская позиция имела далеко идущие эффекты. Это значит, что мы не можем распространять несвободные «прошивки» или художественные произведения, не предназначенные для коммерческого использования, или книги, которые нельзя модифицировать, чтобы не запятнать (в соответствии с мифологией книгоиздателей) репутацию автора/издателя.
zh_cn: 但是 Debian 的独特性有时候也会带来不可预料的结果。一个 Debian 对数字自由的愿景所带来的结果便是对我们所谓<emphasis>软件</emphasis>的重新定义。Debian 项目一直以来都意识到，作为操作系统的一部分，你需要发布许多非软件的材料：音乐、图像、文档、原始数据、固件等等。但是究竟该如何将<emphasis>软件</emphasis>自由应用到那些材料上去呢？我们是应该对其持有不同的要求，或者是所有的材料都应该支撑起同样高标准的自由呢？Debian 项目决定采用后者：所有作为 Debian 的一部分而发行的材料应当向用户提供相同程度的自由。这样激进的哲学观点产生了深远的影响。这意味着我们不能够分发不自由的固件，或者那些不被允许在商业环境中使用的艺术作品，或者那些为了避免作者或出版商名誉受损而禁止修改的书籍（参照书籍出版商的所作所为）。
zh_tw: 但是 Debian 的獨特性有時會帶來不可預期的結果。Debian 對數位自由的願景衍生對所謂<emphasis>軟體</emphasis>的重新定義。Debian 計畫做為作業系統的一部分，始終體認到，你需要發布許多非軟體的素材：音樂、影像、文件、初始資料、韌體等。但是該如何將 <emphasis>軟體</emphasis> 自由應用於那些材料上去呢？我們是應該有不同的對待，或讓所有的素料都採用同樣高標準的自由呢？Debian 計畫採用後者：與 Debian 一起發行的素材應向使用者提供相同的自由。如些激進的哲學觀點產生了深遠的影響。這意味着我們無法夠散布不自由的韌體、或者那些不被允許在商業環境中使用的藝術品、或者那些為了避免作者或出版商名譽受損而禁止修改的書籍 (參照書籍出版商的所作所為) 。

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspect of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that there was little reading material that helped to spread Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that others in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
es_es: El libro que tiene en sus manos es diferente. Es un libro <emphasis>libre como la libertad</emphasis>, un libro que se adhiere a los estándares de libertad de Debian para todos los aspectos de su vida digital. Por mucho tiempo, la escasa disponibilidad de libros como este fue una gran limitación de Debian. Significaba que existía poco material de lectura que ayudara a difundir Debian y sus valores al mismo tiempo que representara dichos valores y mostrara sus ventajas. Pero también significaba, irónicamente, que teníamos poco material que pudiéramos distribuir con Debian en sí mismo. Este es el primer libro reputable que intenta solucionar esta limitación. Puede utilizar <command>apt install</command> para obtener este libro, puede redistribuirlo, puede bifurcarlo o, mejor aún, enviar reportes de error y correcciones para el mismo de forma que otros puedan beneficiarse de sus contribuciones. Los «encargados» de este libro — que también son sus autores — son miembros del Proyecto Debian desde hace mucho tiempo, quienes asimilaron y fueron asimilados por la distintiva libertad que empapa todo aspecto de Debian y conocen de primera mano lo que significa ser responsables de partes importantes de Debian. Al liberar este libro Libre realizan, una vez más, un fantástico servicio a la comunidad Debian.
fa_ir: کتابی که در دست دارید متفاوت است. کتابی که به معنای <emphasis>آزاد</emphasis> منطبق با استانداردهای آزاد برای هر جنبه از زندگی دیجیتال شما نوشته شده است. برای مدتی بسیار طولانی، عدم وجود چنین کتابی تاثیر بسزایی در عدم درک صحیح دبیان داشته است. به این معنی که برخی منابع محدود برای مطالعه دبیان و انتشار ارزش‌های آن وجود داشته است، که در همان زمان به بررسی آن‌ها می‌پرداختند. اما بدین معنی نیز هست که ما دسترسی محدودی به این منابع داشتیم که می‌توانستیم به عنوان بخشی از دبیان آن‌ها را توزیع کنیم. این اولین کتاب معتبر در این زمینه است که می‌تواند کاستی‌های موجود را پوشش دهد. شما می‌توانید این کتاب را <command>apt install</command> کنید، آن را بازنشر کنید، محتوایش را تغییر دهید، یا بهتر از آن نقص‌های فعلی آن را گزارش کنید، به صورتی که دیگران در آینده از مشارکت شما استفاده کنند. “حامیان” این کتاب - که البته نویسندگان آن نیز هستند - اعضای قدیمی از پروژه دبیان به حساب می‌آیند، کسانی که اخلاق آزاد را در چارچوب مسیولیت‌پذیری در قبال رشد و توسعه پروژه دبیان آموختند. با انتشار آزاد این کتاب این افراد مجدد خدمت فوق‌العاده‌ای به جامعه کاربری دبیان ارایه می‌دهند.
fr_fr: Le livre que vous avez sous les yeux est différent. C'est un livre libre, <emphasis>free as in freedom</emphasis>, un livre conforme aux standards que Debian applique à tous les aspects de votre vie numérique. Pendant très longtemps, Debian a été pénalisé par la rareté des livres comme celui-ci ; il n'y avait que très peu de livres (ou assimilés) qui pouvaient à la fois aider à diffuser Debian et ses valeurs, et en même temps respecter ces valeurs et incarner leurs avantages. De manière ironique, cela voulait également dire que nous ne disposions que de très peu de tels textes que nous aurions pu distribuer à l'intérieur même de Debian. Vous lisez actuellement le premier livre qui s'attaque de front à ce manque : vous pouvez récupérer ce livre avec <command>apt install</command>, le redistribuer, en préparer une version modifiée, et même soumettre des rapports de bogue et des correctifs à son sujet, de sorte que d'autres lecteurs puissent profiter de vos contributions à l'avenir. Les « mainteneurs » de ce livre — qui en sont aussi les auteurs — sont des membres de longue date dans le projet Debian, qui ont une compréhension intime de l'ethos de liberté dans lequel baignent tous les aspects de Debian, et qui savent de première main ce que signifie prendre en charge la responsabilité de parties importantes de Debian. En publiant ce livre libre, ils rendent une fois de plus un grand service à la communauté Debian.
ja_jp: あなたの手元にある本書は違います。本書は <emphasis>free as in freedom</emphasis> な書籍、言い換えればデジタルライフのあらゆる側面で Debian における自由という基準に従う書籍です。とても長い間、本書のような書籍の数が少ない点が、Debian の重大な欠点でした。これは、Debian とその価値を広く伝え、同時に Debian における自由という基準の価値を具現化してその利点を浮き彫りにするような読み物がほとんど存在しなかったことを意味しています。そして皮肉なことに、Debian それ自身の一部として配布できる読み物がほとんど存在しなかったことも意味しています。本書は初めてこの欠点の克服に取り組んだ信頼できる書籍です。あなたは本書を <command>apt install</command> でインストールしたり、再配布したりできます。フォークすることもできますが、より望ましいやり方として、バグを報告したり、パッチを投稿したりすることも可能です (そうすることで将来他の人があなたの貢献の恩恵を受けられるようになります)。本書の「メンテナ」は本書の著者でもあり、Debian プロジェクトのメンバーとして長期にわたって活動し続けています。われわれ著者は、Debian のすべての側面に浸透している自由の精神に共感し、Debian の重要な部分に関する責任を負うことがどのような意味を持っているかを直接的に理解しています。重ねて、本書のようなフリーな書籍を公開することにより、われわれ著者は Debian コミュニティに対して素晴らしい貢献をしているのです。
nb_no: Boken du har her er annerledes. Det er en <emphasis>fri som i frihet</emphasis> bok, en bok som lever opp til Debians frihetstandarder for alle aspekter av ditt digitale liv. Veldig lenge har tilgjengeligheten av bøker som denne manglet for Debian. Det var lite lesestoff som bidro til å spre Debian og dens verdier, og som samtidig legemliggjorde disse verdiene og fordelene som hører til. Men det betydde også, ironisk nok, at vi hadde lite egnet materiale til formidling som en del av Debian selv. Dette er den første anerkjente boken som fyller denne mangelen. Du kan <command>apt install</command> denne boken, du kan redistribuere den, du kan dele den videre, eller bedre, sende feilrapporter og oppdateringer for den, slik at andre i fremtiden kan dra nytte av dine bidrag. "Vedlikeholderne" av denne boka - som også er dens forfattere - er langvarige medlemmer av Debian-prosjektet, som forstår frihetsfilosofien som alle aspekter av Debian bygger på, og som i første hånd vet hva det betyr å ta på seg ansvaret for viktige deler av Debian. Ved å utgi denne boken gratis, leveres enda en gang en så solid tjeneste til Debian-samfunnet.
pl_pl: Książka, którą właśnie masz przed sobą na ekranie komputera osobistego lub przenośnego, czytnika książek elektronicznych lub podobnego urządzenia, albo w formie tradycyjnej książki drukowanej, jest inna. Jest tak <emphasis>wolna, jak to tylko w wolnościowej</emphasis> książce może być, książce, która odpowiada debianowym standardom wolności w każdym calu, w każdym aspekcie jej — i twojego — cyfrowego życia. Brak książek takich jak ta był przyczyną jednej z największych bolączek Debiana. Oznaczało to, że było bardzo mało materiałów do czytania, które mogłyby rozpowszechniać Debiana i jego wartości; które mogłyby ugruntowywać te wartości w cyfrowym świecie i ukazywać korzyści z ich pielęgnowania. Lecz, na ironię, oznaczało to również, że mieliśmy bardzo mało takich materiałów, kŧóre można by rozpowszechniać razem z systemem operacyjnym Debian. Obecna książka jest pierwszą tego typu pozycją, wychodzącą naprzeciw tym wymaganiom. Możesz ją mieć w swoim systemie za pomocą polecenia <command>apt-get install</command>, możesz ją rozpowszechniać, możesz z niej uzyskać fork (ang. dosłownie: "widelec", "rozwidlenie", tutaj: niezależne, zdalne repozytorium, np. na witrynie GitHub), lub lepiej — wysyłać raporty błędów i „łatki” tak, aby inni w przyszłości mogli korzystać z twojego wkładu w Projekt Debian. „Opiekunowie" tej książki, będący jej autorami, są od długiego czasu członkami Projektu Debian. Są oni wierni etosowi wolności, etosowi, który przenika każdy aspekt Debiana. Wiedzą oni — z pierwszej ręki — jak przyjąć na siebie odpowiedzialność za każdą część Debiana. Wydając tę książkę, spełniają oni — po raz kolejny — wspaniałą służbę dla społeczności Debiana.
pt_br: O livro que você tem nas mãos é diferente. Ele é um livro <emphasis>"livre" e não só grátis</emphasis>, um livro que segue os padrões de liberdade do Debian para cada aspecto de sua vida digital. Por um tempo muito longo, a disponibilidade escassa de livros como este tem sido uma grande limitação do Debian. Significava que existia pouco material de leitura que ajudasse a difundir o Debian e seus valores, ao mesmo tempo que incorporava seus valores e mostrava suas vantagens. Mas também significava, ironicamente, que tínhamos pouco material que pudéssemos distribuir como parte do Debian em si. Este é o primeiro livro de renome que supre essa limitação. Você pode dar um <command>apt install</command> neste livro, pode redistribuí-lo, pode derivá-lo ou, melhor, enviar relatórios de erros e correções para ele, de forma que outros possam se beneficiar de suas contribuições no futuro. Os "mantenedores" deste livro — que são também os autores — são membros de longa data do Projeto Debian, que assimilaram e foram assimilados pelo etos de liberdade que permeia cada aspecto do Debian e conhecem de primeira mão o que significa assumir responsabilidade por partes importantes do Debian. Ao lançar este livro livre eles realizam, uma vez mais, um fantástico serviço para toda a comunidade Debian.
ru_ru: Книга, которую вы держите в руках, иная. Это <emphasis>свободная</emphasis> книга, книга, соответствующая стандартам свободы Debian для всех проявлений вашей цифровой жизни. На протяжении долгого времени нехватка книг, подобных этой, была существенным недостатком Debian: было мало письменных материалов, помогающих распространению Debian и его ценностей, и в то же время воплощающих эти ценности и демонстрирующих их преимущества. И, как ни парадоксально, это также означало, что у нас было мало таких материалов, которые мы могли распространять как часть Debian. Это первое авторитетное издание, устраняющее этот изъян. Вы можете установить эту книгу с помощью <command>apt install</command>, вы можете распространять её, вы можете создавать ответвления этой книги, а ещё лучше отправлять сообщения об ошибках и исправления для неё, так что другие в будущем могут получить пользу от вашего вклада. «Сопровождающие» этой книги — и по совместительству её авторы — давние участники Проекта Debian, глубоко чувствующие дух свободы, пронизывающий каждую составляющую Debian, и знающие не понаслышке, что значит нести ответственность за важные части Debian. Выпуская эту книгу, они служат ещё одну, столь прекрасную, службу сообществу Debian.
vi_vn: Quyển sách bạn có trong tay bạn là khác. Nó là một quyển sách <emphasis>miễn phí như quyền tự do</emphasis>, một cuốn sách mà đề cập đến tiêu chuẩn tự do Debian cho mọi khía cạnh của cuộc sống số của bạn. Trong một thời gian dài, sự khan hiểm của sách là một thiếu sót đáng kể của Debian. Nó có nghĩa rằng có rất ít tài liệu đọc giúp truyền bá Debian và giá rị của nó, đồng thời thể hiện những giá trị và khoe lợi thế của Debian. Nhưng nó cũng có nghĩa là, thật trớ trêu thay, chúng ta đã có rất ít tài nguyên vậy mà chúng ta có thể phân phối như một phần của Debian chính nó. Đây là quyển sách đầu tiên có uy tín để giải quyết vấn đề này. Bạn có thể dùng lệnh <command>apt install</command> quyển sách này, bạn có thể phân phối lại nó, bạn có thể tách nhánh cho quyển sách này hoặc, tốt hơn, gửi các báo lỗi và các bản vá cho nó, để những người khác trong tương lai có thể hưởng lợi từ sự đóng góp của bạn. “Người bảo trì” của quyến sách - người mà cũng là tác giả - là thành viên lâu năm của dự án Debian, người hiểu thấu mọi phía cạnh của Debian và biết việc làm đầu-tay nó có nghĩa như thế nào để nhận trách nhiệm cho các bộ phận quan trọng của Debian. Bằng cách phát hành miến phí sách như họ đang làm, một lần nữa, một dịch vụ tuyền vời cho cộng đồng Debian.
zh_cn: 你手中的这本书则不一样。它是一本<emphasis>自由中的自由</emphasis>之书，在你的数字生活的各个方面都达到了 Debian 的标准。很长一段时间以来，像本书一样的同类书籍之稀缺一直是 Debian 的一个重要的短板。它意味着缺乏合适的用来散布 Debian 及其价值，同时又能具体化这些价值并展示其优点的阅读材料。但讽刺的是，这同样意味着我们缺少类似的、可以作为 Debian 自身的一部分来发布的类似材料。本书是第一本用来弥补这些缺点的知名书籍。你可以 <command>apt install</command> 这本书，你可以重新分发本书，你可以创建本书的分支，或者更好的是，为它提交漏洞报告和补丁，从而使得其他人也能在未来因此获益。本书的“维护者”——即它的作者——是 Debian 项目的资深成员，他们对渗透于 Debian 方方面面中的自由精神有着深刻的理解，也拥有第一手资料，知晓承担 Debian 重要部分的责任究竟意味着什么。将他们所制作的这本自由之书公布于世，即是再一次的，向 Debian 社区提供的极好服务。
zh_tw: 你手中的這本書則不一樣。它是一本 <emphasis>自由</emphasis> 的書，符合 Debian 標準的書。長久以來，Debian 就是欠缺一本像這樣的書。缺乏用來散布 Debian 及其價值的書，同時又能具體化這些價值並展示其優點的閱讀材料。也就是說，沒有能夠作為 Debian 一部分同時發行的類似材料。本書是用來彌補這些缺點的第一本書。你可以 <command>apt install</command> 安裝、再散布、衍生、提交漏洞報告和補丁，從而使得其他人獲益。本書的 "維護者" — 即它的作者 — 是 Debian 計畫的資深成員，他們理解 Debian 自由思潮也擁有承擔 Debian 重要責任的第一手材料。將他們所製作的這本自由之書散布於世，即是再次，對 Debian 社群提供的極好服務。
