Repository: Debian-VN/debian-handbook
Catalog: */00a_preface.po
Languages: es_es, fa_ir, fr_fr, ja_jp, nb_no, pl_pl, pt_br, ru_ru, vi_vn, zh_cn, zh_tw

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
es_es: En la búsqueda del control sobre las máquinas, los sistemas operativos libres tienen un rol fundamental: no puede controlar completamente un dispositivo computacional si no controla su sistema operativo. De aquí proviene la ambición fundamental de Debian: producir el mejor sistema operativo completamente libre. Hace ya más de 20 años Debian ha desarrollado un sistema operativo libre y también promocionado una visión de Software Libre alrededor del mismo. Al hacerlo, Debian subió la vara para los promotores del software libre en el mundo. Por ejemplo, organizaciones de estándares internacionales, gobiernos y otros proyectos de Software Libre hacen referencia a las decisiones de Debian en cuestiones de licenciamiento de software para decidir si algo debe ser considerado «suficientemente libre» o no.
fa_ir: برای اینکه افراد بتوانند بر ماشین‌ها حاکم شوند، سیستم عامل‌های آزاد نقش کلیدی بازی می‌کنند: شما نمی‌توانید کنترل کاملی روی رایانه داشته باشید تا زمانی که سیستم عامل آن را به طور کامل در اختیار ندارید. این درست جایی است که هدف اصلی دبیان از آن سرچشمه می‌گیرد: تولید بهترین و آزادترین سیستم عامل دنیا. به مدت بیش از ۲۰ سال است که دبیان هم سیستم عاملی آزاد ایجاد کرده هم به چشم‌انداز نرم‌افزار آزاد رسیده است. در این مسیر، دبیان خط مشی مشخص برای مدافعین آزادی نرم‌افزار در دنیا تعریف کرده است. برای نمونه، تصمیمات دبیان در مورد استفاده از مجوزهای نرم‌افزاری، با روالی مشخص توسط سازمان‌های استاندارد بین‌المللی، دولت‌ها و سایر پروژه‌های نرم‌افزار آزاد مورد بازبینی قرار می‌گیرد که نشان می‌دهد یک نرم‌افزار تا چه اندازه "آزاد" به حساب می‌آید.
fr_fr: Sur le chemin de l'appropriation des machines par les humains, les systèmes d'exploitation libres jouent un rôle fondamental. Il est impossible d'être complètement aux commandes d'un appareil informatique sans contrôler son système d'exploitation. C'est de là que provient l'ambition principale de Debian : produire le meilleur système d'exploitation entièrement libre. Depuis maintenant plus de 20 ans, Debian a tout à la fois développé un tel système et fait la promotion d'une vision du logiciel libre. Ce faisant, le projet a placé la barre très haut pour les défenseurs du logiciel libre dans le monde. Les décisions de Debian dans le domaine des licences logicielles, par exemple, servent fréquemment de référence pour des organisations de normalisation internationale, des gouvernements, et d'autres projets de logiciel libre, lorsqu'il s'agit de décider si quelque chose peut être considéré comme « suffisamment libre ».
ja_jp: 人間によるマシンのコントロールを成し遂げることにおいて、フリーなオペレーティングシステムは根本的な役割を担っています。つまりオペレーティングシステムをコントロールしなければ、コンピュータデバイスを完全に支配することは不可能です。最高の、完全にフリーなオペレーティングシステムを作成しようという Debian の主な野望はここから来ています。20 年以上もの間、Debian はフリーなオペレーティングシステムを開発すると同時に、これを支えるフリーソフトウェアの理念を推進し続けています。そうすることで、Debian は世界中にいるソフトウェアにおける自由の支持者に対して、非常に高いハードルを設けました。たとえば、ソフトウェアのライセンスに対する Debian の判断は、ある案件が「十分にフリー」と考え得るか否かを判断する際に、国際的な標準化機関・政府機関・他のフリーソフトウェアプロジェクトでよく参考にされています。
nb_no: I søket etter å kontrollere personer gjennom maskiner, spiller gratis operativsystemer en grunnleggende rolle. Du kan ikke ha full kontroll over en dataenhet hvis du ikke kontrollerer operativsystemet. Derfra kommer Debians hovedformål: Å lage de beste, helt Frie operativsystemer. I mer enn 20 år nå, har Debian både utviklet et gratis operativsystem, og rundt det, fremmet en visjon om fri programvare. Dermed har Debian gitt et svært høyt nivå for programvarefrihet til sine støttespillerne rundt om i verden. Debians beslutninger om programvarelisenser, for eksempel, blir rutinemessing sett på av internasjonale standardiseringsorganisasjoner, myndigheter og andre fri programvareprosjekter, når de bestemmer om noe skal anses som "fri nok" eller ikke.
pl_pl: Wolne systemy operacyjne odgrywają fundamentalną rolę w kwestii kontroli maszyn przez ludzi: nie można mieć pełnej kontroli nad urządzeniem komputerowym, jeśli się nie ma kontroli nad jego systemem operacyjnym. To stąd właśnie pochodzi główne poczucie ambicji Debiana: wyprodukować najlepszy, całkowicie wolny system operacyjny. Debian, już od ponad 20 lat, rozwija zarówno Wolny system operacyjny, jak i promuje wokół niego wizję Wolnego Oprogramowania. W ten sposób ustawia bardzo wysoką poprzeczkę dla wolnego oprogramowania; staje też w jego obronie na całym świecie. Na przykład, decyzje Debiana w sprawie licencjonowania oprogramowania są rutynowo przeglądane przez międzynarodowe organizacje standaryzujące, instytucje rządowe i inne projekty Wolnego Oprogramowania pod kątem tego, czy coś powinno być uważane za „wystarczająco wolne”, czy też nie.
pt_br: Na missão de trazer o controle das máquinas para as pessoas, sistemas operacionais livres desempenham um papel fundamental: você não pode estar no controle total de um dispositivo computacional se você não controla seu sistema operacional. É daí que vem a principal ambição do Debian: produzir o melhor sistema operacional completamente livre. Por mais de 20 anos, o Debian desenvolveu um sistema operacional livre e promoveu uma visão de software livre a partir dele. Desta forma, o Debian manteve um padrão bastante alto para protetores da liberdade de software ao redor do mundo. As decisões do Debian em matéria de licenciamento de software, por exemplo, são normalmente observadas por instituições de padronização internacionais, governos e outros projetos de software livre, quando decidem se algo deve ser considerado livre o suficiente ou não.
ru_ru: Свободные операционные системы играют фундаментальную роль в контроле человека над машинами: вы не можете полностью контролировать вычислительное устройство, если вы не контролируете его операционную систему. Отсюда происходит главное стремление Debian — сделать лучшую, полностью Свободную операционную систему. Уже больше 20 лет Debian не только разрабатывает Свободную операционную систему, но и продвигает сопутствующие идеи Свободного программного обеспечения. В этом процессе Debian установил очень высокую планку для сторонников свободы ПО во всём мире. Решения Debian по вопросам лицензирования программного обеспечения, например, регулярно просматриваются международными организациями по стандартизации, правительствами, а также другими Свободными программными проектами при принятии решения, является ли нечто «достаточно свободным».
vi_vn: Trong công cuộc tìm kiếm sự kiểm soát của con người đối với máy móc. Hệ điều hành miễn phí đóng một vai trò quan trọng: bạn không thể có toàn quyền với máy tính nếu như bạn không điều khiển được hệ điều hành của chính nó. Nơi bắt nguồn cho tham vọng chính của Debian: sản xuất hệ điều hành tốt nhất, hoàn toàn miễn phí. Trong hơn 20 năm qua, Debian đã phát triển một hệ điều hành miễn phí và thúc đẩy tầm nhìn của "Phần mềm Tự do" xung quanh nó. Bằng cách ấy, Debian đã đặt ra yêu cầu rất cao đối với những người ủng hộ tự do phần mềm trên toàn thế giới. Quyết định của Debian về các vấn đề của giấy phép phần mềm, các ví dụ, thường xuyên được tham khảo bởi các tổ chức tiêu chuẩn quốc tế, chính phủ, và các dự án "Phần mềm Tự do" khi quyết định một điều gì có được xem là “đủ miễn phí” hay là không.
zh_cn: 在人们控制机器的问题上，自由免费的操作系统中发挥着基础性作用：如果你不能控制计算机的操作系统，你就不能完全控制计算机设备。这是 Debian 的主要愿景来源：开发最好的，完全自由免费的操作系统。20多年来，Debian 既开发了一个自由免费的操作系统，同时也推动了其周边发展自由软件的愿景。如此，Debian 为世界各地的自由软件倡导者树立了很高的标杆。当考虑某件事情是否应该被认为“足够自由“的时候，Debian 所作的决定，例如软件许可事项，常常会被国际标准组织、政府和其他自由软件项目作为参考。
zh_tw: 在人掌控機器的議題上，自由作業系統扮演基礎的角色：不能控制作業系統就不能完全掌控電腦裝置。這是 Debian 的願景的主要來源：開發最好的、完全自由的作業系統。20多年來，Debian 既開發了一個自由的作業系統同時也推動了周邊自由軟體願景。如此，Debian 為世界各地的自由軟體倡導者樹立了很高的標竿。例如，當 Debian 決定軟體授權事項時，常被國際標準組織、政府和其他自由軟體計畫參考，對照其自身是否 "夠自由"。

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pack on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues... not to mention software packaging and development! Debian contributors take care of all of these.
es_es: Pero esta visión política todavía no es suficiente para explicar cuán especial es Debian. Debian también es un experimento social peculiar, muy cercano a su independencia. Considere por un momento otras distribuciones de Software Libre reconocidas, o inclusive sistemas operativos <emphasis>privativos</emphasis> populares. Es probable que pueda asociar cada una de ellas con una gran empresa que es la fuerza mayoritaria en el desarrollo del proyecto o, cuando menos, el supervisor de todas sus actividades ajenas al desarrollo. Debian es diferente. Dentro del Proyecto Debian, los voluntarios eligen por sí mismos las responsabilidades de todas las actividades necesarias para mantener a Debian vivo y coleando. La variedad de dichas actividades es impresionante: desde traducciones a administración de sistemas, desde publicidad a la gestión, desde organización de conferencias a diseño de arte, desde los registros contables a cuestiones legales... ¡y no olvidemos el empaquetado de software y el desarrollo en sí! Los colaboradores de Debian se encargan de todas ellas.
fa_ir: اما حتی این دیدگاه سیاسی نیز برای توضیح منحصربه‌فرد بودن دبیان کافی نیست. دبیان همچنین به عنوان یک آزمون اجتماعی بسیار عجیب و غریب نیز به حساب می‌آید، که به شدت به استقلال آن وابسته است. برای یک لحظه به سایر توزیع‌های مهم نرم‌افزار آزاد توجه کنید، یا حتی سیستم عامل‌های <emphasis>انحصاری</emphasis>. بسیار محتمل است که هر کدام از این سیستم عامل‌ها به یک شرکت تجاری بزرگ وابسته باشند که تیم فنی اصلی را در اختیار دارد یا حداقل واسطی بین تمام فعالیت‌های آن باشد. دبیان متفاوت با این مجموعه‌ها است. درون پروژه دبیان، داوطلبان به تنهایی مسیولیت‌های را قبول می‌کنند که منجر به ادامه حیات دبیان می‌شود. تنوع این فعالیت‌ها شگفت‌انگیز است: از ترجمه تا راهبری سیستم، از بازاریابی تا مدیریت، از سازمان‌دهی کنفرانس تا طراحی هنری، از ساماندهی امور اداری تا مسایل قانونی ... راستی، توسعه و نگهداری نرم‌افزار را فراموش کردیم! مشارکت‌کنندگان در پروژه دبیان، از پس تمام این فعالیت‌ها بر می‌آیند.
fr_fr: Mais cette vision éminemment politique ne suffit toujours pas à expliquer l'unicité de Debian ; le projet est également une expérience sociale très particulière et très attachée à son indépendance. Considérez un instant les autres grandes distributions de logiciel libre, ou même les systèmes d'exploitation <emphasis>propriétaires</emphasis> les plus populaires. Il est très vraisemblable que vous puissiez associer à chacun une grande entreprise qui est soit la principale force de développement, soit au minimum en charge de toutes les activités non liées au développement. Mais Debian est différent. Au sein du projet Debian, toutes les activités requises pour que le projet garde sa vivacité incombent à des volontaires qui en prennent la responsabilité. Ces activités sont extrêmement variées : des traductions à l'administration des systèmes, du marketing au management, de l'organisation de conférences à la conception artistique, de la comptabilité aux considérations juridiques… et tout ceci en plus de l'empaquetage et du développement des logiciels eux-mêmes ! Les contributeurs de Debian prennent tout cela en charge.
ja_jp: しかし、この政治的な観点だけでは Debian の独自性をまだ十分に説明できません。Debian は、その独立性に強く付随する非常に独特な社会実験でもあります。他の主要なフリーソフトウェアディストリビューションや人気のある<emphasis>プロプライエタリ</emphasis>オペレーティングシステムについて、ちょっと考えてみましょう。おそらくそれらは、プロジェクトの裏で開発を主に推し進めているか、または控えめに言っても開発に無関係のすべての活動を請け負っている大企業と結び付けることができるでしょう。Debian は違います。Debian プロジェクトでは、ボランティアが自分自身に Debian が維持され素晴らしいものであり続けるために必要なすべての活動に対する責任を課しています。ボランティア活動の範囲は驚くほどの広い範囲におよびます。つまりその活動範囲は、翻訳からシステム管理、マーケティングから経営、カンファレンス組織からアートワークデザイン、簿記から法的問題など…におよび、ソフトウェアのパッケージングと開発は言うまでもありません! Debian への貢献者はこれらすべての面倒を見ているのです。
nb_no: Men denne politiske visjon er ikke nok til å forklare hvordan Debian er unik. Debian er også et spesielt sosialt eksperiment, sterkt knyttet til sin uavhengighet. Tenk et øyeblikk på andre vanlige frie programvaredistribusjoner, eller til og med populær <emphasis> proprietære </emphasis> operativsystemer. Sannsynligheten er at du kan knytte hvert av dem til et stort selskap som enten er tyngdepunktet i prosjektutviklingen, eller er vertskap for alle ikke-utviklingsaktiviteter. Slik er ikke Debian. Innenfor Debian-prosjektet påtar frivillige seg ansvar for alle aktiviteter som er nødvendig for å holde Debian i beste velgående. Variasjonsbredden er imponerende: Fra oversettelse til systemadministrasjon, fra markedsføring til ledelse, fra konferanseorganisering til visuell design, fra regnskap til juridiske spørsmål ... for ikke å nevne programvarepakking og utvikling! Debians bidragsytere tar vare på alle disse aktivitetene.
pl_pl: Lecz ta polityczna wizja to zbyt mało, aby wyjaśnić wyjątkowość Debiana. System ten jest także bardzo szczególnym eksperymentem społecznym, mocno przywiązanym do swojej niezależności. Proszę pomyśleć przez chwilę o innych, głównych dystrybucjach Wolnego Oprogramowania, a nawet o popularnych <emphasis>własnościowych</emphasis> systemach operacyjnych. Istnieją duże szanse, że te dystrybucje lub systemy zostaną, na pierwszy rzut oka, utożsamione z jakąś dużą firmą informatyczną, będącą ich główną siłą rozwojową lub przynajmniej siłą zarządzającą ich działalnością poza rozwojową. Debian jest inny. Będąc projektem społecznym — jest oparty na pracy wolontariuszy, którzy dobrowolnie przyjmują na siebie odpowiedzialność za wykonywanie poszczególnych zadań na rzecz utrzymywania przy życiu tego systemu i podtrzymywania jego żywotności. Różnorodność tych zadań jest oszałamiająca: od tłumaczeń do administrowania systemem, od marketingu do zarządzania, od organizowania konferencji do ich oprawy artystycznej, od prowadzenia ksiąg handlowych do kwestii prawnych ... nie mówiąc już o pakietowaniu oprogramowania i kwestiach rozwojowych! Współtwórcy i współpracownicy Debiana mają pieczę nad tym wszystkim.
pt_br: Mas esta visão política não é o suficiente para explicar por que o Debian é único. O Debian é também um experimento social bastante particular, fortemente ligado à sua independência. Pense num momento em outras distribuições de software livre importantes, ou mesmo em sistemas operacionais <emphasis>proprietários</emphasis> populares. Há uma boa chance de você associar cada um deles a uma grande companhia que é ou a grande força de desenvolvimento por trás do projeto, ou pelo menos o responsável de toda a atividade que não seja desenvolvimento. No Debian é diferente. Dentro do projeto Debian os voluntários tomam para si a responsabilidade de todas as atividades que são necessárias para manter o Debian vivo e andando. A variedade destas atividades é impressionante: de traduções a administração de sistemas, de marketing a gestão, de organização de eventos a projeto gráfico, de contabilidade a questões legais... sem mencionar o empacotamento de software e o desenvolvimento! Contribuidores Debian cuidam de tudo isto.
ru_ru: Но такой политической точки зрения недостаточно, чтобы объяснить всю уникальность Debian. Debian — это ещё и очень своеобразный социальный эксперимент, связанный с его независимостью. Задумайтесь на мгновение о других ведущих дистрибутивах Свободного программного обеспечения, или даже о популярных <emphasis>коммерческих</emphasis> операционных системах. Скорее всего каждый из них ассоциируется у вас с крупной компанией, или являющейся основной силой разработки, стоящей за проектом, или по крайней мере управляющей всеми не относящимися к разработке делами. Не таков Debian. В этом проекте добровольцы сами берут на себя обязанности по всем направлениям, необходимым для поддержания Debian живым и здоровым. Разнообразие этих направлений ошеломляюще: от переводов до системного администрирования, от маркетинга до руководства, от организации конференций до графического дизайна, от бухгалтерии до юридических вопросов, ... не говоря уже об упаковке программ и разработке! Участники Debian заботятся обо всём этом.
vi_vn: Nhưng tầm nhìn chính trị này là vẫn chưa đủ để giải thích sự độc đáo của Debian. Debian cũng là một thí nghiệm xã hội rất kì lạ, gắn bó với tính tự do của mình. Hãy nghĩ về thời điểm ra đời của các bản phân phối "Phần mềm Tự do", hay hệ điều hành <emphasis>bản quyền</emphasis> phổ biến. Nhiều khả năng là bạn có thể thấy liên kết từng bản phân phối này với một công ty lớn mà đó có thể là lực lượng phát triển chính đằng sau dự án, hoặc ít nhất cũng là người quản lý tất cả hoạt động phi phát triển của nó. Debian không như thế. Các tình nguyện viên của dự án Debian mang trong mình trách nhiệm của tất cả hoạt động mà cần thiết để giữ Debian luôn hoạt động và tăng trưởng. Sự đa dạng của các hoạt động rất đáng kinh ngạc: từ bản dịch đến quản trị hệ thống, từ tiếp thị đến quản lý, từ tổ chức hội nghị đến thiết kế ảnh nghệ thuật, từ kế toán sổ sách tới các vấn đề pháp lý... chưa kể đến đóng gói và phát triển phần mềm! Những người đóng góp (tình nguyện viên) của Debian đảm nhiệm tất cả các vấn đề đó.
zh_cn: 但是这样的政治愿景仍不足以解释 Debian 的独特之处。Debian 也是一个非常独特的社会实验，这与其独立性紧密相关。请试着考虑一下其它主流的基于自由软件的发行版，或者甚至是流行的<emphasis>专有</emphasis>操作系统。您很可能发现它们每一个都和一个大型企业有所关联：这些企业或是其项目背后的主要开发力量，或至少是其所有非开发活动的组织者。Debian 则不一样。在 Debian 项目中， 志愿者自己担负起责任，组织所有让 Debian 项目存活并发展所必需的活动。这些活动五花八门，足以让人头昏脑胀：从翻译到系统管理，从市场营销到项目管理，从会议组织到艺术设计，从账务记录到法律事务……更不要提还有最基础的软件打包和开发呢！然而，Debian 贡献者们肩负起了这些所有的事情。
zh_tw: 但是這樣的政治願景仍不足以解釋 Debian 的獨特之處。Debian 也是一個非常獨特的社會實驗，與其獨立性緊密相關。對照其他主流的自由軟體發行版，或流行的<emphasis>專屬</emphasis>作業系統。您很可能發現它們都和發展該計畫、或至少在非發展活動裡佔有主要力量的大型企業有關。Debian 則不一樣。在 Debian 計畫中，志工自己擔起讓 Debian 活化與啟動的所有責任。這些五花八門頭昏眼花的活動：從翻譯到系統管理、從行銷到管理、從組織會議到藝術設計、從帳戶到法律議題 … 更少不了軟體打包和開發呢！Debian 貢獻者們負起所有的事情。
