Repository: Debian-VN/debian-handbook
Catalog: */00a_preface.po
Languages: es_es, fa_ir, fr_fr, ja_jp, nb_no, pl_pl, pt_br, ru_ru, vi_vn, zh_cn, zh_tw

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
es_es: Como primera consecuencia de esta forma radical de independencia, es que Debian necesita y confía en una comunidad de voluntarios muy diversa. Cualquier habilidad en cualquier área mencionada, u otras que pueda imaginar, puede invertirse en Debian y utilizarse para mejorar el proyecto. Una segunda consecuencia de la independencia de Debian es que se puede confiar en que las decisiones de Debian no son influenciadas por intereses comerciales o empresas específicas — intereses sobre los que no tenemos garantías siempre estén alineados con el objetivo de promocionar el control que tiene la gente sobre las máquinas, como muchos ejemplos recientes en las noticias tecnológicas atestiguan.
fa_ir: به عنوان اولین نتیجه این شکل از استقلال رادیکال، دبیان به طیف بسیار گسترده‌ای از داوطلبان وابسته و نیازمند است. هر توانایی که در چارچوب فعالیت‌های بالا می‌باشد، یا هرآنچه شما فکر می‌کنید، می‌تواند در دبیان بکار گرفته شود تا به بهبود آن کمک کند. دومین نتیجه استقلال دبیان این است که تصمیمات پروژه نمی‌تواند بر اساس سود برخی شرکت‌ها بنیان گذاشته شود - اهدافی که ما نمی‌توانیم ضمانت بکنیم همیشه با ایده کنترل افراد بر ماشین‌ها، یکسو باشند، همانطور بسیاری از اتفاقات اخیر در دنیای فناوری شاهد و گواه این ماجرا است.
fr_fr: La première des conséquences de cette forme d'indépendance radicale est que la communauté Debian est, par nécessité, très hétéroclite. Toutes les compétences mentionnées ci-dessus, et d'autres qui restent à imaginer, peuvent être mises à profit pour contribuer au projet. Une autre conséquence de l'indépendance est qu'on peut avoir confiance dans le fait que les choix de Debian ne sont pas dictés par les intérêts commerciaux d'entreprises spécifiques — intérêts dont rien ne garantit qu'ils restent alignés avec le but de promouvoir le contrôle des ordinateurs par leurs propriétaires, comme de trop nombreux exemples de l'actualité des nouvelles technologies nous l'ont récemment rappelé.
ja_jp: 独立性を徹底的に守ることでもたらされる 1 番目の結果として、Debian は非常に多様なボランティアコミュニティを必要とし、それに依っています。上に挙げたボランティア活動およびその他の考えうる活動の際に要求される能力を使えば、Debian に貢献したり、プロジェクトを改善できるでしょう。Debian の独立性による 2 番目の結果として、特定企業の商業的利権によって Debian の方向性は動かされないことが保証されています。すなわち、技術系のニュース媒体によって検証された数多くの最近の事例の通り、何の保証もされていない Debian の関心は、人々がマシンをコントロールするという目標と同じ方向を常に目指すことになるでしょう。
nb_no: Som en første konsekvens av denne radikale formen for uavhengighet, trenger Debian, og er avhengig av, et svært mangfoldig fellesskap av frivillige. Ferdigheter innenfor noen av områdene ovenfor, eller andre du ser, kan legges inn i Debian, og komme til nytte for å forbedre prosjektet. En annen konsekvens av Debians uavhengighet er at man kan stole på at Debians valg ikke er drevet av kommersielle interesser hos spesifikke selskaper - interesser som vi ikke har noen garanti for alltid vil være knyttet til målet om å fremme folks kontroll over maskiner, noe som for mange ferske eksempler i IKT-nyhetene vitner om.
pl_pl: Pierwszą konsekwencją tej tak radykalnej formy niezależności jest fakt, że Debian potrzebuje bardzo zróżnicowanej społeczności wolontariuszy, na których opiera swoje istnienie. Można twórczo zagospodarować dowolną umiejętność, w dowolnym, wspomnianym wcześniej obszarze (lub inną, możliwą do wyobrażenia), a wszystko po to, aby ulepszyć ten system. Drugą konsekwencją niezależności Debiana jest to, że wybierając go — ufając mu — nie można kierować się względami komercyjnych interesów poszczególnych firm. Nie mamy żadnych gwarancji, że te interesy będą zawsze zgodne z naczelną ideą Wolnego Oprogramowania, która głosi, że to właśnie ludzie mają sprawować kontrolę nad maszynami, a nie odwrotnie. Zbyt wiele bowiem ostatnio słyszy się nowinek technologicznych, które jedynie potwierdzają nasze obawy w tej kwestii.
pt_br: Como uma primeira consequência desta forma radical de independência, o Debian precisa e se apóia em uma comunidade muito variada de voluntários. Qualquer habilidade em qualquer uma das áreas acima, ou outras que você possa imaginar, pode ser feita no Debian e será usada para melhorar o projeto. Uma segunda consequência da independência do Debian é que pode-se confiar que as escolhas do Debian não são voltadas a interesses comerciais de companhias específicas — interesses que não podemos garantir que estarão sempre alinhados com o objetivo de promover a causa das pessoas controlarem as máquinas, assim como muitos exemplos recentes nas notícias de tecnologia atestam.
ru_ru: Как первое следствие этой крайней формы независимости, Debian полагается на очень разнородное сообщество добровольцев и зависит от него. Любые способности в любой из вышеперечисленных областей или других, какие только можно себе представить, могут найти применение в Debian и будут использованы для улучшения проекта. Второе следствие из независимости Debian заключается в том, что решения Debian наверняка не будут зависеть от коммерческих интересов каких-то компаний — интересов, которые не обязательно всегда будут совпадать с целью поддержки контроля людей над машинами, что подтверждается множеством недавних примеров из технических новостей.
vi_vn: Như một hệ quả đầu tiên căn bản của tính độc lập. Debian cần và dựa vào một cộng đồng rất đa đạng của các tình nguyện viên. Bất kỳ kỹ năng ở bất kỳ lĩnh vực nào, hoặc những người bạn có thể hình dung, có thể được tham gia vào Debian và sẽ dùng cải tiến dự án. Một hệ quả thứ hai của tính độc lập mà Debian mang lại, sự lựa chọn Debian là tin cậy bởi vì không được điều khiển bởi lợi ích thương mại với công ty cụ thể nào - lợi ích mà chúng ta không đảm bảo nó luôn luôn liên kết với mục tiêu kiểm soát máy tính. Như rất nhiều ví dụ gần đây mà các trang tin tức công nghệ đã làm chứng.
zh_cn: 作为这种以独立为根本的组织形式的第一个结果，Debian 需要并依赖于具有高度多样性的社区志愿者。任何上述领域的技能，或者其它你可以想象到的方面，都能够应用于 Debian 中并让项目得到改善与提高。Debian 独立性的第二个结果是，Debian 的选择能够被确信是不受特定企业的商业利益所左右的——这些利益并不会永远与我们希望增进人们对机器的控制这一目标保持一致。近期的技术新闻中有太多类似的例子可以证明这一点。
zh_tw: 作為這種以獨立為根本形式的第一個成果，Debian 需要並依賴於具有高度多樣性的社區志工。上述網域的任何技能、或者您可想象的技能，都能應用於 Debian 中並改善此計畫。Debian 獨立性的第二個成果是選擇 Debian 確保不受特定企業的商業利益所左右的 — 這些利益不保證人類對機器的控制，近期在科技新聞中出現太多的例子足以證實此點。

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly distributed. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
es_es: Un último aspecto contribuye a que Debian sea unico: la forma en la que se conduce el experimento social. A pesar de su fama burocrática, la toma de decisiones en Debian está muy distribuida. Existen áreas de responsabilidad bien definidas dentro del proyecto. Quienes están a cargo de dichas áreas pueden hacerlo como lo deseen. Siempre que adhieran a los requisitos de calidad acordados por la comunidad, nadie puede decirles qué hacer o cómo hacerlo. Si desea tener incidencia en cómo se hace algo en Debian, necesita estar dispuesto a poner su reputación en juego y tomar dicho trabajo sobre sus hombros. Esta forma peculiar de meritocracia — a veces llamada <emphasis>«do-ocracy»</emphasis> (del inglés «do»: hacer) — apodera a los colaboradores. Cualquiera con suficiente habilidad, tiempo y motivación puede tener un impacto real en la dirección que toma el proyecto. Es testigo de esto la población de alrededor de 1000 miembros oficiales del Proyecto Debian y miles de colaboradores en todo el mundo. No es sorpresa que se diga que Debian es el proyecto de Software Libre llevado a cabo por una comunidad más grande que existe.
fa_ir: یک جنبه نهایی به منحصربفرد بودن دبیان بسیار کمک می‌کند: راه و روشی که این آزمون اجتماعی اجرا می‌شود. برخلاف رسم و رسوم خشک اداری، تصمیم‌گیری در دبیان بسیار توزیع‌شده صورت می‌پذیرد. قسمت‌های بسیار مشخصی درباره نحوه مسیولیت‌پذیری در پروژه وجود دارد. افرادی که این امور را به عهده می‌گیرند آزادی کامل در اجرای آن دارند. تا زمانی که این افراد با ملزومات کیفی که از طریق جامعه کاربری ایجاد شده است مطابق باشند، کسی نمی‌تواند به آن‌ها بگوید که کار خود را به چه صورت یا به چه شکل انجام دهند. اگر شما قصد انجام کاری در دبیان را دارید، باید قدم پیش بگذارید و مسیولیت انجام آن کار را بپذیرید. این شکل عجیب از شایسته سالاری - که از آن با نام <emphasis>do-ocracy</emphasis> یاد می‌کنیم - برای مشارکت‌کنندگان بسیار کارآمد است. هر فرد با توانایی، زمان و انگیزه کافی می‌تواند تاثیری واقعی بر مسیر فعلی دبیان داشته باشد. این امر توسط ۱۰۰۰ عضو رسمی پروژه دبیان و چندین هزار مشارکت‌کننده جهانی ثابت شده است. نباید تعجب کرد که از دبیان به عنوان بزرگترین پروژه نرم‌افزار آزاد که توسط جامعه کاربری‌اش هدایت می‌شود، در دنیا یاد می‌شود.
fr_fr: Un dernier aspect de l'unicité de Debian concerne la manière dont l'expérience sociale est menée. Contrairement à la réputation de grosse machine bureaucratique qui reste accolée au projet, la manière dont les décisions sont prises au sein du projet est en réalité très faiblement centralisée. Il y a des zones du projet dans lesquelles les responsabilités sont clairement établies ; les personnes en charge de ces zones sont libres de mener leur barque comme il leur convient. Tant qu'elles maintiennent un niveau de qualité correspondant à ce qui est considéré comme requis par la communauté, aucune personne de l'extérieur ne peut exiger qu'elles fassent quoi que ce soit, ni leur dicter comment le faire. Si vous voulez avoir voix au chapitre sur la manière dont Debian fait quelque chose, vous devez être prêt à prendre en charge le travail correspondant. Cette forme de méritocratie — que nous appelons parfois « faisocratie » (<emphasis>do-ocracy</emphasis>, le règne de ceux qui font) — est très valorisante pour les contributeurs. Toute personne qui dispose des compétences, du temps et de la motivation nécessaires peut avoir un impact réel sur la direction que prend le projet. Nous en voulons pour preuve le millier de membres du projet Debian, et les plusieurs milliers d'autres contributeurs dans le monde. Il ne faut donc pas s'étonner que Debian soit souvent cité comme le plus grand projet de logiciel libre communautaire existant dans le monde.
ja_jp: Debian の独立性がもたらす最後の側面 (Debian 内部における社会実験の方法) は、Debian の独自性の一因となっています。役所仕事的であるという噂にも関わらず、実際のところ Debian の意思決定は高度に分散化されています。プロジェクトにおける責任の範囲は、明確に定義されています。責任者は、自身の責任がおよぶ範囲で自由に作業を行えます。コミュニティから求められる品質を守る限り、責任者は自分の作業の内容ややり方に文句を言われることはありません。もしあなたが Debian のやり方に口を出したいのなら、あなた自身が主導して作業を引き受ける心構えがなければいけません。このような能力主義の特異な形はしばしば <emphasis>do-ocracy</emphasis> と呼ばれ、貢献者に強い力を与えます。十分な能力・時間・意欲を持っている人は誰でも、プロジェクトの方向性に大きな影響をおよぼすことができるのです。Debian プロジェクトに参加している一千人あまりの公式メンバーと世界中にいる数千人の貢献者がこの点について証言しています。Debian が、既存プロジェクトの中でもコミュニティ主導の最大のフリーソフトウェアプロジェクトと認知されているのも全く不思議ではありません。
nb_no: Et siste unike aspekt er hvordan Debian arbeider som et sosialt eksperiment: Til tross for omdømmet om å være byråkratisk, er beslutningsprosesser i Debian faktisk svært delt. Det er klart definerte ansvarsområder innenfor prosjektet. Folk som har ansvar for disse områdene står fritt til å drive på egen kjøl. Så lenge de holder seg til de kvalitetskrav som man er enig om i samfunnet (community), kan ingen fortelle dem hva de skal gjøre, eller hvordan de gjør jobben sin. Hvis du vil ha noe å si om hvordan noe gjøres i Debian, må du stille opp, og være klar til å påta deg oppgaven. Denne særegne formen for elitestyre - som vi noen ganger kaller <emphasis>do-ocracy</emphasis>, betyr mye for bidragsytere. Alle med nok kompetanse, tid og motivasjon kan ha en reell innvirkning på retningen prosjektet tar. Dette blir bekreftet fra et antall på om lag 1 000 offentlige medlemmer av Debian-prosjektet, og flere tusen bidragsytere over hele verden. Det er ikke rart at Debian ofte omtales som det største community-drevne Free Software prosjektet.
pl_pl: Ostatnim aspektem, przyczyniającym się do wyjątkowości Debiana jest sposób, w jaki prowadzony jest ten eksperyment społeczny. Pomimo biurokratycznego „folkloru” (jak to niektórzy twierdzą), podejmowanie decyzji w Debianie jest w rzeczywistości wysoce rozproszone. Istnieją jasno określone obszary odpowiedzialności wewnątrz projektu. Ludzie odpowiedzialni za te obszary są wolni w kierowaniu „własną łodzią”. Tak długo, jak długo dotrzymują kroku wymaganiom nałożonym na nich przez społeczność, nikt nie może im nakazać, co mają robić lub w jaki sposób wykonywać swoją pracę. W projekcie mówimy: "jeśli chcesz mieć coś do powiedzenia o tym, jak coś ma być robione w Debianie, to musisz stanąć do szeregu i być gotowym do przyjęcia pracy na swoje barki". Ta szczególna forma merytokracji – którą czasami nazywamy <emphasis>praco-kracją</emphasis> — daje ogromne możliwości uczestnikom projektu. Ktokolwiek z wystarczającymi umiejętnościami, czasem i motywacją może mieć faktyczny wpływ na kierunek, w jakim zmierza projekt. Jest to testowane na ponad tysiącu oficjalnych członków Projektu Debian, jak też na wielu tysiącach współpracowników z całego świata. Nic wiec dziwnego, że Debian jest często uznawany za największy istniejący projekt Wolnego Oprogramowania, napędzany społecznością międzynarodową.
pt_br: Um último aspecto contribui para o fato do Debian ser único: a forma na qual o experimento social é tocado. Apesar do que se diz sobre ser burocrática, a tomada de decisões no Debian é de fato altamente distribuída. Existem áreas bem definidas de responsabilidade dentro do projeto. Pessoas responsáveis por estas áreas são livres para guiarem seus próprios barcos. Desde que alcancem os requisitos de qualidade com os quais a comunidade concorda, ninguém pode dizer o que fazer ou como fazer seu trabalho. Se você quer dar uma olhada em como algo é feito no Debian, você precisa meter a mão na massa e assumir o trabalho. Esta forma peculiar de meritocracia — que às vezes chamados de <emphasis>fazer-cracia</emphasis> — dá muito poder aos contribuidores. qualquer um com as habilidades necessárias, tempo e motivação pode ter um impacto real na direção que o projeto toma. Isto é verificado pela população de cerca de 1000 membros oficiais do projeto Debian, e várias centenas de contribuidores ao redor do mundo. Não é estranho que o Debian seja frequentemente creditado como o maior projeto de software livre liderado pela comunidade em existência.
ru_ru: И ещё одно проявление уникальности Debian: способ, которым осуществляется социальный эксперимент. Вопреки мифу о бюрократизированности, фактически процесс принятия решений в Debian сильно децентрализован. Внутри проекта чётко определены области ответственности. Люди, занятые в этих областях, вольны сами рулить своим кораблём. До тех пор, пока они соответствуют требованиям качества, принятым в сообществе, никто не может указывать им что делать или как выполнять их работу. Если вы хотите высказаться по поводу того, как что-то сделано в Debian, вам нужно лечь на рельсы и быть готовым взвалить работу на свои плечи. Эта своеобразная форма меритократии — которую мы иногда называем <emphasis>делократией</emphasis> — наделяет участников большими правами. Любой, обладающий достаточными способностями, временем и мотивацией, может оказать влияние на путь развития проекта. Свидетели тому — контингент из примерно 1000 официальных членов Проекта Debian и несколько тысяч участников во всём мире. Неудивительно, что Debian часто называют крупнейшим из существующих проектов Свободного ПО, управляемых сообществом.
vi_vn: Một khía cạnh cuối cùng góp phần vào tính độc đáo của Debian: cách mà cộng đồng thử nghiệm hoạt động. Mặc dù văn hoá dân gian là quan liêu, nhưng việc ra quyết định trong Debian có tính phân bố rất cao. Tồn tại các khu vực được xác định rõ ràng trách nhiệm trong trong dự án. Mgười phụ trách trong các khu vực có quyền lái con thuyền riêng của mình. Miễn là họ theo kịp về yêu cầu chất lượng đề ra bởi cộng đồng, không ai có thể nói cho họ rằng làm gì và làm như thế nào với công việc của họ. Nếu bạn muốn nói về làm cái gì đó như thế nào để thực hiện trong Debian, bạn cần đặt chính mình trên đường đi và sẵn sàng chuẩn bị làm công việc trên vai của bạn. Đây là hình thức đặc biệt của chế độ nhân tài - cái mà chúng ta đôi khi gọi <emphasis>do-ocracy</emphasis> - làm nâng cao vị thế cho những người đóng góp. Bất kỳ ai đủ kỹ năng, thời gian và nhiệt huyết có thể có tác động thực sự về hướng đi của dự án. Với dẫn chứng bởi dân số khoảng 1000 thành viên chính thức của dự án Debian, và vài nghìn các nhà đóng góp trên toàn thế giới. Điều đó khiến cho Debian được gọi là dự án thức đẩy cộng đồng "Phần mềm Tự do" lớn nhất từ trước tới nay.
zh_cn: 最后一个成就 Debian 独特之处的因素：这个社会实验运行的方式。尽管有着项目官僚化的传言，但 Debian 内的决策实际上仍然是高度分散的。项目中存在着清晰确定的责任范围，负责各自区域的人们可以在范围中自由发挥。只要他们达到了社区广泛认可的质量要求，没有哪个人可以去要求他们究竟该做什么，或者应该如何做他们自己的工作。如果你想要对 Debian 中的某些工作指手画脚，你可能需要自己站上起跑线，做好亲自接管这些工作的准备。这个奇特的精英阶级的形式——有时候我们称之为<emphasis>行动阶级</emphasis>——十分有利于向做出贡献的人授予权力。任何有足够的技能、时间和动力的人都可以对项目的前进方向产生实在的影响。这已经被大约1000名 Debian 项目的正式成员以及数千名遍布全世界的贡献者们所证实。这也是Debian常常被称为现存最大的社区驱动的自由软件项目的原因。
zh_tw: 最後一個構成 Debian 獨特之處是：這個社會實驗的執行方式。儘管有着官僚化的傳言，但 Debian 的決策圈仍是高度分散的。在計畫中存在着清晰確定的分層負責。各區塊的負責人可自由發揮。只要他們達到了社群認可的品質要求，沒有人可以要求他們該做什麼或該如何做。想對 Debian 中指手畫腳，就需要自己潦下來捲起袖子親自動手。這個奇特的精英文化 — 有時候稱為<emphasis>民主</emphasis> — 對貢獻者授予權力。有足夠的技術、時間和動力的人就可以影響計畫的方向。Debian 計畫經由 1,000 名正式成員，以及遍布全球的數千名貢獻者所認可。所以 Debian 常被稱為現存最大的社群驅動的自由軟體計畫。
