Repository: Debian-VN/debian-handbook
Catalog: */00a_preface.po
Languages: es_es, fa_ir, fr_fr, ja_jp, nb_no, pl_pl, pt_br, ru_ru, vi_vn, zh_cn, zh_tw

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
es_es: Así que Debian es bastante único. ¿Somos los únicos que lo notamos? Definitivamente no. Según <ulink url="http://distrowatch.com/">DistroWatch</ulink>, existen alrededor de 300 distribuciones de Software Libre activas. La mitad de ellas (alrededor de 140) son <emphasis>derivadas</emphasis> de Debian. Esto significa que comienzan con Debian, lo adaptan a las necesidades de sus usuarios — generalmente agregando, modificando o reconstruyendo paquetes — y publican el producto que resulta. Esencialmente, las distribuciones derivadas utilizan las libertadas que ofrece el Software Libre para modificar y redistribuir copias no sólo de porciones individuales de software sino de la distribución completa. El potencial para alcanzar nuevos usuarios y colaboradores de Software Libre a través de distribuciones derivadas es enorme. Creemos que es gracias a ese ecosistema floreciente que el Software Libre hoy en día finalmente le hace frente a software privativo en campos que históricamente eran considerados difíciles de conquistar, como grandes despliegues de sistemas de escritorio. Debian se ubica en la raíz del ecosistema de distribuciones de Software Libre más grande que existe: inclusive si no utiliza Debian directamente, e inclusive si se lo informó su distribuidor, es posible que ahora se esté beneficiando del trabajo de la comunidad de Debian.
fa_ir: بنابراین دبیان بسیار منحصربفرد است. ما تنها شاهد این موضوع هستیم؟ قطعا خیر. بر اساس آمار <ulink url="http://distrowatch.com/">DistroWatch</ulink> چیزی حدود ۳۰۰ توزیع نرم‌افزار آزاد اطراف ما وجود دارند. نصف این تعداد (حدود ۱۴۰) <emphasis>مشتقات</emphasis> دبیان هستند. به این معنی که آن‌ها از دبیان شروع کردند، آن را مطابق با نیاز کاربرانشان کردند - با اضافه، تغییر یا بازسازی بسته‌های نرم‌افزاری - و محصول نهایی را منتشر کردند. در حقیقت، هر توزیع مشتق شده از دبیان نه تنها قوانین مربوط به نرم‌افزار آزاد را در مورد هر یک از بسته‌های نرم‌افزاری موجود در خود رعایت می‌کند بلکه در مورد خود توزیع مشتق شده نیز این امر اتفاق می‌افتد. پتانسیل دستیابی به کاربران جدید نرم‌افزار آزاد و مشارکت‌کنندگان آن با استفاده از توزیع‌های مشتق شده بسیار بالا است. ما معتقدیم که این امر وابسته به اکوسیستم موفقی است که نرم‌افزار آزاد امروزه در رقابت با نرم‌افزاری انحصاری در پیش گرفته است، به خصوص حوزه‌هایی که قبلا فکر می‌کردیم پیروزی در آن‌ها غیرممکن است. دبیان در بالاترین سطح از بزرگترین اکوسیستم توزیع‌های نرم‌افزار آزاد موجود قرار دارد: حتی اگر از دبیان به صورت مستقیم استفاده نمی‌کنید، یا حتی توزیع گنو/لینوکس شما به این مساله نمی‌پردازد، احتمال اینکه هم اکنون از کار جامعه کاربری دبیان سود برده باشید بسیار بالاست.
fr_fr: C'est ainsi : Debian est tout à fait unique. Sommes-nous les seuls à le dire ? Certainement pas. D'après <ulink url="http://distrowatch.com/">DistroWatch</ulink>, il y a actuellement environ 300 distributions de logiciels libres. La moitié (environ 140) sont <emphasis>dérivées</emphasis> de Debian, ce qui signifie qu'elles sont parties d'une base Debian, l'ont adaptée aux besoins spécifiques des utilisateurs qu'elles ciblent — souvent en ajoutant, en modifiant ou en recompilant les paquets — et publient le résultat. Ces distributions dérivées ne font qu'appliquer en substance les libertés du logiciel libre, notamment le droit de modifier et de redistribuer des versions modifiées, et les appliquer pas seulement à des logiciels individuels mais à la distribution dans son ensemble. Cela crée un énorme potentiel pour atteindre non seulement de nouveaux utilisateurs de logiciels libres, mais aussi de nouveaux contributeurs, par le biais de distributions dérivées. Nous pensons que cet écosystème, très vivace, est un des plus grands moteurs qui a permis que le logiciel libre rivalise de nos jours avec le logiciel propriétaire même dans des domaines qui étaient précédemment considérés comme une chasse gardée, tels que les déploiements massifs de machines bureautiques. Et c'est Debian qui est placé à la racine du plus grand écosystème de distributions de logiciels libres actuellement existantes : même si vous n'utilisez pas Debian directement, et même si votre distributeur ne vous l'a pas dit, il est très probable que vous bénéficiez en ce moment même du travail de la communauté Debian.
ja_jp: つまり Debian はとても独特です。これに気が付いているのはわれわれだけでしょうか? そんなわけがありません。<ulink url="http://distrowatch.com/">DistroWatch</ulink> によれば、世界には約 300 の活発なフリーソフトウェアディストリビューションがあります。そのうちの半分 (約 140) は Debian <emphasis>派生物</emphasis>です。Debian <emphasis>派生物</emphasis>とは、それらのディストリビューションが Debian を基にして、ユーザの必要性に合わせた改変 (通常はパッケージの追加、改変、再構築) を行い、その成果物をリリースしていることを意味しています。要するに、派生物はそれを構成している各ソフトウェアだけでなくディストリビューション全体に対して、フリーソフトウェアが保証している自由と同様の、自身のコピーを改変したり再配布する自由を保証しているのです。派生ディストリビューションを通じて、新たなフリーソフトウェアのユーザと貢献者に働きかけることは巨大な潜在的可能性を秘めています。今日、フリーソフトウェアは歴史的に見て乗り越えることが難しいと考えられていた大規模デスクトップ環境などの分野においても、プロプライエタリソフトウェアとようやく張り合うことができるようになっています。これは主に繁栄しているエコシステムのおかげだと考えられています。Debian は、既存のフリーソフトウェアディストリビューションでは最大のエコシステムの根幹に位置しています。つまり、直接 Debian を使っていなかったとしても、ディストリビュータが Debian を基にしていると言わなかったとしても、あなたは Debian コミュニティによる業績の恩恵を今現在受けている可能性があります。
nb_no: Så Debian er ganske unik. Er vi de eneste som oppdager dette? Definitivt ikke. Ifølge<ulink url="http://distrowatch.com/"> DistroWatch </ulink> er det rundt 300 aktive fri programvaredistribusjoner. Halvparten av disse (ca 140) er Debian <emphasis>derivater</emphasis>. Det betyr at de starter fra Debian, tilpasser den til behovene til sine brukere - vanligvis ved å legge til, endre og ombygging av pakker - og legger ut resultatet/produktet. I all hovedsak bruker derivatene de garanterte frihetene i fri programvare til å modifisere og redistribuere kopier, ikke bare for de enkelte deler av programvaren, men til en distribusjon som en helhet. Potensialet til å nå ut til nye fri programvarebrukere og bidragsytere ved hjelp av derivatdistribusjoner er enormt. Vi mener at det først og fremst er takket være et blomstrende økosystem som fri programvare er i dag, at det endelig konkurrerer med proprietær programvare på områder som historisk sett ble vanskelig å erobre, for eksempel store stasjonære utplasseringer. Debian ligger til grunn for det største økosystemet av fri programvaredistribusjoner som finnes. Selv om du ikke bruker Debian direkte, og selv om distributøren ikke har fortalt deg det, er sjansen stor for at du akkurat nå har fordel av arbeidet Debian-samfunnet har levert.
pl_pl: A więc, Debian jest dość unikatowy. Czy tylko my to zauważamy? Zdecydowanie nie. Zgodnie z internetową witryną <ulink url="http://distrowatch.com/">DistroWatch</ulink> istnieje na świecie około 300 aktywnych dystrybucji Wolnego Oprogramowania. Połowa z nich (około 140) to <emphasis>pochodne</emphasis> Debiana. Oznacza to, że twórcy tych dystrybucji przyjmują za punkt wyjścia dystrybucję Debian, dostosowują ją do potrzeb swoich użytkowników — zwykle poprzez dodanie, modyfikację lub przebudowę pakietów — w rezultacie czego powstaje nowa dystrybucja, pochodna od Debiana. Zasadniczo, dystrybucje pochodne stosują wolności (gwarantowane przez Wolne Oprogramowanie) nie tylko do kopii cyfrowych pojedynczych fragmentów oprogramowania, ale także do kopii całych dystrybucji. Za pomocą dystrybucji pochodnych wzrasta niepomiernie możliwość dotarcia do nowych użytkowników i współpracowników Wolnego Oprogramowania. Jesteśmy przekonani, że głównie poprzez ten kwitnący ekosystem — Wolne Oprogramowanie może konkurować z oprogramowanie własnościowym, i to w takich dziedzinach, które — historycznie — uważane były za trudne do rywalizacji, przykładowo, duże wdrożenia oprogramowania typu „biurkowego”. Debian znajduje się u „korzenia” największego, istniejącego obecnie ekosystemu dystrybucji Wolnego Oprogramowania. Nawet, jeśli nie używasz Debiana bezpośrednio; nawet, jeśli twój dostawca oprogramowania przemilcza (choćby pośrednie) związki tego oprogramowania z Debianem, to istnieją duże szanse na to, że właśnie w tej chwili korzystasz z pracy społeczności Debiana.
pt_br: Portanto o Debian é bastante único. Apenas nós percebemos isto? Certamente que não. de acordo com a <ulink url="http://distrowatch.com/">DistroWatch</ulink> existem cerca de 300 distribuições de Software Livre ativas por aí. Metade delas (cerca de 140) são <emphasis>derivadas</emphasis> do Debian. Isto significa que elas iniciaram no Debian, se adaptaram para as necessidades de seus usuários — normalmente adicionando, modificando ou reconstruindo pacotes — e lançaram o produto resultante. Basicamente, derivados aplicam as liberdade do Software Livre de modificar e redistribuir cópias não apenas de partes individuais do software, mas da distribuição como um todo. O potencial de alcançar novos usuários e colaboradores de Software Livre através de distribuições derivadas é imenso. Acreditamos que é principalmente por causa deste próspero ecossistema que o Software Livre está atualmente finalmente rivalizando com o software proprietário em campos considerados historicamente difíceis de conquistar, como grandes instalações de computadores de mesa. O Debian está na raíz deste grande ecossistema de distribuições de Software Livre existentes: mesmo se você não está usando o Debian diretamente, e mesmo se seu fornecedor não te disse, existe uma chance de você estar neste exato momento se beneficiando do trabalho da comunidade Debian.
ru_ru: Итак, Debian весьма уникален. Только ли мы это видим? Определённо нет. В соответствии с <ulink url="http://distrowatch.com/">DistroWatch</ulink> существует около 300 активных дистрибутивов Свободного ПО. Половина из них (примерно 140) — <emphasis>производные</emphasis> Debian. Это значит, что они начались с Debian, адаптировали его для нужд своих пользователей — обычно путём добавления, модификации и пересборки пакетов — и выпустили получившийся продукт. По существу, такие производные применяют гарантированную Свободным ПО свободу модификации и распространения копий не только к отдельным программам, но к дистрибутиву целиком. Потенциал привлечения новых пользователей Свободного программного обеспечения и участников через посредничество производных дистрибутивов огромен. Мы уверены, что во многом именно благодаря этой разрастающейся экосистеме Свободное ПО сегодня наконец конкурирует с коммерческим в тех областях, которые исторически считались трудными для покорения, таких как большие приложения для настольных ПК. Debian является основой крупнейшей из существующих экосистем дистрибутивов Свободного ПО: даже если вы не используете Debian непосредственно, и даже если ваш поставщик не сказал вам, по всей вероятности вы прямо сейчас получаете пользу от работы сообщества Debian.
vi_vn: Vì vậy, Debian khá là độc đáo. Chúng ta có phải là những người nhận thấy điều này. Không hẳn. Theo <ulink url="http://distrowatch.com/">DistroWatch</ulink> có khoảng 300 bản phân phối "Phần mềm Tự do" xung quanh. Một nữa số đó (khoảng 140) là <emphasis>dẫn xuất</emphasis> từ Debian. Có nghĩa là họ phát triển bắt đầu từ Debian, thay đổi để phù hợp với nhu cầu người dùng của họ - thường bằng thêm, chỉnh sửa và xây dựng lại các gói - và phát hành kết quả của sản phẩm. Về bản chất, các dẫn xuất áp dụng quyền tự do của "Phần mềm Tự do" của việc sửa đổi và phân phối lại các bản sao không chỉ cho cá nhân. nhưng được phân phói như toàn bộ. Tiềm năng vươn ra cho người tiếp cận tới "Phần mềm Tự do" mới và những người đóng góp bằng cách bắt nguồn từ các bản phân phối là rất lớn. Chúng ta tin rằng sự phát triển là nhờ hệ sinh thái "Phần mềm Tự do" phát triển mạnh mẽ hiện nay cuối cùng cũng sánh với các phần mềm độc quyền cùng lĩnh vực trong quá khứ khó khăn để chinh phục, chẳng hạn như việc triển khai máy tính đề bàn lớn. Debian nằm ở gốc của hệ sinh thái lớn của các bản phân phối "Phần mềm Tự do" tồn tại: ngay cả khi bạn không sử dụng trực tiếp Debian, và thậm chí nhà phân phối không nói với bạn, tình cờ bạn đang được hưởng lợi từ công việc của cộng đồng Debian.
zh_cn: 因此，Debian 是颇为独特的。我们是唯一注意到这个事实的人吗？当然不是。根据 <ulink url="http://distrowatch.com/">DistroWatch</ulink>，目前存在约300个活跃的自由软件发行版。其中接近一半（大概有140个）是 Debian <emphasis>派生</emphasis>而来。这意味着它们从 Debian 开始，改写它使其符合它们用户的需求——通常方式是添加、修改和重新构建软件包——然后释出最终的产品。实质上，派生版本不仅应用了自由软件授予的自由修改、再分发独立软件副本的权利，更是将这个权利应用到了整个发行版上。经由派生发行版而接触到新的自由软件用户和开发者的潜力十分巨大。我们相信如此繁荣发展的生态系统正是自由软件今日终于能够和专有软件在那些历史上通常认为是难以撼动的领域，例如大型桌面部署这样的领域，有一决高下的能力的主要因素。Debian 作为当前存在的自由软件发行版中最大的一个生态环境中的的基石：即使你不在直接使用 Debian，甚至即便你的（软件）发行者从没有告诉过你，你也有可能正在享受着 Debian 社区的工作产生的益处。
zh_tw: Debian 是獨特的。祗有我們注意到這個事實嗎？當然不是。根據<ulink url="http://distrowatch.com/">DistroWatch</ulink> 網站目前存在約 300 個活躍的自由軟體發行版。接近一半 (大約 140 個) 是 Debian <emphasis>衍生</emphasis> 出來的。這意味着它們從 Debian 開始，改寫使其符合各自使用者的需求 — 通常方式是添加、修改和重新構建套件 — 然後釋出最終的產品。實質上，衍生版本不僅應用了自由軟體授予的自由修改與再散布的權利，不儘散布部份軟體更散布整個發行版。經由衍生發行版接觸到無數自由軟體使用者和開發者。我們相信如此繁榮發展的生態系統正是自由軟體今日終於能夠撼動桌面系統之類領域，傳統上認為該等領域是專有軟體的禁地。Debian 做為自由軟體發行版中最大的生態環境中的基石：即使沒有直接使用 Debian，即便你的 (軟體) 發行者從沒有告訴過你，你也有可能正在享受着 Debian 社群的工作成果。
