Repository: Debian-VN/debian-handbook
Catalog: */00a_preface.po
Languages: es_es, fa_ir, fr_fr, ja_jp, nb_no, pl_pl, pt_br, ru_ru, vi_vn, zh_cn, zh_tw

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
es_es: Esperamos que disfrute, tanto como nosotros esta piedra angular de la lectura libre sobre Debian.
fa_ir: امیدواریم شما نیز مانند ما با اساس آزادی و مطالعه آن در دبیان، ارتباط برقرار کرده و از آن لذت ببرید.
fr_fr: Nous espérons que vous apprécierez autant que nous cette pierre angulaire de la lecture libre sur Debian.
ja_jp: 本書という Debian における読書の自由の礎を、われわれ著者と同じくらい楽しんでいただけることを願っております。
nb_no: Vi håper du vil nyte denne grunnsteinen, ved å lese Debian håndbok (Debian reading Freedom) like mye som vi gjorde.
pl_pl: Mamy nadzieję, że będziesz cieszyć się, tak bardzo jak my, czytaniem tego kamienia węgielnego dla Wolności w stylu Debiana.
pt_br: Esperamos que você curta esta pedra angular do Debian lendo Liberdade tanto como nós.
ru_ru: Надеемся, вы получите не меньшее удовольствие от этого краеугольного камня Свободы чтения Debian, чем мы.
vi_vn: Chúng tôi hi vọng bạn sẽ tận hưởng nền tảng của Debian, tìm hiểu về "Freedom" nhiều hơn như chúng tôi đã làm
zh_cn: 我们希望你能够和我们一起，享受这本 Debian 式的阅读自由之基石。
zh_tw: 希望你能夠和我們一同享受這本 Debian 基石的閱讀自由。

source: October 2015
es_es: Octubre de 2015
fa_ir: اکتبر ۲۰۱۵
fr_fr: Octobre 2015,
ja_jp: 2015 年 10 月
nb_no: Oktober 2015
pl_pl: Październik 2015
pt_br: Outubro de 2015
ru_ru: Октябрь 2015
vi_vn: Tháng 10, 2015
zh_cn: 2015年10月
zh_tw: 2015 年 10 月

source: Stefano Zacchiroli (Debian Project Leader 2010-2013), Lucas Nussbaum (Debian Project Leader 2013-2015) and Neil McGovern (Debian Project Leader 2015-incumbent)
es_es: Stefano Zacchiroli (líder del proyecto Debian 2010-2013), Lucas Nussbaum (líder del proyecto Debian 2013-2015) y Neil McGovern (líder del proyecto Debian 2015-actualmente en el puesto)
fa_ir: استفانو زاخیرولی (رهبر پروژه دبیان ۲۰۱۰-۲۰۱۳)، لوکاس ناسبام (رهبر پروژه دبیان ۲۰۱۳-۲۰۱۵) و نیل مک‌گاورن (رهبر پروژه دبیان ۲۰۱۵-تاکنون)
fr_fr: Stefano Zacchiroli (chef du projet Debian 2010-2013), Lucas Nussbaum (chef du projet Debian 2013-2015) et Neil McGovern (chef du projet Debian depuis 2015)
ja_jp: Stefano Zacchiroli (Debian プロジェクトリーダー 2010-2013)、Lucas Nussbaum (Debian プロジェクトリーダー 2013-2015)、Neil McGovern (Debian プロジェクトリーダー 2015-現職)
nb_no: Stefano Zacchiroli (Debian-prosjektleder 2010-2013), Lucas Nussbaum (Debianprosjektleder 2013-2015) og Neil McGovern (Debianprosjektleder 2015-i dag)
pl_pl: Stefano Zacchiroli (Lider Projektu Debian w latach 2010-2013), Lucas Nussbaum (Lider Projektu Debian w latach 2013-2015) i Neil McGovern (Lider Projektu Debian od 2015 roku, pełniący urząd do chwili obecnej)
pt_br: Stefano Zacchiroli (líder do Projeto Debian 2010-2013), Lucas Nussbaum (líder do Projeto Debian 2013-2015) e Neil McGovern (líder do Projeto Debian 2015-atualmente)
ru_ru: Стефано Закироли (лидер проекта Debian в 2010 — 2013), Лукас Нуссбаум (лидер проекта Debian в 2013 — 2015) и Нейл Мак-Говерн (лидер проекта Debian с 2015 по настоящее время)
zh_cn: Stefano Zacchiroli（Debian 项目领导人 2010-2013）、Lucas Nussbaum（Debian 项目领导人 2013-2015）和 Neil McGovern（Debian 项目领导人 2015至今）
zh_tw: Stefano Zacchiroli (Debian項目領導人 2010-2013) 、Lucas Nussbaum (Debian項目領導人 2013-2015) 和Neil McGovern (Debian項目領導人 2015至今)

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, ửaor books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author's/publisher's reputation.
vi_vn: Nhưng tính độc đáo của Debian đôi khi đi kèm với những hậu quả không mong muốn. Một hậu quả của tầm nhìn Debian trong tự do kỹ thuật số đã cần thiết phải xác định lại những gì chúng ta có ý nghĩa bởi <emphasis>phần mềm</emphasis>. Từ lâu, dự án Debian đã nhận ra rằng, như một phần của một hệ điều hành, bạn cần phân phối nhiều tài nguyên phần mềm như: nhạc, hình ảnh, tài liệu, dữ liệu raw, firmware, vân vân... Nhưng làm thế nào để bạn áp dụng quyền tự do <emphasis>phần mềm<emphasis> vào các tài nguyên đó? Chúng ta có nên có yêu cầu khác cho tài nguyên hoặc tất cả tài nguyên cần giữ ở chuẩn cao của quyền tự do? Dự án Debian đã quyết định lựa chọn phương án hai: tất cả tài nguyên được di chuyển như một phần của Debian nên cung cấp các quyền tự do tương tự cho người dùng. Điều đó có nghĩa là chúng ta không thể phân phối firmuware không miễn phí, hoặc tác phẩm nghệ thuật không nhất thiết dùng trong thương mại, hoặc những quyển sách không thể sửa đổi để tránh làm xấu (như là sách xuất bản bởi văn hoá dân gian) của tác giả/ nhà xuất bản danh tiếng.
