Repository: Debian-VN/debian-handbook
Catalog: */00b_foreword.po
Languages: nb_no, zh_tw

source: The present version is already the seventh edition of the book (we include the first four that were only available in French). This edition covers version 8 of Debian, code-named <emphasis role="distribution">Jessie</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>arm64</emphasis> for 64-bit ARM processors, and <emphasis>ppc64el</emphasis> for little-endian 64-bit PowerPC processors (designed by IBM and licensed to various manufacturers via the OpenPOWER foundation). On the opposite side, some architectures have been dropped (<emphasis>sparc</emphasis>, <emphasis>ia64</emphasis>) due to lack of volunteers to keep up with development (which itself can be explained by the fact that associated hardware is getting old and less interesting to work on). Some architectures are still available (in the <emphasis role="distribution">Unstable</emphasis> distribution) but did not get their <emphasis>ready for release</emphasis> stamp: <emphasis>hurd-i386</emphasis>, <emphasis>kfreebsd-i386</emphasis>, <emphasis>kfreebsd-amd64</emphasis>. All included packages have obviously been updated, including the GNOME desktop, which is now in its version 3.14. More interestingly, there are two new alternative desktops that are available: <ulink url="http://cinnamon.linuxmint.com/">Cinnamon</ulink> (fork of GNOME's Shell created by and for Linux Mint) and <ulink url="http://mate-desktop.org/">MATE</ulink> (continuation of the GNOME 2.x desktop).
nb_no: Den nåværende versjonen er allerede den syvende utgaven av boken (vi inkluderer de fire første som var kun tilgjengelig på fransk). Denne utgaven dekker versjon 8 av Debian, kodenavn <emphasis role="distribution">Jessie</emphasis>. Blant forandringene støtter Debian nå to nye arkitekturer - <emphasis>arm64</emphasis> for 64-bit ARM prosessorer, og <emphasis>ppc64el</emphasis> for little-endian 64-bit PowePC prosessorer (designet av IBM, og lisensiert til forskjellige produsenter via OpenPOWER-stiftelsen. På den andre siden, noen arkitekturer er droppet <emphasis>sparc</emphasis>,<emphasis> ia64</emphasis> på grunn av mangel på frivillige for å følge utviklingen (som i seg selv kan forklares ved det faktum at tilhørende maskinvare blir gammel og mindre interessant å arbeide med). Noen arkitekturer er fortsatt tilgjengelige (i <emphasis role="distribution">Unstable</emphasis> distribusjonen), men fikk ikke sitt<emphasis> klar til utgivelse </emphasis>-stempel: <emphasis>hurd-i386</emphasis>,<emphasis> kfreebsd-i386</emphasis>, <emphasis>kfreebsd-amd64</emphasis>. Alle inkluderte pakker har tydeligvis blitt oppdatert, inkludert GNOME, som nå er i sin versjon 3.14. Mer interessant, to nye alternative skrivebord er tilgjengelige: <ulink url="http://cinnamon.linuxmint.com/">Cinnamon</ulink> (videreutviklet fra GNOMEs Shell laget av og for Linux Mint), og <ulink url="http://mate-desktop.org/">MATE</ulink> (videreføring av GNOME 2.x skrivebord).
zh_tw: 本書已進入第七版 (前四版祗有法文)。本版的內容以 Debian 8 為準，代碼為 <emphasis role="distribution">Jessie</emphasis>。主要的變化是，目前有兩個架構 — <emphasis>arm64</emphasis>係針對 64-bit ARM 處理器，<emphasis>ppc64el</emphasis> 係為 little-endian 64-bit PowerPC 處理器 (IBM 設計經由 OpenPOWER 基金會授權廠商生產)。另一方面，因為缺乏持續發展的志工 (也可解釋為相關的硬體老去且沒人用它們)有些架構不再納入(<emphasis>sparc</emphasis>、<emphasis>ia64</emphasis>)。還有些架構仍可用 (標記為<emphasis role="distribution">不穩定</emphasis>發行版) 但標記為<emphasis>可釋出</emphasis>：<emphasis>hurd-i386</emphasis>、<emphasis>kfreebsd-i386</emphasis>、<emphasis>kfreebsd-amd64</emphasis>。已更新納入的套件，包括 GNOME 桌面，現為 3.14。更有意思的是，現在有兩個不同的桌面：<ulink url="http://cinnamon.linuxmint.com/">Cinnamon</ulink> (給 Linux Mint 用的 GNOME 歧出版) 與 <ulink url="http://mate-desktop.org/">MATE</ulink> (源自於 GNOME 2.x 桌面)。

source: We have added some notes and remarks in sidebars. They have a variety of roles: they can draw attention to a difficult point, complete a notion of the case study, define some terms, or serve as reminders. Here is a list of the most common of these sidebars:
nb_no: Vi har lagt noen notater og bemerkninger i sidefeltene. De har en rekke oppgaver: De kan trekke oppmerksomhet til et vanskelig punkt, fullføre fremstillingen av saken, definere bestemte begreper, eller tjene som påminnelser. Her er en liste over de vanligste av disse sidefelt :
zh_tw: 在邊欄加了筆記和評註。它們有很多作用：讓難點引起您的注意、對實例研究作個備註、定義術語、或者只是提醒一下。常用的邊欄如下：

source: BACK TO BASICS: a reminder of some information that is supposed to be known;
nb_no: DET GRUNNLEGGENDE: En påminnelse om informasjon som er ment å være kjent;
zh_tw: 基本：提醒應該已瞭解該等資訊；

source: VOCABULARY: defines a technical term, sometimes Debian specific;
nb_no: ORDFORRÅD: Definerer et teknisk begrep, noen ganger spesifikt for Debian;
zh_tw: 術語：定義技術用語，有時是 Debian 專用語；

source: COMMUNITY: highlights important persons or roles within the project;
nb_no: COMMUNITY (Samfunnet): Belyser viktige personer eller roller i prosjektet;
zh_tw: 社群：在計畫內重要的人或角色；

source: POLICY: a rule or recommendation from the Debian Policy. This document is essential within the project, and describes how to package software. The parts of the policy highlighted in this book bring direct benefits to users (for example, knowing that the policy standardizes the location of documentation and examples makes it easy to find them even in a new package).
nb_no: POLICY: En regel eller anbefaling fra Debian Policy. Dette dokumentet er viktig i prosjektet, og beskriver hvordan programvare pakkes. De delene av politikken som er fremhevet i denne boken gir direkte fordeler til brukere (for eksempel, å vite at Policy standardiserer plasseringen av dokumentasjon og eksempler som gjør det enkelt å finne dem selv i en ny pakke).
zh_tw: 政策：來自 Debian 政策的規定或建議。此文件是計畫的一部份，描述包裝軟體的規定。此書內的政策直接影響使用者 (例如，規定文件的位置以及即使在新的套件裡也可容易找到它們)。

source: TOOL: presents a relevant tool or service;
nb_no: VERKTØY: Viser passende verktøy eller tjeneste;
zh_tw: 工具：代表相關的工具或服務；

source: IN PRACTICE: theory and practice do not always match; these sidebars contain advice resulting from our experience. They can also give detailed and concrete examples;
nb_no: IN PRACTICE: Teori og praksis samsvarer ikke alltid. Disse sidefeltene inneholder råd ut fra vår erfaring. De kan også gi detaljerte og konkrete eksempler;
zh_tw: 實踐：理論和實踐不見得總是對應的；這類的邊欄註記我們檢驗的結果。也給詳細而具體的例子；

source: other more or less frequent sidebars are rather explicit: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
nb_no: andre sidefelt som brukes er ganske eksplisitte: KULTUR, TIPS, VÆR VARSOM, FOR VIDEREKOMMENDE, SIKKERHET, og så videre.
zh_tw: 其他的邊欄本身就很明顯：文化、技巧、注意、更多、安全，等。

source: Acknowledgments
nb_no: Takk
zh_tw: 致謝

source: A Bit of History
nb_no: En del av historien
zh_tw: 簡史

source: In 2003, Nat Makarévitch contacted Raphaël because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. Raphaël immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
nb_no: I 2003 kontaktet Makarévitch Raphaël fordi han ønsket å utgi en bok om Debian i <foreignphrase> Cahier de l'Admin, </foreignphrase>(Admins håndbok) samling, som han administrerte for Eyrolles, en ledende fransk utgiver av tekniske bøker. Raphaël aksepterte umiddelbart å skrive den. Den første utgaven kom 14. oktober 2004, og ble en stor suksess - den ble solgt ut på knappe fire måneder.
zh_tw: 2003年，為了出版與 Debian 相關的書<foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook)，在知名的法國出版社 Eyrolles 擔任編輯的 Nat Makarévitch 主動與 Raphaël 連繫。 Raphaël 立即答應撰寫此書。第一版是在2004年10月14日上市相當成功 — 4個月內銷售一空。

source: Since then, we have released 6 other editions of the French book, one for each subsequent Debian release. Roland, who started working on the book as a proofreader, gradually became its co-author.
nb_no: Etter det har vi gitt ut 6 andre utgaver av den franske utgaven, en for hver av de påfølgende Debian-utgivelsene. Roland, som begynte å jobbe med boken som korrekturleser, ble gradvis medforfatter.
zh_tw: 此後，我們又發行了此法語書的六個版本，每個版本都對應一個 Debian 版本。Roland，剛開始是校對者，後來慢慢地變成了共同執筆人。

source: While we were obviously satisfied with the book's success, we always hoped that Eyrolles would convince an international editor to translate it into English. We had received numerous comments explaining how the book helped people to get started with Debian, and we were keen to have the book benefit more people in the same way.
nb_no: Mens vi var tydelig fornøyd med bokens suksess, har vi alltid håpet at Eyrolles ville overbevise en internasjonal utgiver om å oversette den til engelsk. Vi hadde fått mange tilbakemeldinger som forklarer hvordan boken har hjulpet folk med å komme i gang med Debian, og vi var opptatt av at boken skulle komme flere til hjelp på samme måte.
zh_tw: 我們對本書的成功感到滿意，所以也經常希望 Eyrolles 能找人它譯成英文。我們收到海量的評論說本書如何幫助他們開始使用 Debian，所以我們也熱衷於讓本書以同樣的方式造福更多的人。

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we negotiated with our French editor Eyrolles and got back the necessary rights to translate the book into English and publish it ourselves. Thanks to a successful crowdfunding campaign, we worked on the translation between December 2011 and May 2012. The “Debian Administrator's Handbook” was born and it was published under a free-software license!
nb_no: Dessverre, ingen engelsktalende utgiver vi kontaktet var villig til å ta risikoen med å oversette og publisere boken. Vi lot oss ikke skremme av dette lille tilbakeslaget. Vi forhandlet med vår franske utgiver Eyrolles, og fikk tilbake de nødvendige rettighetene til å oversette boken til engelsk, og publisere den selv. Takket være en vellykket folkefinansieringskampanje, jobbet vi med oversettelse mellom desember 2011 og mai 2012. «Debian Håndbok» ble født, og den ble utgitt med en fri programvarelisens!
zh_tw: 然而，沒有非英語編輯願意承擔翻譯與出版的責任。沒有被此事推遲，我們與 Eyrolles 磋商由我們翻譯並出版英文版。感謝群眾募資，從2011年12月至2012年5月英文版譯好了。 'Debian 管理員手冊' 問世並且在自由軟體授權下出版！

source: While this was an important milestone, we already knew that the story would be not be over for us until we could contribute the French book as an official translation of the English book. This was not possible at that time because the French book was still distributed commercially under a non-free license by Eyrolles.
nb_no: Selv om dette var en viktig milepæl, visste vi allerede at historien ikke ville være over for oss før vi kunne bidra med fransk bok som en offisiell oversettelse av den engelske boken. Dette var ikke mulig på den tiden, fordi den franske boken fortsatt ble distribuert kommersielt av Eyrolles under en ikke-fri lisens.
zh_tw: 雖然是個重要里程碑，我們沒忘了從英文再譯回法文。顯然不是易事因為當時的法文版仍由 Eyrolles 以非自由授權出版。

source: In 2013, the release of Debian 7 gave us a good opportunity to discuss a new contract with Eyrolles. We convinced them that a license more in line with the Debian values would contribute to the book's success. That wasn't an easy deal to make, and we agreed to setup another crowdfunding campaign to cover some of the costs and reduce the risks involved. The operation was again a huge success and in July 2013, we added a French translation to the Debian Administrator's Handbook.
nb_no: I 2013 ga utgivelsen av Debian 7 en god anledning til å diskutere en ny kontrakt med Eyrolles. Vi overbeviste dem om at en lisens mer i tråd med Debians verdier vil bidra til bokens suksess. Det var ingen enkel avtale å gjøre, og vi ble enige om å starte en ny folkefinansieringskampanje for å dekke noen av kostnadene, og redusere risikoen. Operasjonen ble igjen en stor suksess, og i juli 2013 la vi til en fransk oversettelse til Debians Håndbok.
zh_tw: 2013年 Debian 7 釋出，提供一個與 Eyrolles 談新合約的機會。說服他們與 Debian 價值觀相同的授權有助於該書的成功。不是件簡單的工作，我們再次使用群眾募資支應成本並減少風險。結果是成功的，2013年7月我們加入法文版的 Debian 管理員手冊。

source: The Birth of the English Book
nb_no: Fødselen til den engelske boken
zh_tw: 英文版誕生

source: We are back in 2011 and we just got the required rights to make an English translation of our French book. We are looking into ways to make this happen.
nb_no: Vi er tilbake i 2011, og vi fikk bare de nødvendige rettighetene til å lage en engelsk oversettelse av vår franske bok. Vi så på måter å gjøre dette på.
zh_tw: 回到2011年我們剛拿到法文書的英文翻譯權。正愁如何把它譯出來。

source: Translating a book of 450 pages is a considerable effort that requires several months of work. Self-employed people like us had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowdfunding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
nb_no: Å oversette en bok på 450 sider krever en betydelig innsats på flere måneders arbeid. Selvstendig næringsdrivende som oss hadde behov for å sikre en minsteinntekt for å få nødvendig tid til å fullføre prosjektet. Så vi startet en folkefinansieringskampanje i Ulule, og ba folk om å forplikte seg til å gi garantier til prosjektet. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
zh_tw: 翻譯450頁的書需要好幾個月的時間。我們這些自由工作者必須有最低的收入後才能騰出時間做翻譯的工作。所以我們在 Ulule 網站發起了群眾募資請求大家捐助這個項目。<ulink type="block" url="http://www.ulule.com/debian-handbook/" />

source: The campaign had two goals: raising €15,000 for the translation and completing a €25,000 liberation fund to get the resulting book published under a free license — that is, a license that fully follows the Debian Free Software Guidelines.
nb_no: Kampanjen hadde to mål: Å reise € 15.000 til oversettelse og skaffe et frigjøringsfond på € 25,000 til å utgi den ferdige boken under en fri lisens - det vil si, en lisens som fullt ut følger Debian Free-retningslinjene for programvare.
zh_tw: 此募資活動目標有二：為翻譯募資15,000歐元並募資25,000歐元為 ‘解放基金’ 讓翻譯的書以自由的許可證下發布 — 即完全遵循 Debian 自由軟件指引的許可證發布。

source: When the Ulule campaign ended, the first goal had been achieved with €24,345 raised. The liberation fund was not complete however, with only €14,935 raised. As initially announced, the liberation campaign continued independently from Ulule on the book's official website.
nb_no: Da Ulule-kampanjen ble avsluttet, ble det første målet oppnådd med € 24 345 innsamlet. Frigjøringsfondet ble imidlertid ikke fullført med bare € 14 935. Som først varslet, fortsatte frigjøringskampanjen uavhengig fra Ulule på bokens offisielle hjemmeside.
zh_tw: 在 Ulule 的募資活動結束時，已募集24,345歐元，達成目標。然而解放基金沒有完成，只收到了14,935歐元。按照最初的宣布，解放活動獨立於 Ulule 外在本書的官方網站 繼續進行。

source: While we were busy translating the book, donations towards the liberation continued to flow in… And in April 2012, the liberation fund was completed. You can thus benefit from this book under the terms of a free license.
nb_no: Mens vi var opptatt av å oversette boken, fortsatte donasjonene til frigjøringen å strømme inn ... Og i april 2012 ble frigjøringsfondet fullført. Du har derfor fordelen av at denne boken har fri lisens-vilkår.
zh_tw: 我們忙於翻譯本書時，解放基金的捐款還持續地流入… 直到2012年4月，解放基金達到目標。所有人都自由許可證的本書中受益。

source: We would like to thank everybody who contributed to these fundraising campaigns, either by pledging some money or by passing the word around. We couldn't have done it without you.
nb_no: Vi ønsker å takke alle som har bidratt til disse innsamlingsaksjonene, enten ved å garantere, eller ved å formidle budskapet videre. Vi kunne ikke gjort det uten deg.
zh_tw: 感謝為此募捐活動奉獻的人，捐錢或幫忙宣傳的人。沒有你們我們無法完成這一切。

source: Supportive Companies and Organizations
nb_no: Bedrifter og organisasjoner som har gitt støtte
zh_tw: 支持公司與組織

source: We had the pleasure of getting significant contributions from many free software-friendly companies and organizations. Thank you to <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
nb_no: Vi hadde gleden av å få viktige bidrag fra fri programvarevennlige bedrifter og organisasjoner. Takk til <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), og <ulink url="http://www.syminet.com">Syminet</ulink>.
zh_tw: 我們很高興能得到許多支持自由軟體公司和組織的大力支持。感謝 <ulink url="http://www.codelutin.com">Code Lutin</ulink>、<ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>、<ulink url="http://www.evolix.fr">Evolix</ulink>、<ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>、<ulink url="http://fsffrance.org">FSF France</ulink>、<ulink url="http://www.offensive-security.com">Offensive Security</ulink> (製作 <ulink url="http://www.kali.org">Kali Linux</ulink> 的公司)、<ulink url="http://www.opensides.be">Opensides</ulink>、<ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>、SSIELL (Société Solidaire d'Informatique En Logiciels Libres)、與 <ulink url="http://www.syminet.com">Syminet</ulink>。

source: We would also like to thank <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> and <ulink url="http://www.april.org">April</ulink> for their help in promoting the operation.
nb_no: Vi vil også gjerne takke <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> og <ulink url="http://www.april.org"> April </ulink> for deres hjelp til å fremme denne oppgaven, og gjøre den kjent.
zh_tw: 我們也感謝 <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> 和 <ulink url="http://www.april.org">April</ulink> 幫忙宣傳此活動。

source: Individual Supporters
nb_no: Individuelle støttespillere
zh_tw: 個人支持者

source: With over 650 supporters in the initial fundraising, and several hundred more in the continued liberation campaign, it is thanks to people like you that this project has been possible. Thank you!
nb_no: Med over 650 støttespillere i den innledende innsamlingsrunden, og flere hundre flere i den videre frigjøringskampanjen, er det takket være folk som deg at dette prosjektet ble mulig. Tusen takk!
zh_tw: 第一次集資募捐的650多名支持者，和後來第二階段自由募資的數百名支持者，感謝你們使這個項目變成可能。謝謝！

source: We want to address our special thanks to those who contributed at least €35 (sometimes much more!) to the liberation fund. We are glad that there are so many people who share our values about freedom and yet recognize that we deserved a compensation for the work that we have put into this project.
nb_no: Vi ønsker å formidle en spesiell takk til dem som bidro med minst € 35 (noen ganger mye mer!) til frigjøringsfondet. Vi er glad for at det er så mange som deler våre verdier om frihet, og likevel erkjenner at vi fortjente en kompensasjon for det arbeidet vi har lagt inn i dette prosjektet.
zh_tw: 特別感謝捐助解放基金35歐元 (有些是遠遠超過！) 以上的個人。很高興這麼多人共享自由的價值觀並且體認我們為這項工作付出的努力應得到補償。
