Repository: Debian-VN/debian-handbook
Catalog: */00b_foreword.po
Languages: nb_no, zh_tw

source: If you have the pleasure to read these lines in a paperback copy of the book, then you should join us to thank Benoît Guillon, Jean-Côme Charpentier, and Sébastien Mengin who worked on the interior book design. Benoît is the upstream author of <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — the tool we used to convert DocBook into LaTeX (and then PDF). Sébastien is the designer who created this nice book layout and Jean-Côme is the LaTeX expert who implemented it as a stylesheet usable with dblatex. Thank you guys for all the hard work!
nb_no: Hvis du har gleden av å lese disse linjene i en paperback-kopi av boken, så bør du være med oss i å takke Benoît Guillon, Jean-Côme Charpentier, og Sébastien Mengin som jobbet med det indre bokdesignet. Benoît er oppstrøms forfatter av <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> - verktøyet vi brukte til å konvertere DocBook til LaTeX (og deretter PDF). Sébastien er designeren som skapte den fine layouten til boken, og Jean-Côme er LaTeX-eksperten som implementerte den som et stilark som kan brukes med dblatex. Takk til dere for alt det harde arbeidet!
zh_tw: 如果您有幸閱讀印本，那麼要感謝 Benoît Guillon、Jean-Côme Charpentier 和 Sébastien Mengin 為書本內頁做了設計。 Benoît 是 <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> 的上游作者 — 用它來把 DocBook 格式轉換成 LaTeX 格式 (再轉成 PDF 格式)。Sébastien 是此優美佈局的設計師而Jean-Côme 則是 LaTeX 專家以 dblatex 把它轉換為可用的樣式表 。感謝你們的辛勤工作！

source: Finally, thank you to Thierry Stempfel for the nice pictures introducing each chapter, and thank you to Doru Patrascu for the beautiful book cover.
nb_no: Til slutt, takk til Thierry Stempfel for de fine bildene som starter hvert kapittel, og takk til Doru Pătraşcu for det vakre bokomslaget.
zh_tw: 最後，感謝 Thierry Stempfel 為每一章帶來的精美圖片，感謝 Doru Patrascu 的漂亮封面。

source: Thanks to Translators
nb_no: Takk til oversettere
zh_tw: 感謝翻譯者

source: Ever since the book has been freed, many volunteers have been busy translating it to numerous languages, such as Arabic, Brazilian Portuguese, German, Italian, Spanish, etc. Discover the full list of translations on the book's website: <ulink url="http://debian-handbook.info/get/#other" />
nb_no: Helt siden boken har blitt frigjort, har mange frivillige vært opptatt av å oversette den til en rekke språk, som arabisk, brasiliansk portugisisk, tysk, italiensk, spansk, etc. Se den fullstendige listen over oversettelser på bokens nettside:<ulink url="http://debian-handbook.info/get/#other" />
zh_tw: 此書自由後，很多志願者把它譯為多種語文，包括阿拉伯文、巴西葡萄牙語、德文、繁體、簡體等，詳細清單參見本書網站：<ulink url="http://debian-handbook.info/get/#other" />

source: We would like to thank all the translators and translation reviewers. Your work is highly appreciated because it brings Debian into the hands of millions of persons who cannot read English.
nb_no: Vi vil gjerne takke alle oversettere og de som har gjennomgått oversettelsene. Deres arbeid er høyt verdsatt fordi det bringer Debians til millioner av mennesker som ikke kan lese engelsk.
zh_tw: 感謝譯者及其校閱者。您的努力把 Debian 帶給數百萬無法閱讀英文的人。

source: Personal Acknowledgments from Raphaël
nb_no: Personlig takk fra Raphaël
zh_tw: Raphaël 的個人謝辭

source: First off, I would like to thank Nat Makarévitch, who offered me the possibility to write this book and who provided strong guidance during the year it took to get it done. Thank you also to the fine team at Eyrolles, and Muriel Shan Sei Fan in particular. She has been very patient with me and I learned a lot with her.
nb_no: Først vil jeg gjerne takke Nat Makarévitch, som tilbød meg muligheten til å skrive denne boken, og som har gitt solid veiledning gjennom det året det tok å få det gjort. Takk også til det fine teamet på Eyrolles, Muriel Shan Sei Fan spesielt. Hun har vært veldig tålmodig med meg, og jeg har lært mye med henne.
zh_tw: 首先，感謝 Nat Makarevich，他提供寫這本書的機會並且給予強而有力的指導。也感謝 Eyrolles 的優秀團隊，特別是 Muriel Shan Sei Fan。她對我很有耐心我也從她那裡學到很多。

source: The period of the Ulule campaigns were very demanding for me but I would like to thank everybody who helped to make them a success, and in particular the Ulule team who reacted very quickly to my many requests. Thank you also to everybody who promoted the operations. I don't have any exhaustive list (and if I had it would probably be too long) but I would like to thank a few people who were in touch with me: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Florent Zara of LinuxFr.org, Manu of Korben.info, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, the marketing team at Eyrolles, and numerous others that I have forgotten (sorry about that).
nb_no: Perioden med Ulule-kampanjer ble veldig krevende for meg, men jeg vil gjerne takke alle som bidro til å gjøre den til en suksess, og spesielt Ulule-teamet som reagerte svært raskt på mine mange forespørsler. Takk også til alle som sikret fremdriften av prosjektet. Jeg har ikke noen uttømmende liste (og hvis jeg hadde det, ville den trolig være for lang), men jeg vil gjerne takke noen få mennesker som var i kontakt med meg: Joey-Elijah Sneddon og Benjamin Humphrey i OMG! Ubuntu, Florent Zara i LinuxFr.org, Manu i Korben.info, Frédéric Couchet i April.org, Jake Edge i Linux Weekly News, Clement Lefebvre i Linux Mint, Ladislav Bodnar i Distrowatch, Steve Kemp i Debian-Administration.org, Christian Pfeiffer Jensen i Debian-News.net, Artem Nosulchik i LinuxScrew.com, Stephan Ramoin i Gandi.net, Matthew Bloch i Bytemark.co.uk, teamet hos Divergence FM, Rikki Kite i Linux New Media, Jono Bacon, markedsføringsteamet i Eyrolles. Og utallige andre som jeg har glemt, og det er jeg lei meg for.
zh_tw: 在 Ulule 的募資是必要的感謝每個曾幫助我的人，尤其是對我有求必應的 Ulule 團體。更感謝每個幫忙推廣的人。沒辦法列出完整的清單 (即使有也太長) 但想特別感喭戈幾位與我保持連繫的人：OMG! Ubuntu 網站的 Joey-Elijah Sneddon 與 Benjamin Humphrey、LinuxFr.org 網站的 Florent Zara、Korben.info 網站的 Manu、April.org 網站的 Frédéric Couchet、Linux Weekly News 網站的 Jake Edge、Linux Mint 網站的 Clement Lefebvre、Distrowatch 網站的 Ladislav Bodnar、Debian-Administration.org 網站的 Steve Kemp、Debian-News.net 網站的 Christian Pfeiffer Jensen、Artem LinuxScrew.com 網站的 Nosulchik、Gandi.net 網站的 Stephan Ramoin、Bytemark.co.uk 網站的Matthew Bloch、Divergence FM 網站的團隊、Linux New Media 網站的Rikki Kite、Jono Bacon、Eyrolles 出版社的行銷團隊，以及我忘記的人 (很抱歉)。

source: I would like to address a special thanks to Roland Mas, my co-author. We have been collaborating on this book since the start and he has always been up to the challenge. And I must say that completing the Debian Administrator's Handbook has been a lot of work…
nb_no: Jeg ønsker å gi en spesiell takk til Roland Mas, min medforfatter. Vi har samarbeidet om denne boken siden starten, og han har alltid vært på høyde med utfordringen. Jeg må si at å komplettere Debian Håndbok har vært mye arbeid …
zh_tw: 我要特別感謝我的共同執筆人 Roland Mas。我們從一開始就合作這本書他總是勇於面對挑戰。我必須承認完成Debian 管理員手冊是件大工程…

source: Last but not least, thank you to my wife, Sophie. She has been very supportive of my work on this book and on Debian in general. There have been too many days (and nights) when I left her alone with our 2 sons to make some progress on the book. I am grateful for her support and know how lucky I am to have her.
nb_no: Sist men ikke minst, takk til min kone, Sophie. Hun har vært veldig støttende til mitt arbeid med denne boken og med Debian generelt. Det har vært for mange dager (og netter) da jeg forlot henne, alene med våre 2 sønner, for å arbeide videre med boken. Jeg er takknemlig for hennes støtte, og vet hvor heldig jeg er som har henne.
zh_tw: 最後但不是最不重要，謝謝內人，Sophie。他支持我寫這本書也支持我用 Debian。常常拋下他們母子三人 (夜以繼日) 就為了寫書。感謝他的支持並知道自己很幸運擁有他。

source: Personal Acknowledgments from Roland
nb_no: Personlige anerkjennelser fra Roland
zh_tw: 對 Roland 的致謝

source: Well, Raphaël preempted most of my “external” thank-yous already. I am still going to emphasize my personal gratitude to the good folks at Eyrolles, with whom collaboration has always been pleasant and smooth. Hopefully the results of their excellent advice hasn't been lost in translation.
nb_no: Vel, Raphaël foregrep allerede de fleste av mine takk til «de andre». Jeg kommer fortsatt til å understreke min personlige takknemlighet til de meget dyktige medarbeiderne på Eyrolles, med hvilke samarbeidet alltid har vært hyggelig og smidig. Forhåpentligvis går ikke resultatene av deres gode råd tapt i oversettelsen.
zh_tw: 好吧，Raphaël 把很多我的 ‘對外’ 的感謝都先說了。但還是要強調個人對 Eyrolles 的好伙伴們的感激，和他們的合作總是那麼地愉快而順暢。希望他們的優秀建議並沒有在翻譯中被埋沒。

source: I am extremely grateful to Raphaël for taking on the administrative part of this English edition. From organizing the funding campaign to the last details of the book layout, producing a translated book is so much more than just translating and proofreading, and Raphaël did (or delegated and supervised) it all. So thanks.
nb_no: Jeg er svært takknemlig for at Raphaël tok på seg den administrative delen av den engelske utgaven, fra å organisere finansieringskampanjen, ned til de siste detaljene i bokens layout. Å produsere en oversatt bok er så mye mer enn bare å oversette og korrekturlese, og Raphaël gjorde (eller delegerte og overvåket) alt. Så tusen takk.
zh_tw: 我極度感謝 Raphaël 負責英文版的管理工作。從組織募款活動到書本版面的細節，製作一本譯本比翻譯和校對要多很多工作，Raphaël 把這些工作都做了 (或委派、監督其他人做了)。太感謝了。

source: Thanks also to all who more or less directly contributed to this book, by providing clarifications or explanations, or translating advice. They are too many to mention, but most of them can usually be found on various #debian-* IRC channels.
nb_no: Takk også til alle som mer eller mindre direkte har bidratt til denne boken, ved å gi avklaringer eller forklaringer, eller oversette råd. De er for mange til å nevnes, men de fleste av dem kan vanligvis finnes på ulike #debian-* IRC kanaler.
zh_tw: 也感謝那些對本書直接貢獻的人，例如那些提供澄清和解釋、或者提供翻譯建議。他們多到不勝枚舉，但都能在各個 #debian-* 的 IRC 頻道裡找到。

source: There is of course some overlap with the previous set of people, but specific thanks are still in order for the people who actually do Debian. There wouldn't be much of a book without them, and I am still amazed at what the Debian project as a whole produces and makes available to any and all.
nb_no: Det er selvfølgelig noe overlapping med det forrige settet med hjepere, men spesifikk takk er fortsatt i orden for dem som faktisk lager Debian. Det ville ikke være mye til bok uten dem, og jeg er fortsatt overrasket over hva Debian-prosjektet som helhet produserer og gjør tilgjengelig for folk flest.
zh_tw: 當然前面這幾部分的人肯定有重複的，但接下來還是要特別感謝直接為 Debian 努力的。沒有他們就沒洧這本書， Debian 作為一個對任何人和所有人開放計畫，至今我依然讚歎不已。

source: More personal thanks go to my friends and my clients, for their understanding when I was less responsive because I was working on this book, and also for their constant support, encouragement and egging on. You know who you are; thanks.
nb_no: Flere personlige takk går til mine venner og mine klienter, for deres forståelse da jeg var mindre lydhør fordi jeg jobbet med denne boken, og også for deres konstante støtte og oppmuntring. Dere vet hvem dere er. Takk.
zh_tw: 更多的感謝給予我的朋友和客戶，感謝他們諒解我為了這本書而不太理會其他事情，也感謝他們一貫的支持、鼓勵和鼓動。是誰你懂的；謝謝。

source: And finally; I am sure they would be surprised by being mentioned here, but I would like to extend my gratitude to Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, and of course the late Douglas Adams. The countless hours I spent enjoying their books are directly responsible for my being able to take part in translating one first and writing new parts later.
nb_no: Og til slutt. Jeg er sikker på at de ville bli overrasket over å bli nevnt her, men jeg ønsker å utvide min takknemlighet til Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, og selvfølgelig avdøde Douglas Adams. De utallige timene jeg tilbrakte med deres bøker er direkte medansvarlig for at jeg er i stand til å være med å få oversatt en først, og senere skrive nye deler.
zh_tw: 最後；我要謝謝那些被我提及而吃驚的人，還是要把我的感謝加給 Terry Pratchett、Jasper Fforde、Tom Holt、William Gibson、Neal Stephenson，與已故的 Douglas Adams。無止盡地享受他們的書使我有能力直接翻譯本書並續寫新的篇章。
