Repository: Debian-VN/debian-handbook
Catalog: */00b_foreword.po
Languages: nb_no, zh_tw

source: Foreword
nb_no: Forord
zh_tw: 前言

source: Linux has been garnering strength for a number of years now, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
nb_no: Linux har i en rekke år samlet styrke, og den økende populariteten gjør at flere og flere brukere bytter over. Første skrittet på veien er å velge en distribusjon. Dette er en viktig beslutning, fordi hver distribusjon har sine egne særegenheter, og fremtidige migreringskostnader kan unngås hvis det riktige valget gjøres fra start.
zh_tw: 最近，Linux 功能越來越強大，日益增長的名氣吸引更多的使用者。採用 Linux 的第一步是選擇發行版。這是一個重要的抉擇，因為每種發行版本都有其自身的特殊性，從開始做了正確的選擇，便能避免未來的遷移成本。

source: <emphasis>BACK TO BASICS</emphasis> Linux distribution, Linux kernel
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> Linux-distribusjon, Linux-kjerne
zh_tw: <emphasis>基礎知識</emphasis> Linux 發行版與 Linux 核心

source: <primary>Linux</primary><secondary>kernel</secondary>
nb_no: <primary>Linux</primary><secondary>-kjerne</secondary>
zh_tw: <primary>Linux</primary><secondary> 核心</secondary>

source: <primary>Linux</primary><secondary>distribution</secondary>
nb_no: <primary>Linux</primary><secondary>-distribusjon</secondary>
zh_tw: <primary>Linux</primary><secondary>發行版</secondary>

source: <primary>distribution</primary><secondary>Linux distribution</secondary>
nb_no: <primary>distribusjon</primary><secondary>Linux-distribusjon</secondary>
zh_tw: <primary>發行版</primary><secondary>Linux 發行版</secondary>

source: Strictly speaking, Linux is only a kernel, the core piece of software which sits between the hardware and the applications.
nb_no: Strengt tatt er Linux bare en kjerne, den grunnleggende biten programvare som sitter mellom maskinvaren og brukerprogrammene.
zh_tw: 嚴格說，Linux 只是一個核心，是處於硬體與應用程序之間的核心軟體。

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into a tool that is actually useful.
nb_no: En «Linux-distribusjon» er et komplett operativsystem. Det inkluderer vanligvis Linux-kjernen, et installasjonsprogram, og aller viktigst brukerprogrammer, og annen programvare som kreves for å gjøre en datamaskin til et verktøy som faktisk er nyttig.
zh_tw: Linux 發行版則指完整的作業系統；通常包括 Linux 核心、安裝程式、大部分重要的應用程式與其它能把電腦變得有用的軟體。

source: Debian GNU/Linux is a “generic” Linux distribution that fits most users. The purpose of this book is to show its many aspects so that you can make an informed decision when choosing.
nb_no: Debian GNU/Linux er en «generisk» Linux-distribusjon som passer de fleste brukere. Formålet med denne boken er å vise allsidigheten, slik at du kan ta en informert avgjørelse når du velger.
zh_tw: Debian GNU/Linux 是個適合於大多數使用者的 “通用” Linux 發行版。本書的目的便是介紹它，從而幫助你明智的抉擇。

source: Why This Book?
nb_no: Hvorfor denne boken?
zh_tw: 為什麼寫這本書？

source: <emphasis>CULTURE</emphasis> Commercial distributions
nb_no: <emphasis>KULTUR</emphasis> Kommersielle distribusjoner
zh_tw: <emphasis>文化：</emphasis> 商業發行版

source: <primary>distribution</primary><secondary>commercial distribution</secondary>
nb_no: <primary>distribusjon</primary><secondary>kommersiell distribusjon</secondary>
zh_tw: <primary>發行版</primary><secondary>商業發行版</secondary>

source: Most Linux distributions are backed by a for-profit company that develops them and sells them under some kind of commercial scheme. Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
nb_no: De fleste Linux-distribusjoner er støttet av et kommersielt selskap som utvikler og selger dem med noen form for kommersiell ordning. Eksempler er <emphasis>Ubuntu</emphasis>, hovedsakelig utviklet av <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, av det franske selskapet <emphasis>Mandriva SA</emphasis>; og <emphasis>Suse Linux</emphasis>, vedlikeholdt og gjort kommersielt tilgjengelig av <emphasis>Novell</emphasis>.
zh_tw: 多數 Linux 發行版是由以營利為目的的公司開發與銷售。例如 <emphasis>Ubuntu</emphasis>，主要由 <emphasis>Canonical Ltd.</emphasis>開發；<emphasis>Mandriva Linux</emphasis>，由法國公司 <emphasis>Mandriva SA</emphasis>開發；以及 <emphasis>Suse Linux</emphasis>，由 <emphasis>Novell</emphasis>維護與銷售。

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet. While some of them do work on Debian as part of their paid job in various companies, the project as a whole is not attached to any company in particular, nor does any one company have a greater say in the project's affairs than what purely volunteer contributors have.
nb_no: I den andre enden av spekteret ligger de som likner Debian og Apache Software Foundation (som huser utvikling for Apache nettjener). Debian er først og fremst et prosjekt i fri programvareverdenen, gjennomført av frivillige som arbeider sammen gjennom Internett. Mens noen gjør arbeidet med Debian som en del av en jobb i ulike bedrifter, er prosjektet som helhet ikke knyttet til noen bedrift spesielt. Et enkelt selskap har heller ikke en større innflytelse i prosjektets aktiviteter enn det de rent frivillige bidragsyterne har.
zh_tw: 另一方面也存在著 Debian 和 Apache 軟體基金會 (主持 Apache 網頁伺服器的開發) 等單位。Debian 是自由軟體世界的領導者，志願者經由網際網路共同開發它。部份的志願者在不同的公司中帶薪為 Debian 工作，可是 Debian 計畫本身不附屬於任何公司，也沒有任何公司在計畫的事務上擁有更重要的話語權。

source: Linux has gathered a fair amount of media coverage over the years; it mostly benefits the distributions supported by a real marketing department — in other words, company-backed distributions (Ubuntu, Red Hat, SUSE, Mandriva, and so on). But Debian is far from being a marginal distribution; multiple studies have shown over the years that it is widely used both on servers and on desktops. This is particularly true among webservers where Debian is the leading Linux distribution. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
nb_no: Linux har fått en god del pressedekning gjennom årene. Mest til fordel for distribusjoner som støttes av en markedsavdeling - med andre ord selskapsstøttede distribusjoner (Ubuntu, Red Hat, SUSE, Mandriva, og så videre). Men Debian er langt fra å være en marginal distribusjon. Flere studier har over år vist at den er mye brukt både på servere og på stasjonære datamaskiner. Dette gjelder særlig for nettjenere der Debian er den ledende Linux-distribusjonen. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
zh_tw: 近年來 Linux 已在媒體佔有相當篇幅；絕大部分受益於市場部門支持的發行版 — 換言之，公司支持的發行版 (Ubuntu、紅帽、SUSE、Mandriva 等) 。然而 Debian 並不是所謂的邊緣發行版；若干研究指出這些年來 Debian 被廣泛使用於伺服器和桌面電腦。特別在網頁伺器領域 Debian 是居於領導地位的 Linux 發行版。<ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />

source: The purpose of this book is to help you discover this distribution. We hope to share the experience that we have gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you will join us sometime…
nb_no: Hensikten med boken er å hjelpe deg å oppdage denne distribusjonen. Vi håper å dele den erfaringen vi har samlet etter at vi ble med i prosjektet som utviklere og bidragsytere i 1998 (Raphaël) og 2000 (Roland). Med litt hell, vil vår entusiasme være smittsom, og kanskje du en gang i fremtiden slår det sammen med oss…
zh_tw: 本書的目的是幫助您探索這個發行版。我們希望分享1998年 (Raphaël) 與2000年 (Roland) 以來參與此計畫的開發者與貢獻者的經驗。運氣好的話，我們的熱心是累積的，期望您也能加入我們 …

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and over the years the situation slipped back to one where there were very few good books on Debian. We hope that this book, which has started a new life with its translation into English (and several translations from English into various other languages), will fill this gap and help many users.
nb_no: Den første utgaven av denne boken (i 2004) bidro til å fylle et stort hull. Den var den første franskspråklige boken som utelukkende fokuserte på Debian. På den tiden var det mange andre bøker skrevet om emnet både på fransk og engelsk. Dessverre ble nesten ingen av dem oppdatert, og gjennom årene har situasjonen glidd tilbake til da det var svært få gode bøker om Debian. Vi håper at denne boken, som har startet et nytt liv da den ble oversatt til engelsk (og flere oversettelser fra engelsk til ulike andre språk som norsk), vil fylle dette gapet, og hjelpe mange brukere.
zh_tw: 本書的第一版 (2004年) 填補了一個空白：完全專注於 Debian 的法語書。當時，還有為法語和英語讀者寫的其他圖書。不幸的是它們幾乎沒有更新過，如今我們再次發現關於 Debian 的好書實在是太少了。我們真誠地希望，本次的英文譯本 (以及包括繁體在內的譯本)，可填補這一空窗並幫助更多使用者。

source: Who Is this Book For?
nb_no: Hvem passer boken for?
zh_tw: 為誰而寫？

source: We tried to make this book useful for many categories of readers. First, systems administrators (both beginners and experienced) will find explanations about the installation and deployment of Debian on many computers. They will also get a glimpse of most of the services available on Debian, along with matching configuration instructions and a description of the specifics coming from the distribution. Understanding the mechanisms involved in Debian's development will enable them to deal with unforeseen problems, knowing that they can always find help within the community.
nb_no: Vi har prøvd å gjøre denne boka nyttig for mange grupper lesere. Først vil systemadministratorer, både nybegynnere og erfarne, finne forklaringer om installasjon og utrulling av Debian på mange datamaskiner. De vil også få et glimt av de fleste av tjenestene som er tilgjengelige på Debian, sammen med passende konfigurasjonsinstruksjoner, og en beskrivelse av distribusjonens spesifikasjoner. Å forstå mekanismene i utviklingen av Debian-utviklingen vil gjøre dem i stand til å håndtere uforutsette problemer, vel vitende om at de alltid kan finne hjelp i samfunnet.
zh_tw: 我們試圖讓本書適用於各種類型的讀者。首先，系統管理員 (初學者與老手) 將會在書中找到關於在多種電腦安裝和部署 Debian 的說明。他們也可一瞥 Debian 所能提供的多數服務，以及與發行版有關的組態指令與描述規格。了解 Debian 開發中涉及的機制將使讀者得以應付未預期的問題，並且讓他們知道總能從社群中得到幫助。

source: Users of another Linux distribution, or of another Unix variant, will discover the specifics of Debian, and should become operational very quickly while benefiting fully from the unique advantages of this distribution.
nb_no: Brukere av en annen Linux-distribusjon, eller av en annen Unix-variant, vil finne Debians spesifikasjoner, og skulle bli operative veldig raskt, og dra full nytte av de unike fordelene med denne distribusjonen.
zh_tw: 其它 Linux 發行版，或其他 Unix 變種的使用者，將會在書中發掘 Debian 的特性，並能在充分受益於此發行版獨特優勢的同時快速投入實用。

source: Finally, readers who already have some knowledge of Debian and want to know more about the community behind it should see their expectations fulfilled. This book should make them much closer to joining us as contributors.
nb_no: Endelig, lesere som allerede har noe kjennskap til Debian, og ønsker å vite mer om samfunnet bak det (community), bør få sine forventninger oppfylt. Denne boken bør åpne for å komme mye nærmere og bli med oss som bidragsytere.
zh_tw: 最後，對於已經具備一些 Debian 知識的讀者，且想揭開 Debian 背後社區的神秘面紗，本書將能滿足這個願望。本書可該他們更願意加入為開發者。

source: General Approach
nb_no: Generell tilnærming
zh_tw: 一般方法

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the “Debian way” of doing things.
nb_no: All generisk dokumentasjon du kan finne om GNU/Linux gjelder også for Debian, ettersom Debian inkluderer den vanligste frie programvare. Distribusjonen bringer likevel mange forbedringer, noe som er grunnen til at vi først og fremst velger å beskrive «Debian-måten» å gjøre ting på.
zh_tw: 所有你能找到的適用於 GNU/Linux 的通用文件也適用於 Debian，因為 Debian 包括最常見的自由軟體。不過，作為一個發行版， Debian 帶來了許多改進，這就是為什么我們寫本書時着重說明如何以 ‘Debian 風格’ 行事。

source: It is interesting to follow the Debian recommendations, but it is even better to understand their rationale. Therefore, we won't restrict ourselves to practical explanations only; we will also describe the project's workings, so as to provide you with comprehensive and consistent knowledge.
nb_no: Det er interessant å følge Debians anbefalinger, men det er enda bedre å forstå begrunnelsen. Derfor vil vi ikke begrense oss til bare praktiske forklaringer. Vi vil også beskrive prosjektets arbeid, for å gi deg helhetlig og konsistent kunnskap.
zh_tw: 按照 Debian 建議的方式做事是很有意思的，但若能理解其基本原理則更好。因此，我們不會僅局限於作業說明上，我們也將說明項目內部的運作機制，以便提供讀者全面和一致的認知。

source: Book Structure
nb_no: Bokens opplegg
zh_tw: 本書架構

source: This book has its origins in French publisher Eyrolles' “Administrator's Handbook” collection, and keeps the same approach of revolving around a case study providing both support and illustration for all topics being addressed.
nb_no: Denne boken har sin opprinnelse i den franske utgiveren Eyrolles «Administratorens håndbok»-samling, og beholder den samme, samlende tilnærmingen rundt en case-studie som gir både støtte og illustrasjon for alle temaer som blir berørt.
zh_tw: 本書源起於法國 Eyrolles 出版社的 'Administrator's Handbook'，改寫後以個案方式提供所有主題的支援與說明。

source: <emphasis>NOTE</emphasis> Web site, authors' email
nb_no: <emphasis>NOTE</emphasis> Nettsted, forfatterens e-post
zh_tw: <emphasis>y說明</emphasis> 網站、讀者的電子郵件

source: This book has its own website, which hosts whatever elements that can make it more useful. In particular, it includes an online version of the book with clickable links, and possible errata. Feel free to browse it and to leave us some feedback. We will be happy to read your comments or support messages. Send them by email to <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
nb_no: Denne boken har sin egen nettside, som samler elementer, uansett hvilke, som kan gjøre den mer nyttig. Spesielt har boken en elektronisk versjon med klikkbare lenker, og mulige feilrapporter. Bla gjerne igjennom den, og gi oss tilbakemelding. Vi vil gjerne lese dine kommentarer eller positive tilbakemeldinger. Send dem via e-post til <email>hertzog@debian.org</email> (Raphaël) og <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
zh_tw: 本書有自己的網站，放置可以豐富本書的其他元素。值得一提的是，本書的電子版可在該網站上找到，包含勘誤表。請盡情瀏覽該網站並給我們一些回饋。我們將很樂意閱讀您對繁體版的意見或支援訊息。請將它們傳送電子郵件到 <email>hertzog@debian.org</email> (Raphaël) 和 <email>lolando@debian.org</email> (Roland)。<ulink type="block" url="http://debian-handbook.info/" />

source: <emphasis role="strong">Chapter 1</emphasis> focuses on a non-technical presentation of the Debian project and describes its goals and organization. These aspects are important because they define a general framework that other chapters will complete with more concrete information.
nb_no: <emphasis role="strong">Kapittel 1</emphasis> gir en ikke-teknisk presentasjon av Debian-prosjektets mål og organisasjon. Disse aspektene er viktige fordi de definerer et generelt rammeverk som andre kapitler vil fylle med mer konkret informasjon.
zh_tw: <emphasis role="strong">第一章</emphasis>介紹 Debian 計畫的非技術性面並描述其目標與組織。先定義大範圍的框架其他章節才能夠填入更具體的資訊。

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they will find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
nb_no: <emphasis role="strong">Kapittel 2 og 3 </emphasis>gir en bred oversikt over en enkeltstudie. Her kan nye lesere ta seg tid til å lese <emphasis role="strong">appendix B</emphasis>, hvor de finner et kort kurs som forklarer en rekke grunnleggende datauttrykk og begreper, som ligger i ethvert Unix-system.
zh_tw: <emphasis role="strong">第二和第三章</emphasis>提供個案式的大綱。建議新手，先閱讀<emphasis role="strong">附錄 B</emphasis>，簡短的補習式課程解釋若干基礎的電腦概念，以及與 Unix 系統有關的概念。

source: To get on with our real subject matter, we will quite naturally start with the installation process (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> will unveil basic tools that any Debian administrator will use, such as those of the <emphasis role="strong">APT</emphasis> family, which is largely responsible for the distribution's excellent reputation. These chapters are in no way restricted to professionals, since everyone is their own administrator at home.
nb_no: For å komme videre med vårt virkelige saksområde vil vi helt naturlig begynne med installasjonen (<emphasis role="strong">kapittel 4</emphasis>).<emphasis role="strong"> Kapittel 5 og 6</emphasis> vil vise grunnleggende verktøy som alle Debian-administratorer vil bruke, som for eksempel de i <emphasis role="strong">APT</emphasis>-familien, som har sin store andel av ansvaret for distribusjons utmerkede rykte. Disse kapitlene er på ingen måte begrenset til fagfolk, fordi alle er sin egen administrator hjemme.
zh_tw: 真正的主題，從安裝開始(<emphasis role="strong">第4章</emphasis>)；<emphasis role="strong">第5和第6章</emphasis>揭示 Debian 管理者常用的基本工具，諸如<emphasis role="strong">APT</emphasis>系列，承擔此發行版主要的工作。這幾章的讀者不以專業人員為限，因為每個人都是家裡的管理者。

source: <emphasis role="strong">Chapter 7</emphasis> will be an important parenthesis; it describes workflows to efficiently use documentation and to quickly gain an understanding of problems in order to solve them.
nb_no: <emphasis role="strong">Kapittel 7</emphasis> vil være en viktig parentes. Den beskriver arbeidsflyt for å bruke dokumentasjon effektivt, og raskt få en forståelse av problemene for å kunne løse dem.
zh_tw: <emphasis role="strong">第7章</emphasis>是個重要的章；它描述有效地使用文件以及快速理解問題本質以便解決它們的流程。

source: The next chapters will be a more detailed tour of the system, starting with basic infrastructure and services (<emphasis role="strong">chapters 8 to 10</emphasis>) and going progressively up the stack to reach the user applications in <emphasis role="strong">chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> deals with more advanced subjects that will most directly concern administrators of large sets of computers (including servers), while <emphasis role="strong">chapter 14</emphasis> is a brief introduction to the wider subject of computer security and gives a few keys to avoid most problems.
nb_no: De neste kapitlene vil være en mer detaljert gjennomgang av systemet, og starter med grunnleggende infrastruktur og tjenester <emphasis role="strong">kapitlene 8 til 10</emphasis>, og går gradvis opp trinnene for å nå brukerprogrammene i <emphasis role="strong">kapittel 13</emphasis>.<emphasis role="strong"> Kapittel 12</emphasis> omhandler mer avanserte emner som mest direkte vil angå administratorer med store datamaskiner (inkludert servere), mens<emphasis role="strong"> kapittel 14</emphasis> er en kort introduksjon til det bredere temaet datasikkerhet, og gir noen nøkler til å unngå de fleste problemene.
zh_tw: 接下來的幾章詳述系統的內容，從基礎架構與服務(<emphasis role="strong">第8至第10章</emphasis>)開始然後進入使用者應用軟體<emphasis role="strong">第13章</emphasis>。<emphasis role="strong">第12章</emphasis>介紹有關大規模電腦管理者所需知道的進階主題，<emphasis role="strong">第14章</emphasis>簡介電腦安全的主題並介紹幾招避免被駭客攻擊。

source: <emphasis role="strong">Chapter 15</emphasis> is for administrators who want to go further and create their own Debian packages.
nb_no: <emphasis role="strong">Kapittel 15</emphasis> er for administratorer som ønsker å gå videre og lage sine egne Debian-pakker.
zh_tw: <emphasis role="strong">第15章</emphasis>係給深造的管理員以及意圖建置自已的 Debian 套件者而準備的。

source: <emphasis>VOCABULARY</emphasis> Debian package
nb_no: <emphasis>ORDFORRÅD</emphasis> Debian-pakke
zh_tw: <emphasis>術語</emphasis> Debian 套件

source: <primary>package</primary><secondary>Debian package</secondary>
nb_no: <primary>pakke</primary><secondary>Debian-pakke</secondary>
zh_tw: <primary>套件</primary><secondary>Debian 套件</secondary>

source: <primary>package</primary><secondary>binary package</secondary>
nb_no: <primary>pakke</primary><secondary>binærpakke</secondary>
zh_tw: <primary>套件</primary><secondary>執行檔套件</secondary>

source: <primary>package</primary><secondary>source package</secondary>
nb_no: <primary>pakke</primary><secondary>kildepakke</secondary>
zh_tw: <primary>套件</primary><secondary>原始套件</secondary>

source: <primary>source</primary><secondary>package</secondary>
nb_no: <primary>kilde</primary><secondary>pakke</secondary>
zh_tw: <primary>原始</primary><secondary>套件</secondary>

source: A Debian package is an archive containing all the files required to install a piece of software. It is generally a file with a <filename>.deb</filename> extension, and it can be handled with the <command>dpkg</command> command. Also called a <emphasis>binary package</emphasis>, it contains files that can be directly used (such as programs or documentation). On the other hand, a <emphasis>source package</emphasis> contains the source code for the software and the instructions required for building the binary package.
nb_no: En Debian-pakke er et arkiv som inneholder alle filene som kreves for å installere en programvare. Det er vanligvis en fil med en <filename>.deb</filename> forlengelse, og kan bli håndtert med <command>dpkg</command>-kommando. Også kalt en <emphasis> binærpakke</emphasis>, som inneholder filer som kan brukes direkte (som programmer eller dokumentasjon). På den andre siden, inneholder en <emphasis>kildepakke</emphasis> kildekoden for programvaren og de instruksjoner som kreves for å bygge en binærpakke.
zh_tw: Debian 套件是包含安裝特定軟體所需檔案的壓縮檔。延伸檔名是<filename>.deb</filename>，可以用<command>dpkg</command>指令處理。也被稱為<emphasis>二進位套件</emphasis>，包括可以直接處理的檔案 (例如程式或文件)。換句話說，<emphasis>原始套件</emphasis>包括軟體的原始碼需以指令建立其二進位套件。
