Repository: Debian-VN/debian-handbook
Catalog: */00b_foreword.po
Languages: nb_no, zh_tw

source: So thank you Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, and Yazid Cassam Sulliman.
nb_no: Så takk til deg Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen - Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, og Yazid Cassam Sulliman.
zh_tw: 同時感謝 Alain Coron、Alain Thabaud、Alan Milnes、Alastair Sherringham、Alban Dumerain、Alessio Spadaro、Alex King、Alexandre Dupas、Ambrose Andrews、Andre Klärner、Andreas Olsson、Andrej Ricnik、Andrew Alderwick、Anselm Lingnau、Antoine Emerit、Armin F. Gnosa、Avétis Kazarian、Bdale Garbee、Benoit Barthelet、Bernard Zijlstra、Carles Guadall Blancafort、Carlos Horowicz — Planisys S.A.、Charles Brisset、Charlie Orford、Chris Sykes、Christian Bayle、Christian Leutloff、Christian Maier、Christian Perrier、Christophe Drevet、Christophe Schockaert (R3vLibre)、Christopher Allan Webber、Colin Ameigh、Damien Dubédat、Dan Pettersson、Dave Lozier、David Bercot、David James、David Schmitt、David Tran Quang Ty、Elizabeth Young、Fabian Rodriguez、Ferenc Kiraly、Frédéric Perrenot — Intelligence Service 001、Fumihito Yoshida、Gian-Maria Daffré、Gilles Meier、Giorgio Cittadini、Héctor Orón Martínez、Henry、Herbert Kaminski、Hideki Yamane、Hoffmann Information Services GmbH、Holger Burkhardt、Horia Ardelean、Ivo Ugrina、Jan Dittberner、Jim Salter、Johannes Obermüller、Jonas Bofjäll、Jordi Fernandez Moledo、Jorg Willekens、Joshua、Kastrolis Imanta、Keisuke Nakao、Kévin Audebrand、Korbinian Preisler、Kristian Tizzard、Laurent Bruguière、Laurent Hamel、Leurent Sylvain、Loïc Revest、Luca Scarabello、Lukas Bai、Marc Singer、Marcelo Nicolas Manso、Marilyne et Thomas、Mark Janssen — Sig-I/O Automatisering、Mark Sheppard、Mark Symonds、Mathias Bocquet、Matteo Fulgheri、Michael Schaffner、Michele Baldessari、Mike Chaberski、Mike Linksvayer、Minh Ha Duong、Moreau Frédéric、Morphium、Nathael Pajani、Nathan Paul Simons、Nicholas Davidson、Nicola Chiapolini、Ole-Morten、Olivier Mondoloni、Paolo Innocenti、Pascal Cuoq、Patrick Camelin、Per Carlson、Philip Bolting、Philippe Gauthier、Philippe Teuwen、PJ King、Praveen Arimbrathodiyil (j4v4m4n)、Ralf Zimmermann、Ray McCarthy、Rich、Rikard Westman、Robert Kosch、Sander Scheepens、Sébastien Picard、Stappers、Stavros Giannouris、Steve-David Marguet、T. Gerigk、Tanguy Ortolo、Thomas Hochstein、Thomas Müller、Thomas Pierson、Tigran Zakoyan、Tobias Gruetzmacher、Tournier Simon、Trans-IP Internet Services、Viktor Ekmark、Vincent Demeester、Vincent van Adrighem、Volker Schlecht、Werner Kuballa、Xavier Neys、and Yazid Cassam Sulliman。

source: The Liberation of the French Book
nb_no: Utgivelsen av den franske utgaven
zh_tw: 法文版的自由

source: After the publication of the English book under a free software licence, we were in a weird situation with a free book which is a translation of a non-free book (since it was still distributed commercially under a non-free license by Eyrolles).
nb_no: Etter utgivelsen av den engelske utgaven med fri programvarelisens, var vi i en merkelig situasjon med en gratis bok som oversettelse av en ikke-gratis bok (siden den fortsatt ble distribuert kommersielt under en ikke-fri lisens av Eyrolles).
zh_tw: 以自由軟體授權出版英文版後，我們面臨怪異的情況譯自非自由圖書的自由圖書 (Eyrolles 仍以商業發行法文版)。

source: We knew that fixing this would require us to convince Eyrolles that a free license would contribute to the book's success. The opportunity came to us in 2013 when we had to discuss a new contract to update the book for Debian 7. Since freeing a book often has a significant impact on its sales, as a compromise, we agreed to setup a crowdfunding campaign to offset some of the risks involved and to contribute to the publication costs of a new edition. The campaign was again hosted on Ulule: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
nb_no: Vi visste at dette vil kreve å overbevise Eyrolles om at en fri lisens vil bidra til suksess for boken. Muligheten kom i 2013 da vi måtte diskutere en ny kontrakt om å oppdatere boken for Debian 7. Siden det å frigjøre en bok til fri lisens ofte har en betydelig innvirkning på salget, ble vi, som et kompromiss, enige om å komme i gang med en folkefinansieringskampanje for å oppveie mulig risiko, og bidra til kostnadene for å utgi en ny utgave. Ulele ble igjen vertskap for kampanjen: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
zh_tw: 必須先說服 Eyrolles 出版社自由授權才是本書成功的要件。2013年 我們討論以 Debian 7 為對象的新書就是一個機會。自由一本書對其銷售是重大衝擊，必須妥協，我們同意群眾募資補償其中的風險並支援新版的出版費用。在 Ulule 網站募資：<ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />

source: The target was at €15,000 in 30 days. It took us less than a week to reach it, and at the end we got a whopping €25,518 from 721 supporters.
nb_no: Målet var å oppnå €15,000 på 30 dager. Det tok mindre enn en uke å nå målet, og til slutt fikk vi en heidundrende € 25,518 fra 721 støttespillere.
zh_tw: 目標是在30天內募資15,000歐元。結果在一週之內就達成目標，最後有721名支持者募集25,518歐元。

source: We had significant contributions from free software-friendly companies and organizations. Let us thank the <ulink url="http://linuxfr.org">LinuxFr.org</ulink> website, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink>, and <ulink url="http://www.linuvers.com">Linuvers</ulink>. Many thanks to LinuxFr and Korben, they considerably helped to spread the news.
nb_no: Vi hadde betydelige bidrag fra fri programvare-vennlig bedrifter og organisasjoner. Vi takker <ulink url="http://linuxfr.org">LinuxFr.org</ulink> website, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink>, og <ulink url="http://www.linuvers.com">Linuvers</ulink>. Tusen takk til LinuxFr og Korben, som i betydelig omfang hjalp til å få spredd budskapet.
zh_tw: 從友好自由軟體公司與組織得到相當的奉獻。我們謝謝 <ulink url="http://linuxfr.org">LinuxFr.org</ulink> 網站、<ulink url="http://korben.info">Korben</ulink>、<ulink url="http://www.addventure.fr">Addventure</ulink>、<ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>、<ulink url="http://elol.fr">ELOL SARL</ulink>、與 <ulink url="http://www.linuvers.com">Linuvers</ulink>。更感謝 LinuxFr 與 Korben，做了很多宣傳。

source: The operation has been a huge success because hundreds of people share our values of freedom and put their money to back it up! Thank you for this.
nb_no: Arbeidet har vært en stor suksess fordi hundrevis deler våre verdier om frihet, og bidrar med penger for å støtte disse! Tusen takk for dette.
zh_tw: 數以百計的人共享我們的自由觀並把他們的錢回饋出來才能使此募資成功！謝謝您們。

source: Special thanks to those who opted to give 25€ more than the value of their reward. Your faith in this project is highly appreciated. Thank you Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin, and Yves Martin.
nb_no: En spesiell takk til dere som har valgt å gi 25 € mer enn verdien av sin refusjon. Deres tro på dette prosjektet er høyt verdsatt. Tusen takk til Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin, og Yves Martin.
zh_tw: 特別感謝捐款25歐元以上的人，其價值遠超過此數字感謝您的信心。謝謝您 Adrien Guionie、Adrien Ollier、Adrien Roger、Agileo Automation、Alban Duval、Alex Viala、Alexandre Dupas、Alexandre Roman、Alexis Bienvenüe、Anthony Renoux、Aurélien Beaujean、Baptiste Darthenay、Basile Deplante、Benjamin Cama、Benjamin Guillaume、Benoit Duchene、Benoît Sibaud、Bornet、Brett Ellis、Brice Sevat、Bruno Le Goff、Bruno Marmier、Cédric Briner、Cédric Charlet、Cédrik Bernard、Celia Redondo、Cengiz Ünlü、Charles Flèche、Christian Bayle、Christophe Antoine、Christophe Bliard、Christophe Carré、Christophe De Saint Leger、Christophe Perrot、Christophe Robert、Christophe Schockaert、Damien Escoffier、David Dellier、David Trolle、Davy Hubert、Decio Valeri、Denis Marcq、Denis Soriano、Didier Hénaux、Dirk Linnerkamp、Edouard Postel、Eric Coquard、Eric Lemesre、Eric Parthuisot、Eric Vernichon、Érik Le Blanc、Fabian Culot、Fabien Givors、Florent Bories、Florent Machen、Florestan Fournier、Florian Dumas、François Ducrocq、Francois Lepoittevin、François-Régis Vuillemin、Frédéric Boiteux、Frédéric Guélen、Frédéric Keigler、Frédéric Lietart、Gabriel Moreau、Gian-Maria Daffré、Grégory Lèche、Grégory Valentin、Guillaume Boulaton、Guillaume Chevillot、Guillaume Delvit、Guillaume Michon、Hervé Guimbretiere、Iván Alemán、Jacques Bompas、Jannine Koch、Jean-Baptiste Roulier、Jean-Christophe Becquet、Jean-François Bilger、Jean-Michel Grare、Jean-Sébastien Lebacq、Jérôme Ballot、Jerome Pellois、Johan Roussel、Jonathan Gallon、Joris Dedieu、Julien Gilles、Julien Groselle、Kevin Messer、Laurent Espitallier、Laurent Fuentes、Le Goût Du Libre、Ludovic Poux、Marc Gasnot、Marc Verprat、Marc-Henri Primault、Martin Bourdoiseau、Mathieu Chapounet、Mathieu Emering、Matthieu Joly、Melvyn Leroy、Michel Casabona、Michel Kapel、Mickael Tonneau、Mikaël Marcaud、Nicolas Bertaina、Nicolas Bonnet、Nicolas Dandrimont、Nicolas Dick、Nicolas Hicher、Nicolas Karolak、Nicolas Schont、Olivier Gosset、Olivier Langella、Patrick Francelle、Patrick Nomblot、Philippe Gaillard、Philippe Le Naour、Philippe Martin、Philippe Moniez、Philippe Teuwen、Pierre Brun、Pierre Gambarotto、Pierre-Dominique Perrier、Quentin Fait、Raphaël Enrici — Root 42、Rémi Vanicat、Rhydwen Volsik、RyXéo SARL、Samuel Boulier、Sandrine D'hooge、Sébasiten Piguet、Sébastien Bollingh、Sébastien Kalt、Sébastien Lardière、Sébastien Poher、Sébastien Prosper、Sébastien Raison、Simon Folco、Société Téïcée、Stéphane Leibovitsch、Stéphane Paillet、Steve-David Marguet、Sylvain Desveaux、Tamatoa Davio、Thibault Taillandier、Thibaut Girka、Thibaut Poullain、Thierry Jaouen、Thomas Etcheverria、Thomas Vidal、Thomas Vincent、Vincent Avez、Vincent Merlet、Xavier Alt、Xavier Bensemhoun、Xavier Devlamynck、Xavier Guillot、Xavier Jacquelin、Xavier Neys、Yannick Britis、Yannick Guérin、and Yves Martin。

source: Special Thanks to Contributors
nb_no: Spesiell takk til bidragsytere
zh_tw: 對貢獻者的感謝

source: This book would not be what it is without the contributions of several persons who each played an important role during the translation phase and beyond. We would like to thank Marilyne Brun, who helped us to translate the sample chapter and who worked with us to define some common translation rules. She also revised several chapters which were desperately in need of supplementary work. Thank you to Anthony Baldwin (of Baldwin Linguas) who translated several chapters for us.
nb_no: Denne boken ville ikke vært det den er uten bidrag fra flere personer som hver spilte en viktig rolle fra oversettelsesfasen og videre. Vi vil gjerne takke Marilyne Brun, som hjalp oss med å oversette eksempelkapitlet, og som jobbet med oss for å definere noen omforente oversettingsregler. Hun har også revidert flere kapitler med et sterkt behov for etterarbeid. Takk til Anthony Baldwin (av Baldwin Linguas) som oversatte flere kapitler for oss.
zh_tw: 在翻譯與其他階段很多人奉獻心力。我們特別感謝 Marilyne Brun，協助翻譯範例章並共同設定翻譯的通則。他還修改若干不堪目睹的若干譯稿。謝謝 Anthony Baldwin (在 Baldwin Linguas 任職) 翻譯了好幾章。

source: We benefited from the generous help of proofreaders: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, and Tom Syroid. They each reviewed many chapters. Thank you very much!
nb_no: Vi har hatt fordelen av god hjelp av korrekturleserne: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, og Tom Syroid. Hver av den gjennomgikk mange kapitler. Tusen takk!
zh_tw: 從校對者得到很多幫助：Daniel Phillips、Gerold Rupprecht、Gordon Dey、Jacob Owens 和 Tom Syroid。他們每個人都檢視多個章節。非常感謝！

source: Then, once the English version was liberated, of course we got plenty of feedback and suggestions and fixes from the readers, and even more from the many teams who undertook to translate this book into other languages. Thanks!
nb_no: Så snart den engelske utgaven ble frigitt, fikk vi selvfølgelig svært mange tilbakemeldinger, forslag og rettelser fra leserne, og enda mer fra de mange lagene som påtok seg å oversette denne boken til andre språk. Takk!
zh_tw: 然後，英文版釋出，當然得到讀者的回饋與建議並修正錯誤，還有更多的人把此書譯為其他語文。謝謝！

source: We would also like to thank the readers of the French book who provided us some nice quotes to confirm that the book was really worth being translated: thank you Christian Perrier, David Bercot, Étienne Liétart, and Gilles Roussi. Stefano Zacchiroli — who was Debian Project Leader during the crowdfunding campaign — also deserves a big thank you, he kindly endorsed the project with a quote explaining that free (as in freedom) books were more than needed.
nb_no: Vi ønsker også å takke leserne av den franske utgaven som ga oss noen fine sitater som bekrefter at boken virkelig er verd å bli oversatt. Takk Christian Perrier, David Bercot, Étienne Liétart, og Gilles Rousset. Stefano Zacchiroli - som var Debians prosjektleder under folkefinansieringskampanjen - fortjener også en stor takk. At han også støttet prosjektet med et sitat som forklarer hva frie (som i frihet) bøker er, var mer enn nødvendig.
zh_tw: 也要感謝法文版的讀者給了不錯的評價確認翻譯是值得的：感謝你們 Christian Perrier、David Bercot、Étienne Liétart 和 Gilles Roussi。 Stefano Zacchiroli — 是群眾募資料時的 Debian 計畫領導者 — 值得大大的感謝，解釋了自由 (真的自由) 圖書是非常必需的。
