Repository: Debian-VN/debian-handbook
Catalog: */02_case-study.po
Languages: nb_no, vi_vn

source: Strong Growth
nb_no: Sterk vekst
vi_vn: Sự tăng trưởng lớn mạnh

source: Master Plan
nb_no: Hovedplan
vi_vn: Kế hoạch tổng thể

source: Migration
nb_no: Overflytting

source: Cost Reduction
nb_no: Kostnadsreduksjon
vi_vn: Giảm tải chi phí

source: Presenting the Case Study
nb_no: Presentasjon av typestudien
vi_vn: Trình bày các Case Study

source: In the context of this book, you are the system administrator of a growing small business. The time has come for you to redefine the information systems master plan for the coming year in collaboration with your directors. You choose to progressively migrate to Debian, both for practical and economical reasons. Let's see in more detail what's in store for you…
nb_no: Her i denne boken, er du systemansvarlig for en voksende liten bedrift. Tiden er inne for å redefinere hovedplanen informasjonssystemer for det kommende året i samarbeid med din ledelse. Du velger å gradvis gå over til Debian, både av praktiske og økonomiske årsaker. La oss se nærmere på hva du har i vente …
vi_vn: Trong hoàn cảnh được đưa ra ở cuốn sách này, bạn là một người quản trị hệ thống của một công ty nhỏ đang tiến triển. Đã đến thời điểm mà bạn phải thiết lập lại kế hoạch tổng thể cho các hệ thống thông tin trong năm tới cùng với các giám đốc bộ phận. Bạn lựa chọn chuyển đổi dần dần sang Debian, vì cả lý do thực nghiệm lẫn kinh tế. Hãy cùng xem kỹ hơn những gì đã có cho bạn.

source: We have envisioned this case study to approach all modern information system services currently used in a medium sized company. After reading this book, you will have all of the elements necessary to install Debian on your servers and fly on your own wings. You will also learn how to efficiently find information in the event of difficulties.
nb_no: I denne typestudien vil vi se nærmere på alle moderne informasjonssystemtjenester som i dag brukes i en mellomstor bedrift. Etter å ha lest denne boken, vil du ha alle de elementer som må til for å installere Debian på serverne, og fly på egne vinger. Du vil også lære hvordan du effektivt finner informasjon i tilfelle det oppstår vanskeligheter.
vi_vn: Chúng tôi đã mường tượng ra đối tượng nghiên cứu này để có thể tiếp cận những hệ thống thông tin đang được sử dụng trong các công ty cỡ trung. Sau khi đọc cuốn sách này, bạn sẽ có tất cả những yếu tố cần thiết để cài đặt Debian trên máy chủ của bạn và tự chủ được việc quản lý. Bạn cũng sẽ học được cách tìm kiếm thông tin hiệu quả trong những lúc gặp khó khăn.

source: Fast Growing IT Needs
nb_no: Raskt voksende behov for IKT
vi_vn: Nhu cầu tăng trưởng nhanh về IT

source: Falcot Corp is a manufacturer of high quality audio equipment. The company is growing strongly, and has two facilities, one in Saint-Étienne, and another in Montpellier. The former has around 150 employees; it hosts a factory for the manufacturing of speakers, a design lab, and all administrative office. The Montpellier site is smaller, with only about 50 workers, and produces amplifiers.
nb_no: Falcot Corp produserer høykvalitets lydutstyr. Selskapet er i sterk vekst, og har to anlegg, et i Saint-Étienne, og et annet i Montpellier. Den førstnevnte har rundt 150 ansatte. Det har en fabrikk for produksjon av høyttalere, et design lab, og et felles administrasjonskontor. Anlegget i Montpellier er mindre, med bare ca 50 ansatte, og produserer forsterkere.
vi_vn: Công ty Falcot là một nhà sản xuất thiết bị âm thanh chất lượng cao. Công ty đang phát triển mạnh, và có hai cơ sở. Một ở Saint-Étienne, và một ở Montpellier. Cơ sở một có khoảng 150 nhân viên; ở đây có một nhà máy sản xuất loa, một lab thiết kế, và phòng ban tổng quản.

source: <emphasis>NOTE</emphasis> Fictional company created for case study
nb_no: <emphasis>NOTE</emphasis> Et fiktivt selskap laget for denne typestudien
vi_vn: <emphasis>GHI CHÚ</emphasis> Đây là một công ty không có thật

source: The Falcot Corp company used as an example here is completely fictional. Any resemblance to an existing company is purely coincidental. Likewise, some example data throughout this book may be fictional.
nb_no: Falcot Corp-selskapet som brukes som typestudie eller eksempel her, er helt oppdiktet. Enhver likhet med et eksisterende selskap er rent tilfeldig. Likeledes kan enkelte dataeksempler i denne boken være oppdiktet.
vi_vn: Công ty Falcot được dùng làm ví dụ ở đây hoàn toàn là hư cấu. Mọi sự tương đồng với một công ty có thực hoàn toàn là do ngẫu nhiên. Tương tự, các dữ liệu mẫu xuyên suốt sách này cũng có thể là hư cấu.

source: The computer system has had difficulty keeping up with the company's growth, so they are now determined to completely redefine it to meet various goals established by management:
nb_no: Datasystemet har hatt vanskeligheter med å holde tritt med selskapets vekst, så de er nå fast bestemt på å fullstendig omdefinere det til å kunne møte de ulike målene ledelsen har fastsatt:
vi_vn: Hệ thống máy tính đang gặp khó ngăn để theo kịp sự phát triển của công ty, nên họ xác định rằng sẽ thiết lập lại hoàn toàn để đáp ứng các mục tiêu đa dạng được đặt ra bởi bên quản lý:

source: modern, easily scalable infrastructure;
nb_no: moderne. enkel skalerbar infrastruktur;
vi_vn: hiện đại, hạ tầng dễ dàng mở rộng;

source: reducing cost of software licenses thanks to use of Open Source software;
nb_no: reduserte kostnader for programvarelisenser ved bruk av åpen kildekode-programmer;
vi_vn: giảm thiểu chi phí bản quyền phần mềm nhờ sử dụng phần mềm Mã nguồn mở;

source: installation of an e-commerce website, possibly B2B (business to business, i.e. linking of information systems between different companies, such as a supplier and its clients);
nb_no: installasjon av en nettside for e-handel, muligens B2B (business to business, dvs. linking av informasjonssystemer mellom ulike selskaper, for eksempel mellom en leverandør og kundene);
vi_vn: cài đặt một website thương mại điện tử, có thể là B2B (Business to Business - thương mại giữa doanh nghiệp, ví dụ việc kết nối các hệ thống thông tin giữa những công ty, chẳng hạn từ nhà cung cấp đến khách hàng của họ);

source: significant improvement in security to better protect trade secrets related to new products.
nb_no: betydelig forbedring i sikkerheten for å bedre beskytte forretningshemmeligheter knyttet til nye produkter.
vi_vn: cải thiện đáng kể về bảo mật để bảo vệ tốt hơn bí mật kinh doanh liên quan tới các sản phẩm mới.

source: The entire information system will be overhauled with these goals in mind.
nb_no: Hele informasjonssystem vil bli gjennomgått med disse målene i tankene.
vi_vn: Toàn bộ hệ thống thông tin sẽ được thẩm định lại với những mục tiêu này trong tư tưởng.

source: <primary>master plan</primary>
nb_no: <primary>hovedplan</primary>
vi_vn: <primary>kế hoạch tổng thể</primary>

source: <primary>migration</primary>
nb_no: <primary>overflytting</primary>
vi_vn: <primary>sự chuyển đổi</primary>

source: With your collaboration, IT management has conducted a slightly more extensive study, identifying some constraints and defining a plan for migration to the chosen Open Source system, Debian.
nb_no: I samarbeid med deg, har IT-ledelsen gjennomført en litt mer omfattende undersøkelse, identifisert noen begrensninger, og definert en plan for flytting til det valgte Open Source-systemet, Debian.
vi_vn: Với sự hợp tác của bạn, bên quản lý IT đã tiến hành một nghiên cứu rộng hơn một chút, xác định một vài ràng buộc và đặt ra một kế hoạch để chuyển sang một hệ thống Mã nguồn mở, Debian.

source: A significant constraint identified is that the accounting department uses specific software, which only runs on <trademark>Microsoft Windows</trademark>. The laboratory, for its part, uses computer aided design software that runs on <trademark>OS X</trademark>.
nb_no: En vesentlig begrensning er identifisert til at økonomiavdelingen bruker spesifikk programvare, som bare kjører på <trademark>Microsoft Windows</trademark>. Laboratoriet, på sin side, bruker programvare for dataassistert konstruksjon som kjører på <trademark>OS X</trademark>.
vi_vn: Một ràng buộc đáng kể được xác định đó là bộ phận kế toán sử dụng một phần mềm chuyên biệt chỉ chạy trên <trademark>Microsoft Windows</trademark>. Trong phòng lab, họ sử dụng phần mềm thiết kế (CAD) chạy trên <trademark>OS X</trademark>.

source: Overview of the Falcot Corp network
nb_no: Oversikt over Falcot Corp nettverket
vi_vn: Tổng quan về mạng của công ty Falcot

source: The switch to Debian will be gradual; a small business, with limited means, cannot reasonably change everything overnight. For starters, the IT staff must be trained in Debian administration. The servers will then be converted, starting with the network infrastructure (routers, firewalls, etc.) followed by the user services (file sharing, Web, SMTP, etc.). Then the office computers will be gradually migrated to Debian, for each department to be trained (internally) during the deployment of the new system.
nb_no: Overgangen til Debian vil skje gradvis. En liten bedrift, med begrensede midler, kan ikke med rimelighet forandre alt over natten. For det første må IT-ansatte få opplæring i Debian administrasjon. Serverne vil så bli konvertert, starter med nettverksinfrastruktur (rutere, brannmurer, etc.) etterfulgt av brukertjenester (fildeling, web, SMTP, etc.). Da kontormaskinene gradvis vil migrere til Debian, vil hver avdeling bli trent (internt) under utrulling av det nye systemet.
vi_vn: Việc chuyển đổi qua Debian sẽ được tiến hành dần dần; việc kinh doanh nhỏ, với các phương tiện hạn chế, không thể dễ dàng thay thế mọi thứ sau một đêm. Với những người mới bắt đầu, nhân viên IT phải được hướng dẫn quản trị với Debian. Sau đó các máy chủ sẽ được chuyển đổi, bắt đầu với hạ tầng mạng (các bộ định tuyến, các tường lửa,…) tiếp theo đó là các dịch vụ cho người dùng (chia sẻ file, Web, SMTP,…). Sau đó các máy tính của nhân viên sẽ được dần chuyển thành Debian, mỗi phòng ban sẽ được hướng dẫn (nội bộ) trong quá trình triển khai hệ thống mới.

source: Why a GNU/Linux Distribution?
nb_no: Hvorfor en GNU/Linux distribusjon?
vi_vn: Tại sao lại lựa chọn một bản phân phối GNU/Linux

source: <emphasis>BACK TO BASICS</emphasis> Linux or GNU/Linux?
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> Linux eller GNU/Linux?
vi_vn: <emphasis>QUAY LẠI CĂN BẢN</emphasis> Linux hay GNU/Linux?

source: Linux, as you already know, is only a kernel. The expressions, “Linux distribution” and “Linux system” are, thus, incorrect: they are, in reality, distributions or systems <emphasis>based on</emphasis> Linux. These expressions fail to mention the software that always completes this kernel, among which are the programs developed by the GNU Project. Dr. Richard Stallman, founder of this project, insists that the expression “GNU/Linux” be systematically used, in order to better recognize the important contributions made by the GNU Project and the principles of freedom upon which they are founded.
nb_no: Linux, som du allerede vet, er bare en kjerne. Uttrykkene «Linux distribusjon» og «Linux system» er dermed feil: De er i realiteten distribusjoner eller systemer <emphasis> basert på </emphasis>Linux. Disse uttrykkene unnlater å nevne programmene som alltid gjør at denne kjernen kan kjøre. Blant disse er programmene som er utviklet av GNU-prosjektet. Dr. Richard Stallman, grunnlegger av dette prosjektet, insisterer på at uttrykket «GNU/Linux» systematisk blir brukt for å bedre kunne gjenkjenne de viktige bidragene fra GNU-prosjektet, og prinsippene om frihet som de bygger på.
vi_vn: Debian đã lựa chọn theo ý kiến này, và, đã đặt tên của bản phân phối theo đó (vậy nên phiên bản ổn định mới nhất là Debian GNU/Linux 8).

source: Debian has chosen to follow this recommendation, and, thus, name its distributions accordingly (thus, the latest stable release is Debian GNU/Linux 8).
nb_no: Debian har valgt å følge denne anbefalingen, og dermed sette navn på sine distribusjoner tilsvarende. Dermed har den siste stabile utgaven navnet Debian GNU/Linux 8.

source: Several factors have dictated this choice. The system administrator, who was familiar with this distribution, ensured it was listed among the candidates for the computer system overhaul. Difficult economic conditions and ferocious competition have limited the budget for this operation, despite its critical importance for the future of the company. This is why Open Source solutions were swiftly chosen: several recent studies indicate they are less expensive than proprietary solutions while providing equal or better quality of service so long as qualified personnel are available to run them.
nb_no: Flere faktorer har gitt dette valget. Den systemansvarlige, som var kjent med denne fordelingen, sikret at det ble oppført blant kandidatene til fornyelsen av datasystemet. Vanskelige økonomiske forhold og tøff konkurranse har begrenset budsjett til denne operasjonen, til tross for den avgjørende betydningen for fremtiden til selskapet. Dette er grunnen til at Åpen kildekode-løsninger raskt ble valgt. Flere nyere studier tyder på at de er rimeligere enn proprietære løsninger, samtidig som det gir tilsvarende eller bedre kvalitet på tjenesten, så lenge det er kvalifisert personell tilgjengelig til å kjøre dem.
vi_vn: Có vài yếu tố đã dẫn tới sự lựa chọn này. Quản trị viên hệ thống, người mà đã quen với bản phân phối này, chắc chắn về việc Debian nằm trong danh sách những ứng cử viên để thay thế cho hệ thống. Điều kiện kinh tế khó khăn cũng như cạnh tranh khắc nghiệt đã giới hạn chi phí cho quá trình này, mặc dù đó là một vấn đề trọng yếu cho tương lai của công ty. Đây là lý do tại sao các giải pháp Mã nguồn mở được lựa chọn một cách nhanh chóng: vài nghiên cứu gần đây chỉ ra rằng chúng ít đắt đỏ hơn các giải pháp độc quyền trong khi cung cấp chất lượng ngang bằng hoặc tốt hơn đủ lâu tùy vào nhân sự có khả năng vận hành nó.

source: <emphasis>IN PRACTICE</emphasis> Total cost of ownership (TCO)
nb_no: <emphasis>I PRAKSIS</emphasis> Totale eierkostnader (TCO)
vi_vn: <emphasis>TRONG THỰC TẾ</emphasis> Tổng chi phí sở hữu (TCO)

source: <primary>TCO</primary>
nb_no: <primary>TOTALE EIERKOSTNADER</primary>

source: <primary>Total Cost of Ownership</primary>
nb_no: <primary>Totale eierkostnader</primary>
vi_vn: <primary>Tổng chi phí sở hữu</primary>

source: The Total Cost of Ownership is the total of all money expended for the possession or acquisition of an item, in this case referring to the operating system. This price includes any possible license fee, costs for training personnel to work with the new software, replacement of machines that are too slow, additional repairs, etc. Everything arising directly from the initial choice is taken into account.
nb_no: Den totale eierkostnaden er summen av alle pengene brukt for å eie, eller kjøp, i dette tilfellet for operativsystemet. Denne prisen inkluderer eventuell lisensavgift, kostnader for opplæring av personell til å jobbe med den nye programvaren, utskifting av maskiner som er for langsomme, ytterligere reparasjoner, etc. Alt som oppstår som et direkte resultat av det opprinnelige valget som ble tatt.
vi_vn: Tổng chi phí sở hữu là tổng tất cả số tiến chi trả cho một sự sở hữu hoặc đạt lấy một vật phẩm nào đó, trong trường hợp này đề cập tới một hệ điều hành. Chi phí này bao gồm tất cả các chi phí bản quyền có thể xảy râ, chi phí đào tạo nhân sự để làm việc với phần mềm mới, thay thế máy móc đã quá chậm, sửa chữa bổ sung,…. Tất cả chi phí phát sinh từ một lựa chọn đều được tính toán.

source: This TCO, which varies according to the criteria chosen in the assessment thereof, is rarely significant when taken in isolation. However, it is very interesting to compare TCOs for different options if they are calculated according to the same rules. This assessment table is, thus, of paramount importance, and it is easy to manipulate it in order to draw a predefined conclusion. Thus, the TCO for a single machine doesn't make sense, since the cost of an administrator is also reflected in the total number of machines they manage, a number which obviously depends on the operating system and tools proposed.
nb_no: Denne totale eierkostnaden, som varierer i henhold til kriteriene som ble lagt til grunn for vurderingen, er sjelden stor når kriteriene tas hver for seg. Men det er svært interessant å sammenligne eierkostnadene for ulike alternativer når de er beregnet etter de samme reglene. Denne vurderingstabellen er således av avgjørende betydning, og den er lett å manipulere for å få frem en forhåndsdefinert konklusjon. Dermed er eierkostnaden for en enkelt maskin ikke fornuftig, siden kostnadene for en administrator også gjenspeiles i det totale antallet maskiner de klarer, et tall som åpenbart er avhengig av foreslått operativsystem og verktøy.
vi_vn: Chi phí sở hữu này, thay đổi tùy theo tiêu chí được chọn trong định giá tài sản, hiếm khi đáng chú ý khi tính đơn lẻ. Tuy nhiên, rất thú vị khi so sánh các TCO của các lựa chọn khác nhau khi chúng đều được tính bằng các quy luật như nhau. Bảng định giá này, là một thứ tối quan trọng, và dễ dàng đưa ra để hình thành một kết luận đã định trước. Vậy nên, TCO của một máy tính đơn lẻ không có ý nghĩa gì, khi chi phí cho người quản trị liên quan tới tổng số máy mà họ quản lý, con số đó hiển nhiên phụ thuộc vào hệ điều hành và các công cụ được đề xuất.

source: Among free operating systems, the IT department looked at the free BSD systems (OpenBSD, FreeBSD, and NetBSD), GNU Hurd, and Linux distributions. GNU Hurd, which has not yet released a stable version, was immediately rejected. The choice is simpler between BSD and Linux. The former have many merits, especially on servers. Pragmatism, however, led to choosing a Linux system, since its installed base and popularity are both very significant and have many positive consequences. One of these consequences is that it is easier to find qualified personnel to administer Linux machines than technicians experienced with BSD. Furthermore, Linux adapts to newer hardware faster than BSD (although they are often neck and neck in this race). Finally, Linux distributions are often more adapted to user-friendly graphical user interfaces, indispensable for beginners during migration of all office machines to a new system.
nb_no: Blant frie operativsystemer så IKT-avdelingen på de frie BSD-systemene (OpenBSD, FreeBSD og NetBSD), GNU Hurd, og Linux-distribusjoner. GNU Hurd, som ennå ikke er sluppet i en stabil versjon, ble umiddelbart avvist. Valget er enklere mellom BSD og Linux. Den første har mange fordeler, spesielt på servere. Pragmatisme førte imidlertid til valg av et Linux-system, siden den installerte basen og populariten er svært viktige, og har mange positive konsekvenser. En av disse konsekvensene er at det er lettere å finne kvalifisert personell til å administrere Linux-maskiner enn teknikere med erfaring fra BSD. Videre tilpasser Linux seg ny maskinvare raskere enn BSD (selv om de ofte er side ved side i dette løpet). Endelig er Linux-distribusjoner ofte mer tilpasset brukervennlige grafiske brukergrensesnitt, uunnværlig for nybegynnere under migrering av alle kontormaskinene til et nytt system.
vi_vn: Trong các hệ điều hành miễn phí, bộ phận IT đã xem xét về các hệ BSD miễn phí (OpenBSD, FreeBSD, và NetBSD), GNU Hurd, và các bản phân phối Linux. GNU Hurd, chưa được tung ra một bản ổn định nào, đã ngay lập tức bị loại. Sự lựa chọn đã đơn giản hơn với BSD và Linux. Lựa chọn đầu tiên có nhiều phẩm chất tốt, đặc biệt là cho các máy chủ. Tuy nhiên, tính thực dụng đã dần tới lựa chọn là một hệ thống Linux, vì nền tảng cài đặt và sự phổ biến của nó đều rất đáng chú ý. Một trong những hệ quả đó là sẽ dễ dàng hơn để tìm một nhân sự được đào tạo để quản trị các máy Linux hơn là các kỹ thuật viên thông thạo với BSD. Hơn nữa, Linux trở nên tương thích với các phần cứng mới nhanh hơn BSD (mặc dù chúng luôn có những cơ hội ngang bằng). Cuối cùng, các bản phân phối Linux thường được áp dụng cho các giao diện có đồ họa thân thiệt với người dùng, điều rất cần cho người mới bắt đầu trong quá trình chuyển đổi toàn bộ các máy tính cho một hệ thống mới.

source: <emphasis>ALTERNATIVE</emphasis> Debian GNU/kFreeBSD
nb_no: <emphasis>ALTERNATIVT</emphasis> Debian GNU/kFreeBSD
vi_vn: <emphasis>LỰA CHỌN THAY THẾ</emphasis> Debian GNU/kFreeBSD

source: Since Debian <emphasis role="distribution">Squeeze</emphasis>, it is possible to use Debian with a FreeBSD kernel on 32 and 64 bit computers; this is what the <literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal> architectures mean. While these architectures are not “official release architectures”, about 90 % of the software packaged by Debian is available for them.
nb_no: Etter Debian <emphasis role="distribution">Squeeze</emphasis>, er det mulig å bruke Debian med FreeBSD kjerne på 32 og 64-bit datamaskiner. Dette er hva<literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal> arkitekturer betyr. Selv om disse arkitekturene ikke er «offisielt utgitte arkitekturer», er ca 90 % av programvaren pakket av Debian tilgjengelig for dem.
vi_vn: Hai kiến trúc này có thể là một lựa chọn phù hợp cho các quản trị viên của công ty Falcot, đặc biệt là cho một tường lửa (kernel hỗ trợ 3 tường lửa khác nhau: IPF, IPFW, PF) hoặc cho một NAS (network attached storage system, hệ thống lưu trữ gắn liền trên network, đã được kiểm thử và chấp nhận cho hệ thống file ZFS).

source: These architectures may be an appropriate choice for Falcot Corp administrators, especially for a firewall (the kernel supports three different firewalls: IPF, IPFW, PF) or for a NAS (network attached storage system, for which the ZFS filesystem has been tested and approved).
nb_no: Disse arkitekturene kan være et passende valg for Falcot Corp administratorene, spesielt for en brannmur (kjernen støtter tre forskjellige brannmurer: IPF, IPFW, PF), eller for en NAS (Network Attached Storage systemet, der ZFS filsystem er testet og godkjent).

source: Why the Debian Distribution?
nb_no: Hvorfor Debian-distribusjonen?
vi_vn: Tại sao chọn bản phân phối Debian?

source: Once the Linux family has been selected, a more specific option must be chosen. Again, there are plenty of criteria to consider. The chosen distribution must be able to operate for several years, since the migration from one to another would entail additional costs (although less than if the migration were between two totally different operating systems, such as Windows or OS X).
nb_no: Når Linux-familien er valgt, må et mer spesifikt alternativ velges. Igjen, det er nok av vurderingskriterier. Den valgte distribusjonen må være i stand til å operere i flere år, siden overgangen fra ett til et annet innebærer ekstra kostnader (men mindre enn om migrasjon var mellom to helt forskjellige operativsystemer, for eksempel Windows eller OS X).
vi_vn: Một khi dòng Linux đã được chọn, một lựa chọn cụ thể hơn phải được đưa ra. Lại một lần nữa, có rất nhiều những tiêu chuẩn cần cân nhắc. Bản phân phối được chọn cần phải vận hành được trong vài năm, bởi nếu chuyển sang một bản phân phối khác thì cũng sẽ phát sinh thêm chi phí (dù sẽ ít hơn nếu chuyển đổi sang một hệ điều hành khác hoàn toàn, ví dụ Windows hay OS X).
