Repository: Debian-VN/debian-handbook
Catalog: */02_case-study.po
Languages: nb_no, vi_vn

source: Sustainability is, thus, essential, and it must guarantee regular updates and security patches over several years. The timing of updates is also significant, since, with so many machines to manage, Falcot Corp can not handle this complex operation too frequently. The IT department, therefore, insists on running the latest stable version of the distribution, benefiting from the best technical assistance, and guaranteed security patches. In effect, security updates are generally only guaranteed for a limited duration on older versions of a distribution.
nb_no: Bærekraft er derfor viktig, og det må garanteres regelmessige oppdateringer og sikkerhetsoppdateringer over flere år. Tidspunktet for oppdateringer også viktig, siden, med så mange maskiner til å administrere, kan Falcot Corp ikke håndtere denne kompliserte operasjon for ofte. Derfor insisterer IKT-avdelingen på å kjøre den siste stabile versjonen av distribusjonen, for å dra nytte av den beste tekniske støtten, og garanterte sikkerhetsoppdateringer. I praksis er sikkerhetsoppdateringer vanligvis bare garantert for en begrenset tid på eldre versjoner av en distribusjon.
vi_vn: Tính bền vững, vì vậy, là yếu tố căn bản, và nó cũng phải đảm bảo việc cập nhật thường xuyên và có các vá lỗi bảo mật trong vài năm. Thời điểm để cập nhật cũng cần được chú ý, vì phải quản lý rất nhiều máy tính, công ty Falcot không thể đảm bảo được lộ trình phức tạp này quá thường xuyên được. Vậy nên bộ phận IT nhất định dùng phiên bản ổn định mới nhất của bản phân phối, có lợi từ các hỗ trợ kỹ thuật tốt nhất, và đảm bảo các vá lỗi bảo mật. Hiện thời, các cập nhật bảo mật thường chỉ được đảm bảo trong một thời gian hữu hạn cho các phiên bản cũ hơn của một bản phân phối.

source: Finally, for reasons of homogeneity and ease of administration, the same distribution must run on all the servers (some of which are Sparc machines, currently running Solaris) and office computers.
nb_no: Til slutt, på grunn av samsvar og enkel administrasjon, må den samme distribusjonen kjøre på alle servere (hvorav noen er Sparc-maskiner, som kjører Solaris) og kontormaskiner.
vi_vn: Cuối cùng, vì các lý do về sự đồng nhất và dẽ dàng cho quản trị, tất cả các máy chủ sẽ dùng một bản phân phối y hệt nhau (một vài trong số đó là máy Sparc, hiện còn đang chạy Solaris), và máy của nhân viên cũng sẽ như vậy.

source: Commercial and Community Driven Distributions
nb_no: Kommersielle og community-drevne distribusjoner
vi_vn: Các bản phân phối thương mại và bản phát triển bởi cộng đồng

source: There are two main categories of Linux distributions: commercial and community driven. The former, developed by companies, are sold with commercial support services. The latter are developed according to the same open development model as the free software of which they are comprised.
nb_no: Det er to hovedkategorier Linux-distribusjoner: Kommersielle og Community-drevne. De førstnevnte, utviklet av selskaper, selges med kommersielle støttetjenester. Sistnevnte er utviklet etter den samme åpne utviklingsmodellen som den frie programvare, som de hører til.
vi_vn: Có hai loại chính dành cho các bản phân phối Linux: bản thương mại và bản được cồng đồng phát triển. Loại đầu tiên được phát triển bởi các công ty, được bán cùng các dịch vụ hỗ trợ có thu phí. Loại thứ hai được phát triển theo cùng kiểu với những phầm mềm miễn phí đi kèm với nó.

source: A commercial distribution will have, thus, a tendency to release new versions more frequently, in order to better market updates and associated services. Their future is directly connected to the commercial success of their company, and many have already disappeared (Caldera Linux, StormLinux, etc.).
nb_no: En kommersiell distribusjon vil ha en tendens til å utgi nye versjoner oftere, for markedsoppdatering og tilhørende tjenester. Fremtiden deres er direkte knyttet til selskapets kommersielle suksess, og mange har allerede forsvunnet (Caldera Linux, StormLinux, etc.).
vi_vn: Một bản phân phối thương mại sẽ có xu xướng phát hành phiên bản mới thường xuyên hơn, để cải thiện theo các thay đổi của thị trường và những dịch vụ liên quan. Tương lai của những bản này liên quan trực tiếp tới thành công thương mại của công ti, và rất nhiều trong số đó đã biến mất (Caldera Linux, StormLinux,…).

source: A community distribution doesn't follow any schedule but its own. Like the Linux kernel, new versions are released when they are stable, never before. Its survival is guaranteed, as long as it has enough individual developers or third party companies to support it.
nb_no: En community-distribusjon følger sin egen tidsplan. I likhet med Linux-kjernen, frigjøres nye versjoner når de er stabile, aldri før. Overlevelsen er garantert så lenge det er tilstrekkelig individuelle utviklere, eller tredjeparts selskaper til å støtte den.
vi_vn: Một bản phân phối cộng đồng không theo một lịch trình cụ thể nào ngoài lịch trình của chính nó. Như Linux kernel, bản mới sẽ được phát hành khi nó trở nên ổn định, không bao giờ ra sớm hơn. Sự sinh tồn của nó được đảm bảo, miễn là nó còn có đủ các nhà phát triển độc lập hoặc một công ty thuộc bên thứ ba hỗ trợ nó.

source: <primary>distribution</primary><secondary>community Linux distribution</secondary>
nb_no: <primary>distribusjon</primary><secondary>community Linux distribusjon</secondary>
vi_vn: <primary>bản phân phối</primary><secondary>bản Linux phân phối cộng đồng</secondary>

source: <primary>distribution</primary><secondary>commercial Linux distribution</secondary>
nb_no: <primary>distribusjon</primary><secondary>kommersiell Linux distribusjon</secondary>
vi_vn: <primary>bản phân phối</primary><secondary>bản Linux phân phối thương mại</secondary>

source: A comparison of various Linux distributions led to the choice of Debian for various reasons:
nb_no: En sammenligning av ulike Linux-distribusjoner førte til valg av Debian av ulike grunner:
vi_vn: So sánh giữa các bản phân phối Linux khác nhau đã dẫn đến lựa chọn Debian vì các lý do:

source: It is a community distribution, with development ensured independently from any commercial constraints; its objectives are, thus, essentially of a technical nature, which seem to favor the overall quality of the product.
nb_no: Det er en community distribusjon, med utvikling sikret uavhengig av eventuelle kommersielle begrensninger. Formålet er således i det vesentlige av en teknisk natur, som synes å favorisere den generelle kvaliteten på produktet.
vi_vn: Đây là một bản phân phối cộng đồng, với sự phát triển được đảm bảo rằng độc lập trước mọi ràng buộc thương mại; những mục tiêu của nó, vậy là căn bản sễ thuần kỹ thuật, điều mà sẽ hỗ trợ cho chất lượng tổng thể của sản phẩm.

source: Of all community distributions, it is the most significant from many perspectives: in number of contributors, number of software packages available, and years of continuous existence. The size of its community is an incontestable witness to its continuity.
nb_no: Av alle community distribusjoner, er den den mest betydningsfulle ut fra mange perspektiver: I antall bidragsytere, antall programvarepakker tilgjengelig, og år med kontinuerlig eksistens. Størrelsen på communityet er ubestridelig vitnesbyrd om kontinuiteten.
vi_vn: Trong tất cả các bản phân phối cộng đồng, đây là bản đáng chú ý nhất theo nhiều khía cạnh: số lượng người hỗ trợ, số lượng các gói phần mềm và số năm tồn tại liên tiếp. Quy mô của cộng đồng này là một minh chứng rõ ràng cho sự phát triển liên tục.

source: Statistically, new versions are released every 18 to 24 months, and they are supported for 5 years, a schedule which is agreeable to administrators.
nb_no: Statistisk sett blir nye versjoner utgitt hver 18. til 24. måned, og de støttes i 5 år. En tidsplan som passer godt for administratorer.
vi_vn: Theo thống kê, phiên bản mới được phát hành say 18 đến 24 tháng, và đều được hỗ trợ trong 5 năm, một lịch trình thoải mái cho các quản trị viên.

source: A survey of several French service companies specialized in free software has shown that all of them provide technical assistance for Debian; it is also, for many of them, their chosen distribution, internally. This diversity of potential providers is a major asset for Falcot Corp's independence.
nb_no: En undersøkelse av flere franske serviceselskaper, som har spesialisert seg på fri programvare, viser at alle gir teknisk assistanse for Debian. Mange av dem har også valgt Debian som sin interne distribusjon. Dette mangfoldet av potensielle tilbydere er et stort aktivum for Falcot Corps uavhengighet.
vi_vn: Một khảo sát từ một vài công ty dịch vụ của Pháp chuyên về phần mềm miễn phí đã chỉ ra rằng tất cả họ đều hỗ trợ kỹ thuật cho Debian; đây cũng là bản phân phối được chọn đối với đa số họ để sử dụng. Sự đa dạng về các nhà cung cấp tiềm năng này là một tài sản quý cho sự độc lập của công ty Falcot.

source: Finally, Debian is available on a multitude of architectures, including ppc64el for OpenPOWER processors; it will, thus, be possible to install it on Falcot Corp's latest IBM servers.
nb_no: Endelig er Debian tilgjengelig på en rekke arkitekturer, inkludert ppc64el for OpenPOWER prosessorer. Det er derfor mulig å installere den på Falcot Corps nyeste IBM-servere.
vi_vn: Cuối cùng, Debian có sẵn một lượng lớn các kiến trúc, gồm cả ppc64el cho chip xử lý OpenPOWER; điều này sẽ khiến việc cài đặt lên các máy chủ IBM đời mới của công ty Falcot trở nên khả thi.

source: <emphasis>IN PRACTICE</emphasis> Debian Long Term Support
nb_no: <emphasis>I PRAKSIS</emphasis> Debian Long Term Support
vi_vn: <emphasis>THỰC TẾ</emphasis> Bản Debian hỗ trợ dài hạn

source: The Debian Long Term Support (LTS) project started in 2014 and aims to provide 5 years of security support to all stable Debian releases. As LTS is of primary importance to organizations with large deployments, the project tries to pool resources from Debian-using companies. <ulink type="block" url="https://wiki.debian.org/LTS" />
nb_no: Debian Long Term Support (LTS)-prosjektet startet i 2014, og har som mål å gi 5 års sikker støtte til alle stabile Debian utgivelser. Da LTS er av sentral betydning for organisasjoner med store utrullinger, forsøker prosjektet å knytte sammen ressurser fra selskaper som bruker Debian. <ulink type="block" url="https://wiki.debian.org/LTS" />
vi_vn: Dự án Debian hỗ trợ dài hạn (LTS) được bắt đầu vào năm 2014 và hướng đến cung cấp hỗ trợ bảo mật 5 năm cho tất cả các bản Debian ổn định được phát hành. Bởi LTS là quan trọng hàng đầu cho các tổ chức lớn, dự án này cố gắng tìm các nguồn lực từ những công ty sử dụng. <ulink type="block" url="https://wiki.debian.org/LTS" />

source: Falcot Corp is not big enough to let one member of its IT staff contribute to the LTS project, so the company opted to subscribe to Freexian's Debian LTS contract and provides financial support. Thanks to this, the Falcot administrators know that the packages they use will be handled in priority and they have a direct contact with the LTS team in case of problems. <ulink type="block" url="https://wiki.debian.org/LTS/Funding" /> <ulink type="block" url="http://www.freexian.com/services/debian-lts.html" />
nb_no: Falcot Corps er ikke stort nok til å la en person i sin IKT-stab bidra til LTS-prosjektet, slik at selskapet har valgt å abonnere på gratis Freexians Debian LTS-kontrakt, og gi økonomisk støtte. Takket være dette, vet Falcot administratorer at pakkene de bruker vil bli håndtert med prioritet, og at de har en direkte kontakt med LTS-teamet i tilfelle problemer. <ulink type="block" url="https://wiki.debian.org/LTS/Funding" /><ulink type="block" url="http://www.freexian.com/services/debian-lts.html" />
vi_vn: Công ty Falcot chưa đủ lớn để cho một nhân viên IT đóng góp vào dự án LTS, nên công ty quyết định ký hợp đồng Debian LTS từ Freexian và đồng ý hỗ trợ tài chính. Nhờ điều này, quản trị của công ty Falcot biết rằng các gói phần mềm họ sử dụng sẽ được cung cấp ưu tiên và họ có thể liên lạc trực tiếp với nhóm LTS nếu gặp vấn đề. <ulink type="block" url="https://wiki.debian.org/LTS/Funding" /> <ulink type="block" url="http://www.freexian.com/services/debian-lts.html" />

source: Once Debian has been chosen, the matter of which version to use must be decided. Let us see why the administrators have picked Debian Jessie.
nb_no: Når Debian er valgt, må valget av versjon avgjøres. La oss se hvorfor administratorer har plukket ut Debian Jessie.
vi_vn: Khi Debian đã được lựa chọn, cần phải quyết định phiên bản cụ thể nào để sử dụng. Chúng ta cùng xem tại sao các quản trị viên đã chọn Debian Jessie.

source: Why Debian Jessie?
nb_no: Hvorfor Debian Jessie?
vi_vn: Tại sao là Debian Jessie?

source: Every Debian release starts its life as a continuously changing distribution, also known as “<emphasis role="distribution">Testing</emphasis>”. But at the time we write those lines, Debian Jessie is the latest “<emphasis role="distribution">Stable</emphasis>” version of Debian.
nb_no: Hver Debian-utgivelse starter sitt liv som en distribusjon i kontinuerlig endring, også kjent som “<emphasis role="distribution">Testing</emphasis>”. Men når disse linjene skrives, er Debian Jessie den seneste “<emphasis role="distribusjon">Stable</emphasis>” versjonen av Debian.
vi_vn: Mỗi bản Debian được phát hành bắt đầu vòng đời của nó là một bản phân phối đang thay đổi, cũng được gọi là “<emphasis role="distribution">bản Testing</emphasis>”. Nhưng tại thời điểm chúng tôi viết những dòng này, Debian Jessie là “<emphasis role="distribution">bản ổn định</emphasis>” mới nhất của Debian.

source: The choice of Debian Jessie is well justified based on the fact that any administrator concerned about the quality of their servers will naturally gravitate towards the stable version of Debian. Even if the previous stable release might still be supported for a while, Falcot administrators aren't considering it because its support period will not last long enough and because the latest version brings new interesting features that they care about.
nb_no: Valget av Debian Jessie er godt begrunnet, basert på det faktum at en administrator som er bekymret for kvaliteten på sine servere, vil naturlig bevege seg mot den stabile versjonen av Debian. Selv om den forrige stabile versjonen fortsatt støttes en stund, vurderer ikke Falcot-administratorene den fordi støtteperioden ikke vil vare lenge nok, og fordi den nyeste versjonen bringer nye interessante funksjoner de liker.
vi_vn: Việc lựa chọn Debian Jessie rất hợp lý dựa trên thực tế rằng mọi quản trị viên nào lo đến chất lượng của các máy chủ thì sẽ tự nhiên dồn hướng về bản ổn định của Debian. Mặc dù bản ổn định trước đó vẫn còn được hỗ trợ khá lâu, các quản trị viên Falcot không cân nhắc nó bởi quá trình hỗ trợ sẽ không đủ lâu dài và bản mới nhất cũng có thêm các chức năng mới khá thú vị mà họ quan tâm.
