Repository: Debian-VN/debian-handbook
Catalog: */03_existing-setup.po
Languages: nb_no

source: Once Debian is installed, we must install and configure one by one all of the services that this computer must host. The new configuration must take into consideration the prior one in order to ensure a smooth transition. All the information collected in the first two steps will be useful to successfully complete this part.
nb_no: Når Debian er installert, må vi installere og konfigurere en etter en av alle de tjenestene som denne datamaskinen må ha. Den nye konfigurasjonen må ta hensyn til den foregående for å sikre en myk overgang. All informasjonen som samles inn i de to første trinnene vil være nyttig for å fullføre denne delen.

source: Install the selected services
nb_no: Å installere de valgte tjenestene

source: Prior to jumping into this exercise with both feet, it is strongly recommended that you read the remainder of this book. After that you will have a more precise understanding of how to configure the expected services.
nb_no: Før du jumper inn i denne øvelsen med begge føttene, er det sterkt anbefalt at du leser resten av denne boken. Etter det du vil ha en mer presis forståelse av hvordan du konfigurerer de forventede tjenestene.
