Repository: Debian-VN/debian-handbook
Catalog: */03_existing-setup.po
Languages: nb_no

source: Existing Setup
nb_no: Gjeldende oppsett

source: Reuse
nb_no: Gjenbruk

source: Migration
nb_no: Overflytting

source: Analyzing the Existing Setup and Migrating
nb_no: Å analysere gjeldende oppsett og migrering

source: Any computer system overhaul should take the existing system into account. This allows reuse of available resources as much as possible and guarantees interoperability of the various elements comprising the system. This study will introduce a generic framework to follow in any migration of a computing infrastructure to Linux.
nb_no: Alt ettersyn av datasystemer skal ta det eksisterende systemet i betraktning. Dette tillater gjenbruk av tilgjengelige ressurser så langt som mulig, og garanterer interoperabilitet for de ulike elementene som inngår i systemet. Denne studien vil introdusere et generisk rammeverk som kan følges ved alle migrasjoner av en datainfrastruktur til Linux.

source: Coexistence in Heterogeneous Environments
nb_no: Sameksistens i uensartede omgivelser

source: <primary>environment</primary><secondary>heterogeneous environment</secondary>
nb_no: <primary>omgivelser</primary><secondary>uensartede omgivelser</secondary>

source: Debian integrates very well in all types of existing environments and plays well with any other operating system. This near-perfect harmony comes from market pressure which demands that software publishers develop programs that follow standards. Compliance with standards allows administrators to switch out programs: clients or servers, whether free or not.
nb_no: Debian integreres godt i alle typer eksisterende miljøer, og samspiller godt med andre operativsystemer. Denne nesten perfekte harmoni kommer fra markedpress som krever at programvareutgivere utvikler programmer som følger standarder. Å overholde standarder tillater administratorer å bytte ut programmer: Klienter eller tjenere, enten de er gratis eller ikke.

source: Integration with Windows Machines
nb_no: Integrasjon med Windows-maskiner

source: Samba's SMB/CIFS support ensures excellent communication within a Windows context. It shares files and print queues to Windows clients and includes software that allow a Linux machine to use resources available on Windows servers.
nb_no: Sambas SMB/CIFS-støtte sikrer god kommunikasjon innenfor en Windows kontekst. Den deler filer og utskriftskøer til Windows-klienter, og inkluderer programvare som lar en Linux-maskin bruke ressurser tilgjengelig på Windows-tjenere.

source: <emphasis>TOOL</emphasis> Samba
nb_no: <emphasis>Verktøy</emphasis> Samba

source: The latest version of Samba can replace most of the Windows features: from those of a simple Windows NT server (authentication, files, print queues, downloading printer drivers, DFS, etc.) to the most advanced one (a domain controller compatible with Active Directory).
nb_no: Den nyeste versjonen av Samba kan erstatte det meste av Windows-funksjonene: Fra dem i en enkel Windows NT-server (autentisering, filer, utskriftskøer, nedlasting av skriverdrivere, DFS, etc.) til den mest avanserte (en domenekontroll som er kompatibel med Active Directory).

source: Integration with OS X machines
nb_no: Integrasjon med OS X-maskiner

source: OS X machines provide, and are able to use, network services such as file servers and printer sharing. These services are published on the local network, which allows other machines to discover them and make use of them without any manual configuration, using the Bonjour implementation of the Zeroconf protocol suite. Debian includes another implementation, called Avahi, which provides the same functionality.
nb_no: OS X-maskiner gir, og er i stand til å bruke, nettverkstjenester som filservere og skriverdeling. Disse tjenestene er publisert på det lokale nettverket, noe som tillater andre maskiner å oppdage dem, og gjøre bruk av dem, uten manuell konfigurering, ved hjelp av Bonjour-gjennomføringen av Zeroconf-protokollen Suite. Debian inkluderer en annen implementering, kalt Avahi, som gir samme funksjonalitet.

source: In the other direction, the Netatalk daemon can be used to provide file servers to OS X machines on the network. It implements the AFP (AppleShare) protocol as well as the required notifications so that the servers can be autodiscovered by the OS X clients.
nb_no: I den andre retningen kan Netatalk-nissen brukes til å gi filtjenere til OS X-maskiner i nettverket. Den implementerer AFP-(AppleShare-)protokollen samt de nødvendige meldinger, slik at servere automatisk kan oppdages av OS X-klienter.

source: Older Mac OS networks (before OS X) used a different protocol called AppleTalk. For environments involving machines using this protocol, Netatalk also provides the AppleTalk protocol (in fact, it started as a reimplementation of that protocol). It ensures the operation of the file server and print queues, as well as time server (clock synchronization). Its router function allows interconnection with AppleTalk networks.
nb_no: Eldre Mac OS-nettverk (før OS X) brukte en annen protokoll kalt AppleTalk. For miljøer som involverer maskiner ved hjelp av denne protokollen, gir Netatalk også AppleTalk-protokollen (faktisk startet det som en reimplementering av den protokollen). Det sikrer driften av filtjeneren og utskriftskøer, samt tidsserver (klokkesynkronisering ). Ruterfunksjonen dens tillater samtrafikk med AppleTalk-nettverk.

source: Integration with Other Linux/Unix Machines
nb_no: Integrasjon med andre Linux/Unix-maskiner

source: Finally, NFS and NIS, both included, guarantee interaction with Unix systems. NFS ensures file server functionality, while NIS creates user directories. The BSD printing layer, used by most Unix systems, also allows sharing of print queues.
nb_no: Til slutt: Både NFS og NIS garanterer samspill med Unix-systemer. NFS sikrer filtjenerfunksjonalitet, mens NIS lager brukerkataloger. BSD-utskriftslag, som brukes av de fleste Unix-systemer, gjør det også mulig å dele utskriftskøer.

source: Coexistence of Debian with OS X, Windows and Unix systems
nb_no: Sameksistens mellom Debian, OS X, Windows og Unix-systemer

source: How To Migrate
nb_no: Hvordan migrere

source: <primary>migration</primary>
nb_no: <primary>overflytting</primary>

source: In order to guarantee continuity of the services, each computer migration must be planned and executed according to the plan. This principle applies whatever the operating system used.
nb_no: For å sikre kontinuitet i tjenestene må hver datamaskin-migrasjon planlegges og gjennomføres etter planen. Dette prinsippet gjelder uansett hvilket operativsystem som brukes.

source: Survey and Identify Services
nb_no: Kartlegge og identifisere tjenester

source: As simple as it seems, this step is essential. A serious administrator truly knows the principal roles of each server, but such roles can change, and sometimes experienced users may have installed “wild” services. Knowing that they exist will at least allow you to decide what to do with them, rather than delete them haphazardly.
nb_no: Selv om det ser enkelt ut, er dette trinnet helt nødvendig. En seriøs administrator kjenner virkelig de viktigste oppgavene til hver server, men slike roller kan endre seg, og noen ganger kan erfarne brukere ha installert «ville» tjenester. Å vite at de eksisterer vil i det minste tillate deg å bestemme hva du skal gjøre med dem, heller enn å slette dem på måfå.

source: For this purpose, it is wise to inform your users of the project before migrating the server. To involve them in the project, it may be useful to install the most common free software programs on their desktops prior to migration, which they will come across again after the migration to Debian; Libre Office and the Mozilla suite are the best examples here.
nb_no: For dette formålet er det fornuftig å informere brukerne av prosjektet før tjeneren migreres. For å involvere dem i prosjektet kan det være nyttig å installere de vanligste gratisprogrammene på sine datamaskiner før migrasjonen, som de vil møte igjen etter overgangen til Debian; LibreOffice og Firefox er de beste eksemplene her.

source: Network and Processes
nb_no: Nettverk og prosesser

source: The <command>nmap</command> tool (in the package with the same name) will quickly identify Internet services hosted by a network connected machine without even requiring to log in to it. Simply call the following command on another machine connected to the same network:
nb_no: Dette <command>nmap</command>-verktøyet (i pakken med samme navn) vil raskt identifisere internettjenester i en nettverkstilkoblet maskin uten engang å kreve innlogging. Bare bruk følgende kommando på en annen maskin koblet til samme nettverk:

source: <emphasis>ALTERNATIVE</emphasis> Use <command>netstat</command> to find the list of available services
nb_no: <emphasis>ALTERNATIV</emphasis> Bruk <command>netstat</command> for å finne listen med tilgjengelige tjenester

source: On a Linux machine, the <command>netstat -tupan</command> command will show the list of active or pending TCP sessions, as well UDP ports on which running programs are listening. This facilitates identification of services offered on the network.
nb_no: På en Linux-maskin vil <command>netstat -tupan</command>-kommandoen vise listen over aktive eller TCP-sesjoner som venter, samt UDP-porter som kjørende programmer er knyttet opp til. Dette muliggjør å identifisere tjenestene som tilbys på nettet.

source: <emphasis>GOING FURTHER</emphasis> IPv6
nb_no: <emphasis>GÅR VIDERE</emphasis> IPv6 (<emphasis>GOING FURTHER</emphasis> IPv6)

source: Some network commands may work either with IPv4 (the default usually) or with IPv6. These include the <command>nmap</command> and <command>netstat</command> commands, but also others, such as <command>route</command> or <command>ip</command>. The convention is that this behavior is enabled by the <parameter>-6</parameter> command-line option.
nb_no: Noen nettverkskommandoer vil virke enten med IPv4 (vanligvis forvalgt), eller med IPv6. Disse innkluderer <command>nmap</command>, og <command>netstat</command>-kommandoer, men også andre, som <command>route</command> eller <command>ip</command>. Det normale er at dette muliggjøres ved å velge kommandolinjen <parameter>-6</parameter>.

source: If the server is a Unix machine offering shell accounts to users, it is interesting to determine if processes are executed in the background in the absence of their owner. The command <command>ps auxw</command> displays a list of all processes with their user identity. By checking this information against the output of the <command>who</command> command, which gives a list of logged in users, it is possible to identify rogue or undeclared servers or programs running in the background. Looking at <filename>crontabs</filename> (tables listing automatic actions scheduled by users) will often provide interesting information on functions fulfilled by the server (a complete explanation of <command>cron</command> is available in <xref linkend="sect.task-scheduling-cron-atd" />).
nb_no: Hvis serveren er en Unix-maskin med skallkontoer til brukere, er det interessant å finne ut om prosessene utføres i bakgrunnen i eierens fravær. Kommandoen <command>ps auxw</command> viser en liste med alle prosesser med sin brukeridentitet. Ved å sjekke denne informasjonen opp mot resultatet av <command>who</command>-kommandoen, som gir en liste over innloggede brukere, er det mulig å identifisere problematiske eller ikke synlige tjenere eller programmer som kjører i bakgrunnen. Å se på <filename>crontabs</filename> (tabeller som automatisk lister handlinger satt opp av brukere) vil ofte gi interessant informasjon om oppgaver tjeneren har utført (en full forklaring av <command>cron</command> er tilgjengelig på <xref linkend="sect.task-scheduling-cron-atd" />).

source: In any case, it is essential to backup your servers: this allows recovery of information after the fact, when users will report specific problems due to the migration.
nb_no: Uansett er det viktig å ta backup av dine tjenere: Det tillater gjenoppretting av informasjon i ettertid, når brukere rapporterer spesifikke problemer som følge av migrasjonen.

source: Backing up the Configuration
nb_no: Backup av konfigureringen

source: It is wise to retain the configuration of every identified service in order to be able to install the equivalent on the updated server. The bare minimum is to make a backup copy of the configuration files.
nb_no: Det er lurt å beholde konfigurasjonen til hver identifiserte tjeneste for å kunne installere den tilsvarende på den oppdaterte tjeneren. Minstekravet er å lage en sikkerhetskopi av konfigurasjonsfilene .

source: For Unix machines, the configuration files are usually found in <filename>/etc/</filename>, but they may be located in a sub-directory of <filename>/usr/local/</filename>. This is the case if a program has been installed from sources, rather than with a package. In some cases, one may also find them under <filename>/opt/</filename>.
nb_no: For Unix maskiner er konfigurasjonsfilene vanligvis funnet i <filename>/etc/</filename>, men de kan befinne seg i en underkatalog av <filename>/usr/local/</filename>. Dette er tilfellet dersom et program har blitt installert fra kilden, heller enn som en pakke. I noen tilfeller kan man også finne dem under <filename>/opt/</filename>.

source: For data managing services (such as databases), it is strongly recommended to export the data to a standard format that will be easily imported by the new software. Such a format is usually in text mode and documented; it may be, for example, an SQL dump for a database, or an LDIF file for an LDAP server.
nb_no: For administrative datatjenester (for eksempel databaser) er det sterkt anbefalt å eksportere dataene til et standard format som vil være lett for den nye programvaren å importere. Et slikt format er vanligvis i tekstmodus og dokumentert; det kan for eksempel være en SQL utskift av en database, eller en LDIF-fil for en LDAP-tjener.

source: Database backups
nb_no: Databasebackup

source: Each server software is different, and it is impossible to describe all existing cases in detail. Compare the documentation for the existing and the new software to identify the exportable (thus, re-importable) portions and those which will require manual handling. Reading this book will clarify the configuration of the main Linux server programs.
nb_no: Hver tjenerprogramvare er forskjellig, og det er umulig å beskrive alle eksisterende tilfeller i detalj. Sammenlign dokumentasjon for den eksisterende og den nye programvaren for å identifisere hvilke deler som kan eksporteres (og dermed reimporteres), og de som vil kreve manuell håndtering. Å lese denne boken vil avklare konfigureringen av de viktigste Linux-tjenerprogrammene.

source: Taking Over an Existing Debian Server
nb_no: Å overta en eksisterende Debian-tjener

source: <primary>taking over a Debian server</primary>
nb_no: <primary>ta over en Debian-tjener</primary>

source: To effectively take over its maintenance, one may analyze a machine already running with Debian.
nb_no: For effektivt å ta over vedlikeholdet av maskinen kan man analysere en maskin som allerede kjører med Debian.

source: The first file to check is <filename>/etc/debian_version</filename>, which usually contains the version number for the installed Debian system (it is part of the <emphasis>base-files</emphasis> package). If it indicates <literal><replaceable>codename</replaceable>/sid</literal>, it means that the system was updated with packages coming from one of the development distributions (either testing or unstable).
nb_no: Den første filen for sjekking er <filename>/etc/debian_version</filename>, som vanligvis inneholder versjonsnummeret for det installerte Debian-systemet (det er en del av <emphasis>base-files</emphasis> pakken). Hvis det indikerer <literal><replaceable>codename</replaceable>/sid</literal>, betyr det at systemet ble oppdatert med pakker som kommer fra en av utviklingsdistribusjonene (enten testing eller ustabil).

source: The <command>apt-show-versions</command> program (from the Debian package of the same name) checks the list of installed packages and identifies the available versions. <command>aptitude</command> can also be used for these tasks, albeit in a less systematic manner.
nb_no: <command>apt-show-versions</command>-programmet (fra Debian-pakken med samme navn) sjekker listen over installerte pakker, og identifiserer de tilgjengelige versjonene. <command>aptitude</command> kan også brukes til disse oppgavene, om enn på en mindre systematisk måte.

source: A glance at the <filename>/etc/apt/sources.list</filename> file (and <filename>/etc/apt/sources.list.d/</filename> directory) will show where the installed Debian packages likely came from. If many unknown sources appear, the administrator may choose to completely reinstall the computer's system to ensure optimal compatibility with the software provided by Debian.
nb_no: Et blikk på <filename>/etc/apt/sources.list</filename>-filen (og <filename>/etc/apt/sources.list.d/</filename>-katalogen) viser hvor de installerte Debian-pakker sannsynligvis kommer fra. Hvis mange ukjente kilder vises, kan administratoren velge å fullstendig reinstallere maskinens system for å sikre optimal kompatibilitet med programvaren levert av Debian.

source: The <filename>sources.list</filename> file is often a good indicator: the majority of administrators keep, at least in comments, the list of APT sources that were previously used. But you should not forget that sources used in the past might have been deleted, and that some random packages grabbed on the Internet might have been manually installed (with the <command>dpkg</command> command). In this case, the machine is misleading in its appearance of “standard” Debian. This is why you should pay attention to any indication that will give away the presence of external packages (appearance of <filename>deb</filename> files in unusual directories, package version numbers with a special suffix indicating that it originated from outside the Debian project, such as <literal>ubuntu</literal> or <literal>lmde</literal>, etc.)
nb_no: <filename>sources.list</filename>-filen er ofte en god indikator: flertallet av administratorene beholder, iallefall i kommentarene, listen over APT-kilder som tidligere ble brukt. Men du bør ikke glemme at tidligere brukte kilder kan ha blitt slettet, og at noen tilfeldige pakker tatt fra Internettet kan ha blitt installert manuelt (med <command>dpkg</command>-kommandoen). I dette tilfellet er maskinen misvisende som en «standard» Debian. Dette er grunnen til at du bør være oppmerksom på enhver indikasjon som vil avdekke tilstedeværelsen av eksterne pakker (forekomsten av <filename>deb</filename>-filer i uvanlige kataloger, pakkeversjonsnumre med en spesiell endelse som indikerer at de stammer fra kilder utenfor Debian-prosjektet, som for eksempel literal>ubuntu</literal> eller <literal>lmde</literal>, etc.)

source: Likewise, it is interesting to analyze the contents of the <filename>/usr/local/</filename> directory, whose purpose is to contain programs compiled and installed manually. Listing software installed in this manner is instructive, since this raises questions on the reasons for not using the corresponding Debian package, if such a package exists.
nb_no: På samme måte er det interessant å analysere innholdet av <filename>/usr/local/</filename>-katalogen, hvis formål er å inneholde programmer kompilert og installert manuelt. Listing av programvare installert på denne måten er instruktivt, siden dette reiser spørsmål om grunnene til ikke å bruke den tilsvarende Debian-pakken, hvis en slik pakke eksisterer.

source: <emphasis>QUICK LOOK</emphasis> <emphasis role="pkg">cruft</emphasis>
nb_no: <emphasis>RASK TITT</emphasis> <emphasis role="pkg">cruft</emphasis>

source: The <emphasis role="pkg">cruft</emphasis> package proposes to list the available files that are not owned by any package. It has some filters (more or less effective, and more or less up to date) to avoid reporting some legitimate files (files generated by Debian packages, or generated configuration files not managed by <command>dpkg</command>, etc.).
nb_no: Den <emphasis role="pkg">cruft</emphasis> utdaterte pakken foreslår å liste tilgjengelige filer som ikke hører hjemme i noen pakke. Den har noen filtre (mer eller mindre effektive, og mer eller mindre oppdatert) for å unngå rapportering av noen legitime filer (filer generert av Debian-pakker, eller genererte konfigurasjonsfiler ikke styrt av <command>dpkg</command>, etc.).

source: Be careful to not blindly delete everything that <command>cruft</command> might list!
nb_no: Vær forsiktig å ikke blindt slette at som <command>cruft</command> måtte liste!

source: Installing Debian
nb_no: Å installere Debian

source: Once all the required information on the current server is known, we can shut it down and begin to install Debian on it.
nb_no: Når all nødvendig informasjon om den aktuelle tjeneren er kjent, kan vi slå den av og starte installasjonen av Debian på den.

source: <primary>architecture</primary>
nb_no: <primary>arkitektur</primary>

source: To choose the appropriate version, we must know the computer's architecture. If it is a reasonably recent PC, it is most likely to be amd64 (older PCs were usually i386). In other cases, we can narrow down the possibilities according to the previously used system.
nb_no: For å velge den riktige versjonen, må vi kjenne datamaskinens arkitektur. Hvis den er en rimelig fersk PC, er den mest sannsynlig en amd64 (eldre PCer er vanligvis i386). I andre tilfelle, kan vi avgrense mulighetene ut fra det systemet som ble brukt tidligere.

source: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> is not intended to be exhaustive, but may be helpful. In any case, the original documentation for the computer is the most reliable source to find this information.
nb_no: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> er ikke ment å være uttømmende, men kan være nyttig. I alle fall er den opprinnelige dokumentasjonen for datamaskinen den mest pålitelige kilden for å finne denne informasjonen.

source: Matching operating system and architecture
nb_no: Samsvarende operativsystem og arkitektur

source: Operating System
nb_no: Operativsystem

source: Architecture(s)
nb_no: Arkitektur(er)

source: <emphasis>HARDWARE</emphasis> 64 bit PC vs 32 bit PC
nb_no: <emphasis>MASKINVARE</emphasis> 64 bit PC vs 32 bit PC

source: Most recent computers have 64 bit Intel or AMD processors, compatible with older 32 bit processors; the software compiled for “i386” architecture thus works. On the other hand, this compatibility mode does not fully exploit the capabilities of these new processors. This is why Debian provides the “amd64” architecture, which works for recent AMD chips as well as Intel “em64t” processors (including most of the Core series), which are very similar to AMD64.
nb_no: De fleste nye datamaskiner har 64 bit Intel eller AMD-prosessorer, som er kompatible med eldre 32 bits prosessorer; derfor fungerer programvare kompilert for "i386" arkitektur. På den annen side, dette kompatibilitetsmodus utnytter ikke fullt ut egenskapene til disse nye prosessorene. Dette er grunnen til Debian leverer "amd64"-arkitekturen, som kjører på AMD-brikker så vel som Intel "em64t"-prosessorer (inkludert de fleste i Core-serien), som er svært lik AMD64.

source: Installing and Configuring the Selected Services
nb_no: Installere og konfigurere de valgte tjenestene
