Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: With APT, packages can be added or removed from the system, respectively with <command>apt install <replaceable>package</replaceable></command> and <command>apt remove <replaceable>package</replaceable></command>. In both cases, APT will automatically install the necessary dependencies or delete the packages which depend on the package that is being removed. The <command>apt purge <replaceable>package</replaceable></command> command involves a complete uninstallation — the configuration files are also deleted.
nb_no: Med APTs, kan pakker legges til eller fjernes fra systemet, med henholdsvis <command>apt install <replaceable>package</replaceable></command> og <command>apt remove <replaceable>pakke</replaceable></command>. I begge tilfeller, vil APT automatisk installere de nødvendige avhengighetene eller slette pakker som er avhengig av pakken som blir fjernet. <command>apt purge <replaceable>pakke</replaceable></command>-pakken involverer en komplett avinstallisering - konfigurasjonsfilene slettes også.

source: <emphasis>TIP</emphasis> Installing the same selection of packages several times
nb_no: <emphasis>TIP</emphasis> Installere samme utvalg av pakker flere ganger

source: It can be useful to systematically install the same list of packages on several computers. This can be done quite easily.
nb_no: Det kan være nyttig å automatisk installere den samme listen med pakker på flere datamaskiner. Dette kan gjøres ganske enkelt.

source: First, retrieve the list of packages installed on the computer which will serve as the “model” to copy.
nb_no: Først, hent listen over pakker installert på datamaskinen som skal fungere som «modell» for kopiering.

source: The <filename>pkg-list</filename> file then contains the list of installed packages. Next, transfer the <filename>pkg-list</filename> file onto the computers you want to update and use the following commands:
nb_no: <filename>pkg-list</filename>-filen inneholder nå listen med installerte pakker. Deretter overføres <filename>pkg-list</filename>-filen på datamaskinene du vil oppdatere, og bruker følgende kommandoer::

source: The first commands records the list of available packages in the dpkg database, then <command>dpkg --set-selections</command> restores the selection of packages that you wish to install, and the <command>apt-get</command> invocation executes the required operations! <command>aptitude</command> does not have this command.
nb_no: De første kommandoene registrerer listen over tilgjengelige pakker i dpkg-databasen, deretter gjenoppretter <command>dpkg --set-selections</command> valget av pakker du ønsker å installere, og <command>apt-get</command> kjører de nødvendige operasjonene! <command>aptitude</command> har ikke denne kommandoen.

source: <emphasis>TIP</emphasis> Removing and installing at the same time
nb_no: <emphasis>TIP</emphasis> Fjerne og installere samtidig

source: It is possible to ask <command>apt</command> (or <command>apt-get</command>, or <command>aptitude</command>) to install certain packages and remove others on the same command line by adding a suffix. With an <command>apt install</command> command, add “<literal>-</literal>” to the names of the packages you wish to remove. With an <command>apt remove</command> command, add “<literal>+</literal>” to the names of the packages you wish to install.
nb_no: Det er mulig å spørre <command>apt</command> (eller <command>apt-get</command>, eller <command>aptitude</command>) til å installere enkelte pakker, og fjerne andre på samme kommandolinje ved å legge til et suffiks. Med en <command>apt install</command>-kommando, legg til «<literal>-</literal>» til navnene på de pakkene du ønsker å fjerne. Med en <command>apt remove</command>-kommando, legg «<literal>+</literal>» til navnene på de pakkene du vil installere.

source: The next example shows two different ways to install <replaceable>package1</replaceable> and to remove <replaceable>package2</replaceable>.
nb_no: Det neste eksempelet viser to forskjellige måter å installere <replaceable>pakke1</replaceable> og for å fjerne <replaceable>pakke2</replaceable>.

source: # <userinput>apt install <replaceable>package1</replaceable> <replaceable>package2-</replaceable></userinput> [...] # <userinput>apt remove <replaceable>package1+</replaceable> <replaceable>package2</replaceable></userinput> [...]
nb_no: # <userinput>apt install <replaceable>pakke1</replaceable> <replaceable>pakke2-</replaceable></userinput> [...] # <userinput>apt remove <replaceable>pakke1+</replaceable> <replaceable>pakke2</replaceable></userinput> [...]

source: This can also be used to exclude packages which would otherwise be installed, for example due to a <literal>Recommends</literal>. In general, the dependency solver will use that information as a hint to look for alternative solutions.
nb_no: Dette kan også brukes til å ekskludere pakker som ellers ville blitt installert, for eksempel på grunn av en <literal>Recommends</literal>. Generelt vil avhengighetsløseren bruke denne informasjonen som et hint for å lete etter alternative løsninger.

source: <emphasis>TIP</emphasis> <command>apt --reinstall</command> and <command>aptitude reinstall</command>
nb_no: <emphasis>TIP</emphasis> <command>apt --reinstall</command> og <command>aptitude reinstall</command>

source: <primary>reinstallation</primary>
nb_no: <primary>reinstallasjon</primary>

source: The system can sometimes be damaged after the removal or modification of files in a package. The easiest way to retrieve these files is to reinstall the affected package. Unfortunately, the packaging system finds that the latter is already installed and politely refuses to reinstall it; to avoid this, use the <literal>--reinstall</literal> option of the <command>apt</command> and <command>apt-get</command> commands. The following command reinstalls <emphasis role="pkg">postfix</emphasis> even if it is already present:
nb_no: Systemet kan noen ganger bli skadet etter fjerning eller endring av filer i en pakke. Den enkleste måten å hente frem disse filene er å installere den berørte pakken. Dessverre finner pakkesystemet at sistnevnte allerede er installert, og høflig nekter å installere det på nytt; for å unngå dette, kan du bruke <literal>--reinstall</literal> muligheten av <command>apt</command> og <command>apt-get</command>-kommandoer. De følgende kommandoer reinstallerer <emphasis role="pkg">postfix</emphasis > selv om den allerede er tilstede:

source: The <command>aptitude</command> command line is slightly different, but achieves the same result with <command>aptitude reinstall postfix</command>.
nb_no: <command>aptitude</command>-kommandolinjen er litt ulik, men oppnår det samme resultat med <command>aptitude reinstall postfix</command>.

source: The problem does not arise with <command>dpkg</command>, but the administrator rarely uses it directly.
nb_no: Problemet oppstår ikke med <command>dpkg</command>, men administratoren bruker den sjelden direkte.

source: Be careful! Using <command>apt --reinstall</command> to restore packages modified during an attack will certainly not recover the system as it was. <xref linkend="sect.dealing-with-compromised-machine" /> details the necessary steps to take with a compromised system.
nb_no: Vær forsiktig. Å bruke <command>apt --reinstall</command> for å gjenopprette pakker modifisert under et angrep, vil sikkert ikke gjenopprette systemet slik det var. <xref linkend="sect.dealing-with-compromised-machine" /> gir detaljene med de nødvendige skritt overfor et kompromittert system.

source: If the file <filename>sources.list</filename> mentions several distributions, it is possible to give the version of the package to install. A specific version number can be requested with <command>apt install <replaceable>package</replaceable>=<replaceable>version</replaceable></command>, but indicating its distribution of origin (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>) — with <command>apt install <replaceable>package</replaceable>/<replaceable>distribution</replaceable></command> — is usually preferred. With this command, it is possible to go back to an older version of a package (if for instance you know that it works well), provided that it is still available in one of the sources referenced by the <filename>sources.list</filename> file. Otherwise the <literal>snapshot.debian.org</literal> archive can come to the rescue (see sidebar <xref linkend="sidebar.snapshot.debian.org" />).
nb_no: Hvis filen <filename>sources.list</filename> nevner flere distibusjoner, er det mulig å gi den versjonen av pakken som skal installeres. Et spesifikt versjonsnummer kan hentes med <command>apt install <replaceable>pakke</replaceable>=<replaceable>versjon</replaceable></command>, men å indikere distribusjonens opprinnelse (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> eller <emphasis role="distribution">Unstable</emphasis>) - med <command>apt install <replaceable>pakke</replaceable>/<replaceable>distribusjon</replaceable></command> - er vanligvis foretrukket. Med denne kommandoen er det mulig å gå tilbake til en eldre versjon av en pakke (hvis for eksempel du vet at den fungerer godt), forutsatt at den er tilgjengelig i en av kildene refererert til av <filename>sources.list</filename>-filen. Ellers kan <literal>snapshot.debian.org</literal>-arkivet komme til hjelp (se sidefelt <xref linkend="sidebar.snapshot.debian.org" />).

source: Installation of the <emphasis role="distribution">unstable</emphasis> version of <emphasis role="pkg">spamassassin</emphasis>
nb_no: Installasjon av <emphasis role="distribution">unstable</emphasis>-versjonen av <emphasis role="pkg">spamassassin</emphasis>

source: <emphasis>GOING FURTHER</emphasis> The cache of <filename>.deb</filename> files
nb_no: <emphasis>GÅR VIDERE</emphasis>The cache of (hurtiglager) <filename>.deb</filename>-filer

source: APT keeps a copy of each downloaded <filename>.deb</filename> file in the directory <filename>/var/cache/apt/archives/</filename>. In case of frequent updates, this directory can quickly take a lot of disk space with several versions of each package; you should regularly sort through them. Two commands can be used: <command>apt-get clean</command> entirely empties the directory; <command>apt-get autoclean</command> only removes packages which can no longer be downloaded (because they have disappeared from the Debian mirror) and are therefore clearly useless (the configuration parameter <literal>APT::Clean-Installed</literal> can prevent the removal of <filename>.deb</filename> files that are currently installed). Note that <command>apt</command> does not support those commands.
nb_no: APT tar vare på en kopi av hver nedlastede <filename>.deb</filename>-fil i mappen <filename>/var/cache/apt/archives/</filename>. Ved hyppige oppdateringer, kan denne mappen raskt ta mye diskplass med flere versjoner av hver pakke: Du bør regelmessig ordne dem. To kommandoer kan brukes: <command>apt-get clean</command> tømmer mappen helt; <command>apt-get autoclean</command> fjerner kun pakker som ikke lenger kan lastes ned (fordi de har forsvunnet fra Debian-speilet) og er derfor klart ubrukelig (konfigurasjonsparameteren <literal>APT::Clean-Installed</literal> kan hindre fjerning av <filename>.deb</filename>-filer som nå er installert). Merk at <command>apt</command> ikke støtter disse kommandoene.

source: System Upgrade
nb_no: Oppgradering av systemet

source: <primary>upgrade</primary><secondary>system upgrade</secondary>
nb_no: <primary>oppgradere</primary><secondary>system oppgradere</secondary>

source: Regular upgrades are recommended, because they include the latest security updates. To upgrade, use <command>apt upgrade</command>, <command>apt-get upgrade</command> or <command>aptitude safe-upgrade</command> (of course after <command>apt update</command>). This command looks for installed packages which can be upgraded without removing any packages. In other words, the goal is to ensure the least intrusive upgrade possible. <command>apt-get</command> is slightly more demanding than <command>aptitude</command> or <command>apt</command> because it will refuse to install packages which were not installed beforehand.
nb_no: Regelmessige oppgraderinger anbefales fordi de inneholder de nyeste sikkerhetsoppdateringene. For å oppgradere bruk <command>apt upgrade</command>, <command>apt-get upgrade</command>, eller <command>aptitude safe-upgrade</command> (selvfølgelig etter <command>apt update</command>). Denne kommandoen ser etter installerte pakker som kan oppgraderes uten at pakker fjernes. Med andre ord er målet å sikre den minst mulig påtrengende oppgraderingen. <command>apt-get</command> er litt mer krevende enn <command>aptitude</command>, eller <command>apt</command> fordi den vil avslå å installere pakker som ikke var installert på forhånd.

source: <emphasis>TIP</emphasis> Incremental upgrade
nb_no: <emphasis>TIP</emphasis> Trinnvis oppgradering

source: As we explained earlier, the aim of the <command>apt update</command> command is to download for each package source the corresponding <filename>Packages</filename> (or <filename>Sources</filename>) file. However, even after a <command>bzip2</command> compression, these files can remain rather large (the <filename>Packages.xz</filename> for the <foreignphrase>main</foreignphrase> section of <emphasis role="distribution">Jessie</emphasis> takes more than 6 MB). If you wish to upgrade regularly, these downloads can take up a lot of time.
nb_no: Som vi forklarte tidligere er målet med <command>apt update</command>-kommandoen å laste ned den samsvarende <filename>Packages</filename> (eller <filename>Sources</filename>)-filen for hver kildepakke. Imidlertid, selv etter en <command>bzip2</command>-komprimering, kan disse filene forbli ganske store (<filename>Packages.xz</filename> for <foreignphrase>main</foreignphrase>-seksjonen til <emphasis role="distribution">Jessie</emphasis> kreves mer enn 6 MB). Dersom du ønsker å oppgradere regelmessig, kan disse nedlastingene bruke mye tid.

source: To speed up the process APT can download “diff” files containing the changes since the previous update, as opposed to the entire file. To achieve this, official Debian mirrors distribute different files which list the differences between one version of the <filename>Packages</filename> file and the following version. They are generated at each update of the archives and a history of one week is kept. Each of these “diff” files only takes a few dozen kilobytes for <emphasis role="distribution">Unstable</emphasis>, so that the amount of data downloaded by a weekly <command>apt update</command> is often divided by 10. For distributions like <emphasis role="distribution">Stable</emphasis> and <emphasis role="distribution">Testing</emphasis>, which change less, the gain is even more noticeable.
nb_no: For å fremskynde prosessen kan APT laste ned «diff»-filer med endringene siden forrige oppdatering, og ikke filen i sin helhet. For å oppnå dette distribuerer offisielle Debian-speil forskjellige filer som lister forskjellene mellom en versjon av <filename>Packages</filename>-filen and den følgende versjonen. De er generert ved hver mappeoppdatering, og en ukes historie er lagret. Hver av disse «diff»-filene har bare et par dusin kilobyte for <emphasis role="distribution">Unstable</emphasis>, slik at mengden data som lastes ned ved en ukentlig <command>apt update</command> blir ofte en tiendedel. For distribusjoner som <emphasis role="distribution">Stable</emphasis> og <emphasis role="distribution">Testing</emphasis>, som endrer mindre, er gevinsten enda mer merkbar.

source: However, it can sometimes be of interest to force the download of the entire <filename>Packages</filename> file, especially when the last upgrade is very old and when the mechanism of incremental differences would not contribute much. This can also be interesting when network access is very fast but when the processor of the machine to upgrade is rather slow, since the time saved on the download is more than lost when the computer calculates the new versions of these files (starting with the older versions and applying the downloaded differences). To do that, you can use the configuration parameter <literal>Acquire::Pdiffs</literal> and set it to <literal>false</literal>.
nb_no: Men det kan noen ganger være av interesse å tvinge nedlasting av hele <filename>Packages</filename>-filen, spesielt når den siste oppgraderingen er svært gammel, og når mekanismen med gradvis økende forskjeller ikke bidrar mye. Dette kan også være interessant når nettverkstilgang er veldig rask, men prosessoren på maskinen som skal oppgraderes er ganske treg, slik at tiden spart på nedlasting blir mer enn tapt når datamaskinen beregner de nye versjonene av disse filene (starter med de eldre versjonene og anvender de nedlastede forskjellene). For å gjøre det kan du bruke konfigurasjonsparameteret <literal>Acquire::Pdiffs</literal>, og sette det til <literal>false</literal>.

source: <command>apt</command> will generally select the most recent version number (except for packages from <emphasis role="distribution">Experimental</emphasis> and <emphasis role="distribution">stable-backports</emphasis>, which are ignored by default whatever their version number). If you specified <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> in your <filename>sources.list</filename>, <command>apt upgrade</command> will switch most of your <emphasis role="distribution">Stable</emphasis> system to <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>, which might not be what you intended.
nb_no: <command>apt</command> vil vanligvis velge det seneste versjonsnummeret (unntatt for pakker fra <emphasis role="distribution">Experimental</emphasis> og <emphasis role="distribution">stable-backports</emphasis>, som ignoreres uansett versjonsnummer). Hvis du spesifiserer <emphasis role="distribution">Testing</emphasis>, eller <emphasis role="distribution">Unstable</emphasis> i din <filename>sources.list</filename>, vil <command>apt upgrade</command> skifte til det meste av ditt <emphasis role="distribution">Stable</emphasis>-system til <emphasis role="distribution">Testing</emphasis> eller <emphasis role="distribution">Unstable</emphasis>, som kanskje ikke var det du ville.

source: To tell <command>apt</command> to use a specific distribution when searching for upgraded packages, you need to use the <literal>-t</literal> or <literal>--target-release</literal> option, followed by the name of the distribution you want (for example: <command>apt -t stable upgrade</command>). To avoid specifying this option every time you use <command>apt</command>, you can add <literal>APT::Default-Release "stable";</literal> in the file <filename>/etc/apt/apt.conf.d/local</filename>.
nb_no: Å be <command>apt</command> om å bruke en bestemt distribusjon når du søker etter oppgraderte pakker, må du bruke <literal>-t</literal> or <literal>--target-release</literal>-valget, etterfulgt av navnet på distribusjonen du ønsker (for eksempel:<command>apt -t stable upgrade</command>). For å slippe å spesifisere dette alternativet hver gang du bruker<command>apt</command>, kan du legge til <literal>APT::Default-Release "stable";</literal> i filen <filename>/etc/apt/apt.conf.d/local</filename>.

source: For more important upgrades, such as the change from one major Debian version to the next, you need to use <command>apt full-upgrade</command>. With this instruction, <command>apt</command> will complete the upgrade even if it has to remove some obsolete packages or install new dependencies. This is also the command used by users who work daily with the Debian <emphasis role="distribution">Unstable</emphasis> release and follow its evolution day by day. It is so simple that it hardly needs explanation: APT's reputation is based on this great functionality.
nb_no: For viktigere oppgraderinger, som for eksempel overgang fra en stor Debian versjon til den neste, må du bruke <command>apt full-upgrade</command>. Med denne instruksjonen vil <command>apt</command> fullføre oppgraderingen selv om den må fjerne noen utdaterte pakker, eller installere nye avhengigheter. Dette er også kommandoen som benyttes av brukere som jobber daglig med Debian <emphasis role="distribution">Unstable</emphasis>-utgaven, og følger dens utvikling dag for dag. Det er så enkelt at det nesten ikke trenger forklaring: APTs omdømme er basert på denne store funksjonaliten.

source: Unlike <command>apt</command> and <command>aptitude</command>, <command>apt-get</command> doesn't know the <command>full-upgrade</command> command. Instead, you should use <command>apt-get dist-upgrade</command> (”distribution upgrade”), the historical and well-known command that <command>apt</command> and <command>aptitude</command> also accept for the convenience of users who got used to it.
nb_no: Til forskjell fra <command>apt</command> og <command>aptitude</command>, kjenner ikke <command>apt-get</command> til <command>full-upgrade</command>-kommandoen. I stedet skal du bruke <command>apt-get dist-upgrade</command> («distribution upgrade»), den historiske og velkjente kommandoen <command>apt</command> og <command>aptitude</command> godtas også, til lettelse for de brukerne som ble vant med den.

source: Configuration Options
nb_no: Konfigureringsvalg

source: <primary>APT</primary><secondary>configuration</secondary>
nb_no: <primary>APT</primary><secondary>konfigurasjon</secondary>

source: Besides the configuration elements already mentioned, it is possible to configure certain aspects of APT by adding directives in a file of the <filename>/etc/apt/apt.conf.d/</filename> directory. Remember for instance that it is possible for APT to tell <command>dpkg</command> to ignore file conflict errors by specifying <literal>DPkg::options { "--force-overwrite"; }</literal>.
nb_no: Foruten de konfigurasjonselementer som allerede er nevnt, er det mulig å konfigurere visse egenskaper ved APT ved å legge til direktiver i en fil i <filename>/etc/apt/apt.conf.d/</filename>-mappen. Husk for eksempel at det er mulig for APT å be <command>dpkg</command> om å ignorere filkonfliktfeil ved å spesifisere <literal>DPkg::options { "--force-overwrite"; }</literal>.

source: If the Web can only be accessed through a proxy, add a line like <literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal>. For an FTP proxy, write <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal>. To discover more configuration options, read the <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page with the <command>man apt.conf</command> command (for details on manual pages, see <xref linkend="sect.manual-pages" />).
nb_no: Hvis Internettet bare kan nås via en mellomtjener, legg til en linje som <literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal>. For en FTP-mellomtjener, skriv <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal>. For å finne flere konfigurasjonsvalg, les <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manuelle side med <command>man apt.conf</command>-kommandoen (for detaljer om manuelle sider, se <xref linkend="sect.manual-pages" />).

source: <emphasis>BACK TO BASICS</emphasis> Directories ending in <filename>.d</filename>
nb_no: <emphasis>TILBAKE TIL BASIS</emphasis> Kataloger som slutter på <filename>.d</filename>
