Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: Directories with a <filename>.d</filename> suffix are used more and more often. Each directory represents a configuration file which is split over multiple files. In this sense, all of the files in <filename>/etc/apt/apt.conf.d/</filename> are instructions for the configuration of APT. APT includes them in alphabetical order, so that the last ones can modify a configuration element defined in one of the first ones.
nb_no: Mapper med et <filename>.d</filename>-suffiks blir brukt oftere og oftere. Hver mappe representerer en konfigurasjonsfil som er fordelt over flere filer. I denne forstand er alle filene i <filename>/etc/apt/apt.conf.d/</filename> instruksjoner av APT-konfigurering. APT inkluderer dem i alfabetisk rekkefølge, slik at de siste kan endre et konfigurasjonselement definert i en av de første.

source: This structure brings some flexibility to the machine administrator and to the package maintainers. Indeed, the administrator can easily modify the configuration of the software by adding a ready-made file in the directory in question without having to change an existing file. Package maintainers use the same approach when they need to adapt the configuration of another software to ensure that it perfectly co-exists with theirs. The Debian policy explicitly forbids modifying configuration files of other packages — only users are allowed to do this. Remember that during a package upgrade, the user gets to choose the version of the configuration file that should be kept when a modification has been detected. Any external modification of the file would trigger that request, which would disturb the administrator, who is sure not to have changed anything.
nb_no: Denne strukturen gir en viss fleksibilitet til maskinens administrator og til pakkens vedlikeholdere. Faktisk kan administratoren enkelt endre konfigurasjonen av programvaren ved å legge til en ferdig fil i katalogen det gjelder uten å måtte endre en eksisterende fil. Pakkevedlikeholdere bruker samme tilnærming når de må tilpasse konfigurasjonen av annen programvare for å sikre at den fullt ut virker sammen med deres. Debians politikk forbyr eksplisitt endring av konfigurasjonsfiler fra andre pakker - bare brukere får lov til å gjøre dette. Husk at under en pakkeoppgradering, får brukeren velge den versjonen av konfigurasjonsfilen som skal beholdes når en endring er påvist. Enhver ekstern endring av filen vil utløse den forespørselen, noe som ville forstyrre administratoren, som er sikker på å ikke ha endret noe.

source: Without a <filename>.d</filename> directory, it is impossible for an external package to change the settings of a program without modifying its configuration file. Instead it must invite the user to do it themselves and lists the operations to be done in the file <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename>.
nb_no: Uten en <filename>.d</filename>-katalog er det umulig for en ekstern pakke å endre på oppsettet til et program uten å endre programmets oppsettsfiler. I stedet må den eksterne pakken spørre brukeren om å gjøre endringen selv, og beskrive operasjonene som skal utføres i filen <filename>/usr/share/doc/<replaceable>pakke</replaceable>/README.Debian</filename>.

source: Depending on the application, the <filename>.d</filename> directory is used directly or managed by an external script which will concatenate all the files to create the configuration file itself. It is important to execute the script after any change in that directory so that the most recent modifications are taken into account. In the same way, it is important not to work directly in the configuration file created automatically, since everything would be lost at the next execution of the script. The chosen method (<filename>.d</filename> directory used directly or a file generated from that directory) is usually dictated by implementation constraints, but in both cases the gains in terms of configuration flexibility more than make up for the small complications that they entail. The Exim 4 mail server is an example of the generated file method: it can be configured through several files (<filename>/etc/exim4/conf.d/*</filename>) which are concatenated into <filename>/var/lib/exim4/config.autogenerated</filename> by the <command>update-exim4.conf</command> command.
nb_no: Avhengig av programmet, brukes <filename>.d</filename>-mappen direkte, eller styrt av et eksternt skript som vil kolble sammen alle filene for å opprette selve konfigurasjonsfilen. Det er viktig å kjøre skriptet etter alle endringer i denne katalogen, slik at de seneste endringene blir tatt hensyn til. På samme måte er det viktig å ikke arbeide direkte i konfigurasjonsfilen som er opprettet automatisk, siden alt ville gå tapt ved neste kjøring av skriptet. Den valgte metoden (<filename>.d</filename>-mappen brukes direkte, eller en fil generert fra denne mappen) er vanligvis diktert av implementeringsbegrensninger, men i begge tilfeller kompenserer gevinstene i form av konfigurasjonsfleksibilitet for de små komplikasjonene de medfører. Exim 4-posttjeneren er et eksempel på den genererte filmetoden: Den kan konfigureres gjennom flere filer (<filename>/etc/exim4/conf.d/*</filename>) som er koblet sammen til <filename>/var/lib/exim4/config.autogenerated</filename> av <command>update-exim4.conf</command>-kommandoen.

source: Managing Package Priorities
nb_no: Styring av pakkeprioriteter

source: One of the most important aspects in the configuration of APT is the management of the priorities associated with each package source. For instance, you might want to extend one distribution with one or two newer packages from <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis>. It is possible to assign a priority to each available package (the same package can have several priorities depending on its version or the distribution providing it). These priorities will influence APT's behavior: for each package, it will always select the version with the highest priority (except if this version is older than the installed one and if its priority is less than 1000).
nb_no: En av de viktigste aspektene i konfigurasjonen av APT er behandlingen av prioriteringene knyttet til hver pakkekilde. For eksempel kan du ønske å forlenge en fordeling med en eller to nyere pakker fra <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis>, eller <emphasis role="distribution">Experimental</emphasis>. Det er mulig å tildele en prioritet til hver tilgjengelig pakke (samme pakke kan ha flere prioriteringer, avhengig av hvilken versjon eller distribusjon den kommer fra). Disse prioriteringene vil påvirke APTs oppførsel: For hver pakke vil det alltid velge versjonen med høyest prioritet (unntatt hvis denne versjonen er eldre enn den installerte, og hvis prioriteten er mindre enn 1000).

source: <primary>package</primary><secondary>priority</secondary>
nb_no: <primary>pakke</primary><secondary>prioritet</secondary>

source: <primary>priority</primary><secondary>package priority</secondary>
nb_no: <primary>prioritet</primary><secondary>pakkeprioritet</secondary>

source: <primary>APT</primary><secondary>preferences</secondary>
nb_no: <primary>APT</primary><secondary>preferanser</secondary>

source: <primary><filename>preferences</filename></primary>
nb_no: <primary><filename>preferanser</filename></primary>

source: APT defines several default priorities. Each installed package version has a priority of 100. A non-installed version has a priority of 500 by default, but it can jump to 990 if it is part of the target release (defined with the <literal>-t</literal> command-line option or the <literal>APT::Default-Release</literal> configuration directive).
nb_no: APT definerer flere standard prioriteringer. Hver installert pakkeversjon har en prioritet på 100. En ikke-installerte versjon har en prioritet på 500 som standard, men det kan hoppe til 990 hvis det er en del av målrettet utgivelse (definert med <literal>-t</literal> kommandolinjevalg, eller <literal>APT::Default-Release</literal> konfigureringsdirektiv).

source: You can modify the priorities by adding entries in the <filename>/etc/apt/preferences</filename> file with the names of the affected packages, their version, their origin and their new priority.
nb_no: Du kan endre prioriteringer ved å legge til oppføringer i <filename>/etc/apt/preferences</filename>-filen med navnene på de berørte pakker, versjonen, opprinnelsen og den nye prioriteten deres.

source: APT will never install an older version of a package (that is, a package whose version number is lower than the one of the currently installed package) except if its priority is higher than 1000. APT will always install the highest priority package which follows this constraint. If two packages have the same priority, APT installs the newest one (whose version number is the highest). If two packages of same version have the same priority but differ in their content, APT installs the version that is not installed (this rule has been created to cover the case of a package update without the increment of the revision number, which is usually required).
nb_no: APT vil aldri installere en eldre distribusjon av en pakke (som er en pakke med et versjonsnummer som er lavere enn det som den allerede installerte pakken har), unntatt hvis prioriteten dens er over 1000. APT vil alltid installere pakken med høyeste prioritet som følger denne begrensningen. Hvis to pakker har samme prioritet, installerer APT den nyeste (hvis versjonsnummer er høyest). Hvis to pakker av samme versjon har samme prioritet, men varierer i innhold, installerer APT versjonen som ikke er installert (denne regelen har blitt opprettet for å dekke tilfelle av en pakkeoppdatering uten økning av revisjonsnummeret, noe som vanligvis er nødvendig).

source: In more concrete terms, a package whose priority is less than 0 will never be installed. A package with a priority ranging between 0 and 100 will only be installed if no other version of the package is already installed. With a priority between 100 and 500, the package will only be installed if there is no other newer version installed or available in another distribution. A package of priority between 501 and 990 will only be installed if there is no newer version installed or available in the target distribution. With a priority between 990 and 1000, the package will be installed except if the installed version is newer. A priority greater than 1000 will always lead to the installation of the package even if it forces APT to downgrade to an older version.
nb_no: Mer konkret, en pakke som har prioritet mindre enn 0 vil aldri bli installert. En pakke med en prioritet som varierer mellom 0 og 100 vil kun installeres hvis ingen annen versjon av pakken allerede er installert. Med en prioritet mellom 100 og 500, vil pakken bare installeres når det ikke finnes noen annen nyere versjon installert, eller er tilgjengelig i en annen distribusjon. En pakke med prioritet mellom 501 og 990 vil kun installeres hvis det ikke er noen nyere versjon installert eller tilgjengelig i distribusjonen det gjelder. Med en prioritet mellom 990 og 1000, vil pakken bli installert, bortsett fra hvis den installerte versjonen er nyere. En prioritet høyere enn 1000 vil alltid føre til installasjon av pakken, selv om det tvinger APT til å nedgradere til en eldre versjon.

source: When APT checks <filename>/etc/apt/preferences</filename>, it first takes into account the most specific entries (often those specifying the concerned package), then the more generic ones (including for example all the packages of a distribution). If several generic entries exist, the first match is used. The available selection criteria include the package's name and the source providing it. Every package source is identified by the information contained in a <filename>Release</filename> file that APT downloads together with the <filename>Packages</filename> files. It specifies the origin (usually “Debian” for the packages of official mirrors, but it can also be a person's or an organization's name for third-party repositories). It also gives the name of the distribution (usually <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis> for the standard distributions provided by Debian) together with its version (for example 8 for Debian <emphasis role="distribution">Jessie</emphasis>). Let's have a look at its syntax through some realistic case studies of this mechanism.
nb_no: Når APT sjekker <filename>/etc/apt/preferences</filename>, tar den først hensyn til de bestemte oppføringer (ofte de som spesifiserer den aktuelle pakken), deretter de mer generiske (inkludert for eksempel alle pakkene i en distribusjon). Hvis flere generiske oppføringer finnes, brukes det første treffet. De tilgjengelige utvalgskriteriene inkluderer pakkens navn og kilden den kommer fra. Hver pakkekilde identifiseres av informasjonen i <filename>Release</filename>-filen som APT laster ned sammen med <filename>Packages</filename>-filene. Den angir opprinnelsen (vanligvis «Debian» for pakker fra offisielle speil, men det kan også være en persons eller en organisasjons navn for tredjeparts kodelagre). Den gir også navnet på distribusjonen (vanligvis <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis>, eller <emphasis role="distribution">Experimental</emphasis> for standard distribusjoner levert av Debian) sammen med versjonen (for eksempel 8 for Debian <emphasis role="distribution">Jessie</emphasis>). La oss se på syntaksen i noen realistiske casestudier med denne mekanismen.

source: <emphasis>SPECIFIC CASE</emphasis> Priority of <emphasis role="distribution">experimental</emphasis>
nb_no: <emphasis>KONKRET SAK</emphasis> Prioritering av <emphasis role="distribution">experimental</emphasis>

source: If you listed <emphasis role="distribution">Experimental</emphasis> in your <filename>sources.list</filename> file, the corresponding packages will almost never be installed because their default APT priority is 1. This is of course a specific case, designed to keep users from installing <emphasis role="distribution">Experimental</emphasis> packages by mistake. The packages can only be installed by typing <command>aptitude install <replaceable>package</replaceable>/experimental</command> — users typing this command can only be aware of the risks that they take. It is still possible (though <emphasis>not</emphasis> recommended) to treat packages of <emphasis role="distribution">Experimental</emphasis> like those of other distributions by giving them a priority of 500. This is done with a specific entry in <filename>/etc/apt/preferences</filename>:
nb_no: Hvis du listet <emphasis role="distribution">Experimental</emphasis> i din <filename>sources.list</filename>-fil, vil de tilsvarende pakker nesten aldri bli installert fordi prioritert standard APT er 1. Dette er selvfølgelig et eget tilfelle, designet for å holde brukerne fra feilaktig å installere <emphasis role="distribution">Experimental</emphasis>-pakker. Pakkene kan bare bli installert ved å skrive <command>aptitude install <replaceable>pakke</replaceable>/experimental</command> - Brukere som skriver denne kommandoen må bare være klar over risikoene de tar. Det er fremdeles mulig (selv om <emphasis>ikke</emphasis> er anbefalt) å behandle pakker i <emphasis role="distribution">Experimental</emphasis> på samme måte som de i andre distribusjoner ved å gi dem en prioritering på 500. Dette gjøres med en egen oppføring i <filename>/etc/apt/preferences</filename>:

source: Let's suppose that you only want to use packages from the stable version of Debian. Those provided in other versions should not be installed except if explicitly requested. You could write the following entries in the <filename>/etc/apt/preferences</filename> file:
nb_no: La oss anta at du bare vil bruke pakker fra den stabile versjonen av Debian. De som leveres i andre versjoner bør ikke installeres med mindre det eksplisitt blir bedt om det. Du kan skrive inn følgende i <filename>/etc/apt/preferences</filename>-filen:

source: <literal>a=stable</literal> defines the name of the selected distribution. <literal>o=Debian</literal> limits the scope to packages whose origin is “Debian”.
nb_no: <literal>a=stable</literal> definerer navnet på den valgte distribusjonen. <literal>o=Debian</literal> begrenser utvalget til pakker som kommer fra «Debian».

source: Let's now assume that you have a server with several local programs depending on the version 5.14 of Perl and that you want to ensure that upgrades will not install another version of it. You could use this entry:
nb_no: La oss nå anta at du har en tjener med flere lokale programmer som støtter seg på versjon 5.14 av Perl, og at du ønsker å sikre at oppgraderinger ikke vil installere en annen versjon av den. Da kan du skrive inn det følgende:

source: The reference documentation for this configuration file is available in the manual page <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, which you can display with <command>man apt_preferences</command>.
nb_no: Referansedokumentasjonen for denne konfigurasjonsfilen er tilgjengelig på den manuelle siden <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, som du kan vise med <command>man apt_preferences</command>.

source: <emphasis>TIP</emphasis> Comments in <filename>/etc/apt/preferences</filename>
nb_no: <emphasis>TIP</emphasis> Kommentarer i <filename>/etc/apt/preferences</filename>

source: There is no official syntax to put comments in the <filename>/etc/apt/preferences</filename> file, but some textual descriptions can be provided by putting one or more “<literal>Explanation</literal>” fields at the start of each entry:
nb_no: Det er ingen offisiell syntaks for å sette kommentarer i <filename>/etc/apt/preferences</filename>-filen, men enkelte tekstbeskrivelser kan ordnes ved å sette en eller flere «<literal>Explanation</literal>»-felter ved starten av hver oppføring:

source: Working with Several Distributions
nb_no: Å arbeide med flere distribusjoner

source: <command>apt</command> being such a marvelous tool, it is tempting to pick packages coming from other distributions. For example, after having installed a <emphasis role="distribution">Stable</emphasis> system, you might want to try out a software package available in <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> without diverging too much from the system's initial state.
nb_no: Når <command>apt</command> er et så fantastisk verktøy, er det fristende å plukke pakker som kommer fra andre distribusjoner. For eksempel, etter å ha installert et <emphasis role="distribution">Stable</emphasis>-system, ønsker du kanskje å prøve ut en programvarepakke som finnes i <emphasis role="distribution">Testing</emphasis>, eller <emphasis role="distribution">Unstable</emphasis> uten å avvike for mye fra systemets opprinnelige tilstand.

source: Even if you will occasionally encounter problems while mixing packages from different distributions, <command>apt</command> manages such coexistence very well and limits risks very effectively. The best way to proceed is to list all distributions used in <filename>/etc/apt/sources.list</filename> (some people always put the three distributions, but remember that <emphasis role="distribution">Unstable</emphasis> is reserved for experienced users) and to define your reference distribution with the <literal>APT::Default-Release</literal> parameter (see <xref linkend="sect.apt-upgrade" />).
nb_no: Selv om du noen ganger vil støte på problemer mens du mikser pakker fra forskjellige distribusjoner, håndterer <command>apt</command> slik sameksistens veldig godt, og begrenser risiko svært effektivt. Den beste måten for å fortsette er å liste opp alle distribusjoner som brukes i <filename>/etc/apt/sources.list</filename> (noen vil alltid sette inn de tre distribusjonene, men husk at <emphasis role="distribution">Unstable</emphasis> er reservert for erfarne brukere), og for å definere din referansedistribusjon med <literal>APT::Default-Release</literal>-parameter (se <xref linkend="sect.apt-upgrade" />).

source: Let's suppose that <emphasis role="distribution">Stable</emphasis> is your reference distribution but that <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> are also listed in your <filename>sources.list</filename> file. In this case, you can use <command>apt install <replaceable>package</replaceable>/testing</command> to install a package from <emphasis role="distribution">Testing</emphasis>. If the installation fails due to some unsatisfiable dependencies, let it solve those dependencies within <emphasis role="distribution">Testing</emphasis> by adding the <literal>-t testing</literal> parameter. The same obviously applies to <emphasis role="distribution">Unstable</emphasis>.
nb_no: La oss anta at <emphasis role="distribution">Stable</emphasis> er din referansedistribusjon med at <emphasis role="distribution">Testing</emphasis> og <emphasis role="distribution">Unstable</emphasis> også er listet i din <filename>sources.list</filename>-fil. I dette tilfellet kan du bruke <command>apt install <replaceable>pakke</replaceable>/testing</command> til å installere en pakke fra <emphasis role="distribution">Testing</emphasis>. Hvis installasjonen mislykkes på grunn av noen ikke-tilfredsstilte avhengigheter, la den løse disse avhengighetene innenfor <emphasis role="distribution">Testing</emphasis> ved å legge til <literal>-t testing</literal>-parameteret. Det samme gjelder selvsagt <emphasis role="distribution">Unstable</emphasis>.

source: In this situation, upgrades (<command>upgrade</command> and <command>full-upgrade</command>) are done within <emphasis role="distribution">Stable</emphasis> except for packages already upgraded to another distribution: those will follow updates available in the other distributions. We will explain this behavior with the help of the default priorities set by APT below. Do not hesitate to use <command>apt-cache policy</command> (see sidebar <xref linkend="sidebar.apt-cache-policy" />) to verify the given priorities.
nb_no: I denne situasjonen blir oppgraderingene (<command>upgrade</command> og <command>full-upgrade</command>) gjort innenfor <emphasis role="distribution">Stable</emphasis>, bortsett fra for pakker som allerede er oppgradert til en annen distribusjon: De vil følge oppdateringene som er tilgjengelige i andre distribusjoner. Vi forklarer denne virkemåten ved hjelp av standardprioriteringene satt av APT nedenfor. Ikke nøl med å bruke <command>apt-cache policy</command> (se sidefelt <xref linkend="sidebar.apt-cache-policy" />) for å verifisere de gitte prioriteringene.

source: Everything centers around the fact that APT only considers packages of higher or equal version than the installed one (assuming that <filename>/etc/apt/preferences</filename> has not been used to force priorities higher than 1000 for some packages).
nb_no: Alt er basert på det faktum at APT bare vurderer pakker med høyere eller lik versjon enn den installerte (forutsatt at <filename>/etc/apt/preferences</filename> ikke har vært brukt til å tvinge prioriteter høyere enn 1000 for noen pakker).
