Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: In this section, we will focus on upgrading a <emphasis role="distribution">Wheezy</emphasis> system to <emphasis role="distribution">Jessie</emphasis>. This is a major operation on a system; as such, it is never 100% risk-free, and should not be attempted before all important data has been backed up.
nb_no: I denne seksjonen vil vi fokusere på å oppgradere et <emphasis role="distribution">Wheezy</emphasis>-system til <emphasis role="distribution">Jessie</emphasis>. Dette er en stor operasjon på et system; Og som sådan, er det aldri 100 % risikofritt, og bør ikke forsøkes før alle viktige data er sikkerhetskopiert .

source: Another good habit which makes the upgrade easier (and shorter) is to tidy your installed packages and keep only the ones that are really needed. Helpful tools to do that include <command>aptitude</command>, <command>deborphan</command> and <command>debfoster</command> (see <xref linkend="sect.automatic-tracking" />). For example, you can use the following command, and then use <command>aptitude</command>'s interactive mode to double check and fine-tune the scheduled removals:
nb_no: En annen god vane som gjør oppgradering enklere (og kortere), er å rydde dine installerte pakker, og bare beholde dem som virkelig er nødvendige. Nyttige verktøy for å gjøre dette inkluderer <command>aptitude</command>, <command>deborphan</command> og <command>debfoster</command> (se <xref linkend="sect.automatic-tracking" />). For eksempel kan du bruke følgende kommando, og så bruke <command>aptitude</command>s interaktivmodus for å dobbeltsjekke og fininnstille de planlagte fjerningene:

source: Now for the upgrading itself. First, you need to change the <filename>/etc/apt/sources.list</filename> file to tell APT to get its packages from <emphasis role="distribution">Jessie</emphasis> instead of <emphasis role="distribution">Wheezy</emphasis>. If the file only contains references to <emphasis role="distribution">Stable</emphasis> rather than explicit codenames, the change isn't even required, since <emphasis role="distribution">Stable</emphasis> always refers to the latest released version of Debian. In both cases, the database of available packages must be refreshed (with the <command>apt update</command> command or the refresh button in <command>synaptic</command>).
nb_no: Nå for oppgraderingen selv. Først må du endre <filename>/etc/apt/sources.list</filename>-filen for å fortelle APT om å få sine pakker fra <emphasis role="distribution">Jessie</emphasis> i stedet for fra <emphasis role="distribution">Wheezy</emphasis>. Hvis filen bare inneholder referanser til <emphasis role="distribution">Stable</emphasis> snarere enn til eksplisitte kodenavn, er endringen ikke engang nødvendig, siden <emphasis role="distribution">Stable</emphasis> alltid refererer til den nyeste versjonen av Debian. I begge tilfeller må databasen med tilgjengelige pakker friskes opp med <command>apt update</command>-kommandoen, eller med oppdateringsknappen (refresh button) i <command>synaptic</command>).

source: Once these new package sources are registered, you should first do a minimal upgrade with <command>apt upgrade</command>. By doing the upgrade in two steps, we ease the job of the package management tools and often ensure that we have the latest versions of those, which might have accumulated bugfixes and improvements required to complete the full distribution upgrade.
nb_no: Straks disse nye pakkekildene er registrert, bør du først gjøre en liten oppgradering med <command>apt upgrade</command>. Ved å gjøre oppgraderingen i to trinn, lettes jobben for pakkens styringsverktøy, og sikrer ofte at vi har de nyeste versjonene av disse, som kanskje har akkumulert feilrettinger og forbedringer som kreves for å fullføre hele distribusjonsoppgraderingen.

source: Once this first upgrade is done, it is time to handle the upgrade itself, either with <command>apt full-upgrade</command>, <command>aptitude</command>, or <command>synaptic</command>. You should carefully check the suggested actions before applying them: you might want to add suggested packages or deselect packages which are only recommended and known not to be useful. In any case, the front-end should come up with a scenario ending in a coherent and up-to-date <emphasis role="distribution">Jessie</emphasis> system. Then, all you need is to do is wait while the required packages are downloaded, answer the Debconf questions and possibly those about locally modified configuration files, and sit back while APT does its magic.
nb_no: Straks disse nye pakkekildene er registrert, bør du først gjøre en liten oppgradering med <command>apt full-upgrade</command>, <command>aptitude</command>, eller <command>synaptic</command>. Du bør nøye kontrollere de foreslåtte tiltakene før du bruker dem: Du kan ønske å legge til foreslåtte pakker, eller velge bort pakker som kun er anbefalt og kjente for ikke å være nyttige. I alle fall skal brukergrensesnittet komme opp med et scenario som ender i et sammenhengende og up-to-date <emphasis role="distribution">Jessie</emphasis>-system. Deretter er alt du trenger å gjøre er å vente mens de nødvendige pakkene er lastet ned, svare på Debconf-spørsmål, og muligens om lokale endringer i konfigurasjonsfiler, og lene deg tilbake mens APT utfører sin magi.

source: Handling Problems after an Upgrade
nb_no: Å håndtere problemer etter en oppgradering

source: In spite of the Debian maintainers' best efforts, a major system upgrade isn't always as smooth as you could wish. New software versions may be incompatible with previous ones (for instance, their default behavior or their data format may have changed). Also, some bugs may slip through the cracks despite the testing phase which always precedes a Debian release.
nb_no: Til tross for Debian vedlikeholderes beste innsats, går en større oppgradering ikke alltid så glatt som du kan ønske deg. Nye programvareversjoner kan være uforenlig med de foregående (for eksempel kan standardopptredene eller dataformatet deres ha endret seg). Dessuten kan noen bug slippe gjennom nåløyet til tross for testfasen som alltid går foran en Debian-utgivelse.

source: To anticipate some of these problems, you can install the <emphasis role="pkg">apt-listchanges</emphasis> package, which displays information about possible problems at the beginning of a package upgrade. This information is compiled by the package maintainers and put in <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian</filename> files for the benefit of users. Reading these files (possibly through <emphasis role="pkg">apt-listchanges</emphasis>) should help you avoid bad surprises.
nb_no: For å foregripe noen av disse problemene kan du installere <emphasis role="pkg">apt-listchanges</emphasis>-pakken, som viser informasjon om mulige problemer ved begynnelsen av en pakkeoppgradering. Denne informasjonen er utarbeidet av pakkens vedlikeholder, og satt i <filename>/usr/share/doc/<replaceable>pakke</replaceable>/NEWS.Debian</filename>-filer for å gjøre det enklere for brukerne. Å lese disse filene (eventuelt i <emphasis role="pkg">apt-listchanges</emphasis>) bør hjelpe deg å unngå uønskede overraskelser.

source: You might sometimes find that the new version of a software doesn't work at all. This generally happens if the application isn't particularly popular and hasn't been tested enough; a last-minute update can also introduce regressions which are only found after the stable release. In both cases, the first thing to do is to have a look at the bug tracking system at <literal>https://bugs.debian.org/<replaceable>package</replaceable></literal>, and check whether the problem has already been reported. If it hasn't, you should report it yourself with <command>reportbug</command>. If it is already known, the bug report and the associated messages are usually an excellent source of information related to the bug:
nb_no: Du kan noen ganger finne at den nye versjonen av en programvare ikke fungerer i det hele tatt. Dette skjer vanligvis hvis programmet ikke er spesielt populært, og har ikke blitt testet nok: En i siste liten oppdatering kan også innføre regresjoner som bare finnes etter den stabile («stable») utgivelsen. I begge tilfeller er det første å gjøre å se på feilrapportsystemet på <literal>https://bugs.debian.org/<replaceable>pakke</replaceable></literal>, og sjekke om problemet allerede er blitt rapportert. Hvis det ikke er, bør du rapportere det selv med <command>reportbug</command>. Hvis det allerede er kjent, er feilrapporten og de tilhørende meldingene vanligvis en utmerket kilde til informasjon om feilen:

source: sometimes a patch already exists, and it is available on the bug report; you can then recompile a fixed version of the broken package locally (see <xref linkend="sect.rebuilding-package" />);
nb_no: noen ganger finnes en patch (oppdatering) allerede, og den er tilgjengelig på feilrapporten; du kan deretter lokalt rekompilere en forbedret versjon av den ødelagte pakken (se <xref linkend="sect.rebuilding-package" />);

source: in other cases, users may have found a workaround for the problem and shared their insights about it in their replies to the report;
nb_no: i andre tilfeller kan brukere ha funnet en løsning på problemet, og delt sin innsikt om det i sine svar til rapporteringen;

source: in yet other cases, a fixed package may have already been prepared and made public by the maintainer.
nb_no: I atter andre tilfeller, kan en fast pakke ha blitt utarbeidet og offentliggjort av vedlikeholderen.

source: Depending on the severity of the bug, a new version of the package may be prepared specifically for a new revision of the stable release. When this happens, the fixed package is made available in the <literal>proposed-updates</literal> section of the Debian mirrors (see <xref linkend="sect.proposed-updates" />). The corresponding entry can then be temporarily added to the <filename>sources.list</filename> file, and updated packages can be installed with <command>apt</command> or <command>aptitude</command>.
nb_no: Avhengig av hvor alvorlig feilen er, kan en ny versjon av pakken bli forberedt spesielt til en ny revisjon av «stable»-utgivelsen. Når dette skjer, blir den forbedrede pakken gjort tilgjengelig i <literal>proposed-updates</literal>-seksjonen i Debian-speilene (se <xref linkend="sect.proposed-updates" />). Den tilsvarende oppføring kan da midlertidig legges til <filename>sources.list</filename>-filen, og oppdaterte pakker kan installeres med <command>apt</command> eller <command>aptitude</command>.

source: Sometimes the fixed package isn't available in this section yet because it is pending a validation by the Stable Release Managers. You can verify if that's the case on their web page. Packages listed there aren't available yet, but at least you know that the publication process is ongoing. <ulink type="block" url="https://release.debian.org/proposed-updates/stable.html" />
nb_no: Noen ganger er den forbedrede pakken ikke tilgjengelig i denne delen ennå, i påvente av en validering av Stable Release Managers. Du kan kontrollere om det er tilfelle på deres nettside. Pakker oppført der er ikke tilgjengelige ennå, men da vet du i det minste at publikasjonsprosessen pågår. <ulink type="block" url="https://release.debian.org/proposed-updates/stable.html" />

source: Keeping a System Up to Date
nb_no: Å holde systemet oppdatert

source: The Debian distribution is dynamic and changes continually. Most of the changes are in the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> versions, but even <emphasis role="distribution">Stable</emphasis> is updated from time to time, mostly for security-related fixes. Whatever version of Debian a system runs, it is generally a good idea to keep it up to date, so that you can get the benefit of recent evolutions and bug fixes.
nb_no: Debian-distribusjonen er dynamisk og endrer seg kontinuerlig. Mesteparten av endringene er i<emphasis role="distribution">Testing</emphasis> og <emphasis role="distribution">Unstable</emphasis>-versjonene, men selv <emphasis role="distribution">Stable</emphasis> oppdateres fra tid til annen, for det meste med sikkerhetsrelaterte løsninger. Uansett hvilken versjon av Debian som kjører systemet, er det vanligvis en god idé å holde det oppdatert, slik at du får nytte av nyere videreutviklinger og feilrettinger.

source: While it is of course possible to periodically run a tool to check for available updates and run the upgrades, such a repetitive task is tedious, especially when it needs to be performed on several machines. Fortunately, like many repetitive tasks, it can be partly automated, and a set of tools have already been developed to that effect.
nb_no: Det er selvfølgelig mulig å kjøre et verktøy jevnlig for å se etter tilgjengelige oppdateringer og kjøre oppgraderinger. Slike repeterende oppgaver er kjedelige, spesielt når det må utføres på flere maskiner. Heldigvis, som for mange repeterende oppgaver, kan de delvis automatiseres. Et sett med verktøy er allerede utviklet til det formålet.

source: The first of these tools is <command>apticron</command>, in the package of the same name. Its main effect is to run a script daily (via <command>cron</command>). The script updates the list of available packages, and, if some installed packages are not in the latest available version, it sends an email with a list of these packages along with the changes that have been made in the new versions. Obviously, this package mostly targets users of Debian <emphasis role="distribution">Stable</emphasis>, since the daily emails would be very long for the faster paced versions of Debian. When updates are available, <command>apticron</command> automatically downloads them. It does not install them — the administrator will still do it — but having the packages already downloaded and available locally (in APT's cache) makes the job faster.
nb_no: Det første av disse verktøyene er <command>apticron</command>, i pakken med samme navn. Den kjører et skript daglig <command>cron</command>). Skriptet oppdaterer listen over tilgjengelige pakker, og hvis noen installerte pakker ikke er i den nyeste versjonen, sender den en e-post med en liste over disse pakkene sammen med de endringene som er gjort i de nye versjonene. Selvfølgelig er denne pakken hovedsakelig rettet mot brukere av Debian <emphasis role="distribution">Stable</emphasis>, siden de daglige e-postene ville være svært lange for de versjoner av Debian som har et raskere tempo. Når oppdateringer er tilgjengelige, laster <command>apticron</command> dem ned automatisk. De blir ikke installert - for det må administrator fortsatt gjøre - men å ha pakkene allerede nedlastet og tilgjengelig lokalt (i APTs hurtiglager) blir jobben raskere.

source: Administrators in charge of several computers will no doubt appreciate being informed of pending upgrades, but the upgrades themselves are still as tedious as they used to be, which is where the <filename>/etc/cron.daily/apt</filename> script (in the <emphasis role="pkg">apt</emphasis> package) comes in handy. This script is also run daily (and non-interactively) by <command>cron</command>. To control its behavior, use APT configuration variables (which are therefore stored in a file under <filename>/etc/apt/apt.conf.d/</filename>). The main variables are:
nb_no: Administratorer med ansvaret for flere datamaskiner vil uten tvil sette pris på å bli informert om ventende oppgraderinger, men oppgraderingene selv er fortsatt like kjedelige som de pleide å være. Her kommer <filename>/etc/cron.daily/apt</filename>-skriptet (i <emphasis role="pkg">apt</emphasis>-pakken) hendig inn. Dette skriptet kjøres også daglig (og ikke-interaktivt) av <command>cron</command>. For sin egen kontroll bruker APT konfigurasjonsvariabler (som derfor er lagret i en fil under <filename>/etc/apt/apt.conf.d/</filename>). De viktigste variablene er:

source: This option allows you to specify the frequency (in days) at which the package lists are refreshed. <command>apticron</command> users can do without this variable, since <command>apticron</command> already does this task.
nb_no: Dette alternativet lar deg angi frekvensen (i dager) for hvor ofte pakkelistene blir oppdatert. <command>apticron</command>-brukere kan klare seg uten denne variabelen, ettersom <command>apticron</command> allerede utfører denne oppgaven.

source: Again, this option indicates a frequency (in days), this time for the downloading of the actual packages. Again, <command>apticron</command> users won't need it.
nb_no: Igjen, dette alternativet indikereren frekvens (i dager), denne gangen for nedlastingen av selve pakkene. En gang til, <command>apticron</command>-brukere vil ikke trenge dem.

source: This option covers a feature that <command>apticron</command> doesn't have. It controls how often obsolete packages (those not referenced by any distribution anymore) are removed from the APT cache. This keeps the APT cache at a reasonable size and means that you don't need to worry about that task.
nb_no: Dette alternativet omfatter en funksjon som <command>apticron</command> ikke har. Den styrer hvor ofte avleggse pakker (de som ikke er referert til av noen distribusjoner lenger) blir fjernet fra APTs hurtiglager. Dette holder APT hurtiglager på en rimelig størrelse, og betyr at du ikke trenger å bekymre deg for den oppgaven.

source: When this option is enabled, the daily script will execute <command>unattended-upgrade</command> (from the <emphasis role="pkg">unattended-upgrades</emphasis> package) which — as its name suggest — can automatize the upgrade process for some packages (by default it only takes care of security updates, but this can be customized in <filename>/etc/apt/apt.conf.d/50unattended-upgrades</filename>). Note that this option can be set with the help of debconf by running <command>dpkg-reconfigure -plow unattended-upgrades</command>.
nb_no: Med dette valget aktivert, vil det daglige skriptet kjøre <command>unattended-upgrade</command> (fra <emphasis role="pkg">unattended-upgrades</emphasis>-pakken) som - som navnet antyder - kan automatisere oppgraderingsprosessen for noen pakker (som standard tar det bare vare på sikkerhetsoppdateringer, men dette kan tilpasses i <filename>/etc/apt/apt.conf.d/50unattended-upgrades</filename>). Merk at dette valget kan settes ved hjelp av debconf ved å kjøre <command>dpkg-reconfigure -plow unattended-upgrades</command>.

source: Other options can allow you to control the cache cleaning behavior with more precision. They are not listed here, but they are described in the <filename>/etc/cron.daily/apt</filename> script.
nb_no: Andre alternativer kan tillate deg å kontrollere hurtiglagerets oppryddingsatferd med mer presisjon. De er ikke listet her, men er beskrevet i <filename>/etc/cron.daily/apt</filename>-skriptet.

source: These tools work very well for servers, but desktop users generally prefer a more interactive system. That is why the “Debian desktop environment” task installs <emphasis role="pkg">gnome-packagekit</emphasis> (at least when you select GNOME as desktop environment). It provides an icon in the notification area of desktop environments when updates are available; clicking on this icon then runs <command>gpk-update-viewer</command>, a simplified interface to perform updates. You can browse through available updates, read the short description of the relevant packages and the corresponding <filename>changelog</filename> entries, and select whether to apply the update or not on a case-by-case basis.
nb_no: Disse verktøyene fungerer veldig bra på tjenere, men skrivebordsbrukere foretrekker generelt et mer interaktivt system. Det er derfor "Debian desktop environement"s oppgave å installere <emphasis role="pkg">gnome-packagekit</emphasis> (I hvert fall når du velger GNOME som skrivebordsmiljø). Det gir et ikon i varslingsområdet for skrivebordsmiljøer når oppdateringer er tilgjengelige; å klikke på dette ikonet kjører så <command>gpk-update-viewer</command>, et forenklet grensesnitt for å utføre oppdateringer. Du kan bla gjennom tilgjengelige oppdateringer, lese den korte beskrivelsen av de aktuelle pakkene og det overensstemmende <filename>changelog</filename> oppsettet, og fra sak til sak velge om du vil bruke oppdateringen eller ikke.

source: Upgrading with <command>gpk-update-viewer</command>
nb_no: Oppgradering med <command>gpk-update-viewer</command>

source: Automatic Upgrades
nb_no: Automatiske oppgraderinger

source: <primary>upgrade</primary><secondary>automatic system upgrade</secondary>
nb_no: <primary>oppgradere</primary><secondary>automatisk system oppgradere</secondary>

source: <primary>automatic upgrade</primary>
nb_no: <primary>automatisk oppgradering</primary>

source: Since Falcot Corp has many computers but only limited manpower, its administrators try to make upgrades as automatic as possible. The programs in charge of these processes must therefore run with no human intervention.
nb_no: Siden Falcot Corp har mange datamaskiner, men bare begrenset arbeidskraft, prøver administratorene der å gjøre oppgraderinger så automatiske som mulig. Programmene som er ansvarlige for disse prosessene må derfor kjøres uten menneskelig inngripen.

source: Configuring <command>dpkg</command>
nb_no: Konfigurasjon (oppsett) <command>dpkg</command>

source: As we have already mentioned (see sidebar <xref linkend="sidebar.questions-conffiles" />), <command>dpkg</command> can be instructed not to ask for confirmation when replacing a configuration file (with the <literal>--force-confdef --force-confold</literal> options). Interactions can, however, have three other sources: some come from APT itself, some are handled by <command>debconf</command>, and some happen on the command line due to package configuration scripts.
nb_no: Som vi allerede har nevnt kan (se sidefelt <xref linkend="sidebar.questions-conffiles" />), <command>dpkg</command> bli instruert om å ikke be om bekreftelse når du skifter ut en konfigurasjonsfil (med <literal>--force-confdef --force-confold</literal>-valgene). Interaksjoner kan imidlertid komme fra tre andre kilder: Noen fra APT selv, noen er håndtert av <command>debconf</command>, og noen skjer på kommandolinjen som følge av pakkekonfigurasjonsskripter.

source: Configuring APT
nb_no: Å konfigurere APT

source: The case of APT is simple: the <literal>-y</literal> option (or <literal>--assume-yes</literal>) tells APT to consider the answer to all its questions to be “yes”.
nb_no: For APT er enkel: <literal>-y</literal>-valget (eller <literal>--assume-yes</literal>) ber APT å anse svaret på alle dens spørsmål for «yes».

source: Configuring <command>debconf</command>
nb_no: Å konfigurere <command>debconf</command>

source: The case of <command>debconf</command> deserves more details. This program was, from its inception, designed to control the relevance and volume of questions displayed to the user, as well as the way they are shown. That is why its configuration requests a minimal priority for questions; only questions above the minimal priority are displayed. <command>debconf</command> assumes the default answer (defined by the package maintainer) for questions which it decided to skip.
nb_no: Oppgaven <command>debconf</command> fortjener flere detaljer. Dette programmet var, fra begynnelsen av, designet for å styre relevans og antall spørsmål som vises til brukeren, samt måten de vises på. Det er derfor konfigurasjonen knytter liten oppmerksomhet til spørsmål; bare spørsmål med mer enn minimal prioritet blir vist. <command>debconf</command> forutsetter standard svar (definert av pakkeutvikleren ) for spørsmål det er besluttet å hoppe over.
