Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: Maintenance and Updates: The APT Tools
nb_no: Vedlikehold og oppdateringer; ATP-verktøyene

source: What makes Debian so popular with administrators is how easily software can be installed and how easily the whole system can be updated. This unique advantage is largely due to the <emphasis>APT</emphasis> program, that Falcot Corp administrators studied with enthusiasm.
nb_no: Hva som gjør Debian så populært hos administratorer er hvor lett programvaren kan installeres, og hvor lett hele systemet kan oppdateres. Denne unike fordelen er hovedsakelig på grunn av <emphasis>APT</emphasis>-programmet, som Falcot Corp administratorene studerte med entusiasme.

source: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT is the abbreviation for Advanced Package Tool. What makes this program “advanced” is its approach to packages. It doesn't simply evaluate them individually, but it considers them as a whole and produces the best possible combination of packages depending on what is available and compatible (according to dependencies).
nb_no: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT er forkortelse for Advanced Package Tool. Hva som gjør dette programmet «avansert» er tilnærmingen til pakker. Det betyr ikke bare å vurdere dem hver for seg, men det anser dem som en helhet, og gir den best mulige kombinasjon av pakker, avhengig av hva som er tilgjengelig og kompatibelt (ut fra avhengigheter).

source: <emphasis>VOCABULARY</emphasis> Package source and source package
nb_no: <emphasis>ORDLISTE</emphasis> Pakkekilde og kildepakke

source: The word <emphasis>source</emphasis> can be ambiguous. A source package — a package containing the source code of a program — should not be confused with a package source — a repository (website, FTP server, CD-ROM, local directory, etc.) which contains packages.
nb_no: Ordet <emphasis>kilde</emphasis> kan være uklart. En kildepakke - en pakke som inneholder kildekoden til et program - må ikke forveksles med en pakkekilde - en pakkebrønn (nettsted, FTP-server, CD-ROM, lokal katalog, etc.) som inneholder pakker.

source: APT needs to be given a “list of package sources”: the file <filename>/etc/apt/sources.list</filename> will list the different repositories (or “sources”) that publish Debian packages. APT will then import the list of packages published by each of these sources. This operation is achieved by downloading <filename>Packages.xz</filename> or a variant using a different compression method (such as <filename>Packages.gz</filename> or <filename>.bz2</filename>) files (in case of a source of binary packages) and <filename>Sources.xz</filename> or a variant (in case of a source of source packages) and by analyzing their contents. When an old copy of these files is already present, APT can update it by only downloading the differences (see sidebar <xref linkend="sidebar.apt-pdiff" />).
nb_no: APT trenger å bli gitt en «liste over pakkekilder»: filen <filename>/etc/apt/sources.list</filename> vil liste de ulike pakkebrønner (eller «kilder») som publiserer Debian-pakker. APT vil deretter importere listen over pakker utgitt av hver av disse kildene. Denne operasjonen oppnås ved å laste ned <filename>Packages.xz</filename>, eller en variant som bruker en annen pakkemetode (slik som <filename>Packages.gz</filename>, eller <filename>.bz2</filename>)-filer (i tilfelle fra en kilde med binærpakker) og <filename>Sources.xz</filename>, eller en variant (i tilfelle av en kilde med kildepakker), og ved å analysere innholdet. Når en gammel kopi av disse filene allerede er til stede, kan APT oppdatere den ved bare å laste ned forskjellene (se sidestolpe <xref linkend="sidebar.apt-pdiff" />).

source: <emphasis>BACK TO BASICS</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> and <command>XZ</command> Compression
nb_no: <emphasis>TILBAKE TIL BASIS</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> og <command>XZ</command> komprimering

source: A <filename>.gz</filename> extension refers to a file compressed with the <command>gzip</command> utility. <command>gzip</command> is the fast and efficient traditional Unix utility to compress files. Newer tools achieve better rates of compression but require more resources (computation time and memory) to compress and uncompress a file. Among them, and by order of appearance, there are <command>bzip2</command> (generating files with a <filename>.bz2</filename> extension), <command>lzma</command> (generating <filename>.lzma</filename> files) and <command>xz</command> (generating <filename>.xz</filename> files).
nb_no: En <filename>.gz</filename>-utvidelse refererer til en fil komprimert med <command>gzip</command>-verktøyet. <command>gzip</command> er det raske og effektive, tradisjonelle Unix-verktøyet for å komprimere filer. Nyere verktøy oppnår bedre komprimeringshastigheter, men krever mer ressurser (beregning av tid og minne) for å komprimere og dekomprimere en fil. Blant dem, og rekkefølge etter fremtreden, er det <command>bzip2</command> (som genererer filer med en <filename>.bz2</filename>-utvidelse), <command>lzma</command> (genererer <filename>.lzma</filename>-filer) og <command>xz</command> (genererer <filename>.xz</filename>-filer).

source: Filling in the <filename>sources.list</filename> File
nb_no: Å fylle inn <filename>sources.list</filename>-filen

source: <primary>source</primary><secondary>of packages</secondary>
nb_no: <primary>kildekode</primary><secondary>til pakker</secondary>

source: <primary>package</primary><secondary>source of</secondary>
nb_no: <primary>pakke</primary><secondary>kildekode til</secondary>

source: Syntax
nb_no: Syntaks

source: Each active line of the <filename>/etc/apt/sources.list</filename> file contains the description of a source, made of 3 parts separated by spaces.
nb_no: Hver aktiv linje i <filename>/etc/apt/sources.list</filename>-filen inneholder beskrivelsen av en kilde, laget av 3 deler atskilt med mellomrom.

source: The first field indicates the source type:
nb_no: Det første feltet indikerer kildetype:

source: “<literal>deb</literal>” for binary packages,
nb_no: «<literal>deb</literal>» for binærpakker,

source: “<literal>deb-src</literal>” for source packages.
nb_no: «<literal>deb-src</literal>» for kildepakker.

source: The second field gives the base URL of the source (combined with the filenames present in the <filename>Packages.gz</filename> files, it must give a full and valid URL): this can consist in a Debian mirror or in any other package archive set up by a third party. The URL can start with <literal>file://</literal> to indicate a local source installed in the system's file hierarchy, with <literal>http://</literal> to indicate a source accessible from a web server, or with <literal>ftp://</literal> for a source available on an FTP server. The URL can also start with <literal>cdrom:</literal> for CD-ROM/DVD-ROM/Blu-ray disc based installations, although this is less frequent, since network-based installation methods are more and more common.
nb_no: Det andre feltet gir kildens base-URL (kombinert med filnavnene liggende i <filename>Packages.gz</filename>-filene, må det gi en fullstendig og gyldig URL): Dette kan komme fra et Debian-speil, eller fra en annen pakkebrønn satt opp av en tredjepart. Nettadressen kan starte med <literal>file://</literal> for å indikere at en lokal kilde er installert i systemets filhierarki, med <literal>http://</literal> for å indikere at en kilde er tilgjengelig fra en netttjener, eller med<literal>ftp://</literal> for en kilde som er tilgjengelig på en FTP-tjener. URL-en kan også starte med <literal>cdrom:</literal> for CD-ROM/DVD-ROM/Blu-ray-baserte installasjoner fra disk, selv om dette er sjeldnere når nett-baserte installasjoner er mer og mer vanlige.

source: The syntax of the last field depends on the structure of the repository. In the simplest cases, you can simply indicate a subdirectory (with a required trailing slash) of the desired source (this is often a simple “<filename>./</filename>” which refers to the absence of a subdirectory — the packages are then directly at the specified URL). But in the most common case, the repositories will be structured like a Debian mirror, with multiple distributions each having multiple components. In those cases, name the chosen distribution (by its “codename” — see the list in sidebar <xref linkend="sidebar.bruce-perens" /> — or by the corresponding “suites” — <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>), then the components (or sections) to enable (chosen between <literal>main</literal>, <literal>contrib</literal>, and <literal>non-free</literal> in a typical Debian mirror).
nb_no: Syntaksen i det siste feltet avhenger av strukturen i kodelageret. I de enkleste tilfellene kan du bare indikere en undermappe (med en obligatorisk skråstrek) for ønsket kilde (dette er ofte et enkelt «<filename>./</filename>» som refererer til fraværet av en underkatalog — pakkene er så direkte på den angitte URL). Men i de vanligste tilfellene vil kildebrønnene være strukturert som et Debian-speil, med flere distribusjoner som hver har flere komponenter. I de tilfellene, gi navnet på den valgte distribusjonen (ved sitt «kodenavn» - se listen i sidefeltet <xref linkend="sidebar.bruce-perens" /> — eller i de «suites» som svarer til — <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>), så komponentene (eller seksjonene) for å aktivere (valgt mellom <literal>main</literal>, <literal>contrib</literal>, og <literal>non-free</literal> i et typisk Debian-speil).

source: <emphasis>VOCABULARY</emphasis> The <literal>main</literal>, <literal>contrib</literal> and <literal>non-free</literal> archives
nb_no: <emphasis>ORDFORRÅD</emphasis> The <literal>main</literal>, <literal>contrib</literal> og <literal>non-free</literal> arkiv

source: <primary>section</primary><secondary><literal>main</literal></secondary>
nb_no: <primary>seksjonen</primary><secondary><literal>main</literal></secondary>

source: <primary><literal>main</literal>, section</primary>
nb_no: <primary><literal>main</literal>, seksjon</primary>

source: <primary>section</primary><secondary><literal>contrib</literal></secondary>
nb_no: <primary>seksjon</primary><secondary><literal>contrib</literal></secondary>

source: <primary><literal>contrib</literal>, section</primary>
nb_no: <primary><literal>contrib</literal>, seksjon</primary>

source: <primary>section</primary><secondary><literal>non-free</literal></secondary>
nb_no: <primary>seksjon</primary><secondary><literal>non-free</literal></secondary>

source: <primary><literal>non-free</literal>, section</primary>
nb_no: <primary><literal>non-free</literal>, seksjon</primary>

source: <primary>component (of a repository)</primary>
nb_no: <primary>komponent (av et kodelager)</primary>

source: Debian uses three sections to differentiate packages according to the licenses chosen by the authors of each work. <literal>Main</literal> gathers all packages which fully comply with the Debian Free Software Guidelines.
nb_no: Debian bruker tre seksjoner for å differensiere pakker i henhold til lisensene forfatterne har valgt for hvert arbeid <literal>Main</literal> samler alle pakker som fullt ut oppfyller de Debian Free-retningslinjer for programvare.

source: The <literal>non-free</literal> archive is different because it contains software which does not (entirely) conform to these principles but which can nevertheless be distributed without restrictions. This archive, which is not officially part of Debian, is a service for users who could need some of those programs — however Debian always recommends giving priority to free software. The existence of this section represents a considerable problem for Richard M. Stallman and keeps the Free Software Foundation from recommending Debian to users.
nb_no: <literal>non-free</literal>-arkivet er forskjellig fordi det inneholder programvare som ikke (helt) er i samsvar med disse prinsippene, men som likevel kan distribueres uten restriksjoner. Dette arkivet, som ikke offisielt er en del av Debian, er en tjeneste til brukere som kan trenge noen av disse programmene - men Debian anbefaler alltid å prioritere fri programvare. Eksistensen av denne seksjonen representerer et betydelig problem for Richard M. Stallman, og holder Free Software Foundation tilbake fra å anbefale Debian til brukerne.

source: <literal>Contrib</literal> (contributions) is a set of open source software which cannot function without some non-free elements. These elements can be software from the <literal>non-free</literal> section, or non-free files such as game ROMs, BIOS of consoles, etc. <literal>Contrib</literal> also includes free software whose compilation requires proprietary elements. This was initially the case for the OpenOffice.org office suite, which used to require a proprietary Java environment.
nb_no: <literal>Contrib</literal> (bidrag) er et sett programvare med åpen kildekode som ikke kan fungere uten noen ikke-frie elementer. Disse elementene kan være programvare fra <literal>non-free</literal> seksjonen, eller ikke-frie filer slike som i spille-ROMs, konsoll-BIOS, etc. <literal>Contrib</literal> inkluderer også fri programvare der kompileringen krever proprietære elementer. Dette var i utgangspunktet tilfellet for kontorpakken OpenOffice.org, som behøvde et proprietært Java-miljø.

source: <emphasis>TIP</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> files
nb_no: <emphasis>TIPS</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> filer

source: If many package sources are referenced, it can be useful to split them in multiple files. Each part is then stored in <filename>/etc/apt/sources.list.d/<replaceable>filename</replaceable>.list</filename> (see sidebar <xref linkend="sidebar.directory.d" />).
nb_no: Hvis det er vises til mange pakkekilder, kan det være nyttig å dele dem i flere filer. Hver del blir deretter lagret i <filename>/etc/apt/sources.list.d/<replaceable>filnavn</replaceable>.list</filename> (se sidefelt <xref linkend="sidebar.directory.d" />).

source: The <literal>cdrom</literal> entries describe the CD/DVD-ROMs you have. Contrary to other entries, a CD-ROM is not always available since it has to be inserted into the drive and since only one disc can be read at a time. For those reasons, these sources are managed in a slightly different way, and need to be added with the <command>apt-cdrom</command> program, usually executed with the <literal>add</literal> parameter. The latter will then request the disc to be inserted in the drive and will browse its contents looking for <filename>Packages</filename> files. It will use these files to update its database of available packages (this operation is usually done by the <command>apt update</command> command). From then on, APT can require the disc to be inserted if it needs one of its packages.
nb_no: The <literal>cdrom</literal>-innganger beskriver den CD/DVD-ROM du har. I motsetning til andre innganger, er en CD-ROM ikke alltid tilgjengelig fordi den må settes inn i stasjonen, og fordi bare én disk kan leses om gangen. Av disse grunnene brukes disse kildene på en litt annen måte, og <command>apt-cdrom</command>-programmet må legges til, vanligvis utløst med <literal>add</literal>-parameteret. Dette siste vil be om at disken settes inn i stasjonen, og vil bla gjennom innholdet på jakt etter <filename>pakke</filename>-filer. Det vil bruke disse filene til å oppdatere sin database med tilgjengelige pakker (denne operasjonen gjøres vanligvis ved <command>apt update</command>-kommandoen). Fra da av kan APT kreve at disken settes inn om det behov for en av pakkene derfra.

source: Repositories for <emphasis role="distribution">Stable</emphasis> Users
nb_no: Kodelageret for <emphasis role="distribution">Stable</emphasis> brukere

source: Here is a standard <filename>sources.list</filename> for a system running the <emphasis role="distribution">Stable</emphasis> version of Debian:
nb_no: Her er en standard <filename>sources.list</filename> for et system som kjører <emphasis role="distribution">Stable</emphasis> versjonen av Debian:

source: <filename>/etc/apt/sources.list</filename> file for users of Debian Stable
nb_no: <filename>/etc/apt/sources.list</filename>-fil for brukere av Debian Stable

source: This file lists all sources of packages associated with the <emphasis role="distribution">Jessie</emphasis> version of Debian (the current <emphasis role="distribution">Stable</emphasis> as of this writing). We opted to name “jessie” explicitly instead of using the corresponding “stable“ alias (<literal>stable</literal>, <literal>stable-updates</literal>, <literal>stable-backports</literal>) because we don't want to have the underlying distribution changed outside of our control when the next stable release comes out.
nb_no: Denne filen inneholder alle kilder til pakker assosiert med <emphasis role="distribution">Jessie</emphasis>-versjonen av Debian (som i skrivende stund er <emphasis role="distribution">Stable</emphasis>. Vi valgte å nevne «Jessie» eksplisitt istedenfor å bruke det samsvarende «stable» aliaset (<literal>stable</literal>, <literal>stable-updates</literal>, <literal>stable-backports</literal>) fordi vi ikke ønsker å ha den underliggende distribusjonen endret uten vår kontroll når den neste stabile utgaven kommer ut.

source: Most packages will come from the “base repository” which contains all packages but is seldom updated (about once every 2 months for a “point release”). The other repositories are partial (they do not contain all packages) and can host updates (packages with newer version) that APT might install. The following sections will explain the purpose and the rules governing each of those repositories.
nb_no: De fleste pakker vil komme fra «basiskodelagere» som inneholder alle pakkene, men sjelden blir oppdatert (omtrent en gang hver 2. måned for en «point release»). De andre kodelagrene inneholder ikke alle pakkene, og kan være vert for oppdateringer (pakker med en nyere versjon) som APT kan installere. Følgende avsnitt vil forklare hensikten og reglene om hver av disse kodelagrene.

source: Note that when the desired version of a package is available on several repositories, the first one listed in the <filename>sources.list</filename> file will be used. For this reason, non-official sources are usually added at the end of the file.
nb_no: Merk at når den ønskede versjonen av en pakke er tilgjengelig fra flere kodelagre, vil den første oppførte <filename>sources.list</filename>-filen bli benyttet. Av denne grunn blir ikke-offentlige kilder vanligvis lagt til ved slutten av filen.

source: As a side note, most of what this section says about <emphasis role="distribution">Stable</emphasis> applies equally well to <emphasis role="distribution">Oldstable</emphasis> since the latter is just an older <emphasis role="distribution">Stable</emphasis> that is maintained in parallel.
nb_no: Som en sidekommmentar, det meste av hva denne seksjonen sier om <emphasis role="distribution">Stable</emphasis> gjelder like meget <emphasis role="distribution">Oldstable</emphasis>, ettersom den siste bare er en eldre <emphasis role="distribution">Stable</emphasis> som er vedlikeholdt parallelt.

source: Security Updates
nb_no: Sikkerhetsoppdateringer

source: <primary>security updates</primary>
nb_no: <primary>sikkerhetsoppdateringer</primary>

source: <primary>updates</primary><secondary>security updates</secondary>
nb_no: <primary>oppdateringer</primary><secondary>sikkerhetsoppdateringer</secondary>

source: The security updates are not hosted on the usual network of Debian mirrors but on <literal>security.debian.org</literal> (on a small set of machines maintained by the <link linkend="dsa-team">Debian System Administrators</link>). This archive contains security updates (prepared by the Debian Security Team and/or by package maintainers) for the <emphasis role="distribution">Stable</emphasis> distribution.
nb_no: Sikkerhetsoppdateringene ligger ikke i det vanlige Debian nettarkivet, men på <literal>security.debian.org</literal> (på et lite sett med maskiner vedlikeholdt av <link linkend="dsa-team">Debian System Administrators</link>). Dette arkivet inneholder sikkerhetsoppdateringer (utarbeidet av Debian Security Team og/eller av pakkevedlikeholdere) for <emphasis role="distribution">Stable</emphasis>-distribusjonen.

source: The server can also host security updates for <emphasis role="distribution">Testing</emphasis> but this doesn't happen very often since those updates tend to reach <emphasis role="distribution">Testing</emphasis> via the regular flow of updates coming from <emphasis role="distribution">Unstable</emphasis>.
nb_no: Serveren kan også ha sikkerhetsoppdateringer for <emphasis role="distribution">Testing</emphasis>, men det skjer ikke svært ofte siden disse oppdateringer tenderer til å nå <emphasis role="distribution">Testing</emphasis> via den regulære flyten av oppdateringer fra <emphasis role="distribution">Unstable</emphasis>.

source: Stable Updates
nb_no: Stabile oppdateringer

source: <primary>stable updates</primary>
nb_no: <primary>stabile oppdateringer</primary>

source: <primary>updates</primary><secondary>stable updates</secondary>
nb_no: <primary>oppdateringer</primary><secondary>stabile oppdateringer</secondary>

source: Stable updates are not security sensitive but are deemed important enough to be pushed to users before the next stable point release.
nb_no: Stabile oppdateringer er ikke sikkerhetssensitive, men anses viktige nok til å leveres til brukere før neste stabile utgivelse.

source: This repository will typically contain fixes for critical bugs which could not be fixed before release or which have been introduced by subsequent updates. Depending on the urgency, it can also contain updates for packages that have to evolve over time… like <emphasis role="pkg">spamassassin</emphasis>'s spam detection rules, <emphasis role="pkg">clamav</emphasis>'s virus database, or the daylight-saving time rules of all timezones (<emphasis role="pkg">tzdata</emphasis>).
nb_no: Dette pakkearkivet vil normalt inneholde feilrettinger for kritiske feil som ikke kunne bli ordnet før utgivelse, eller som har blitt lagt inn ved påfølgende oppdateringer. Avhengig av om det haster, kan det også inneholde oppdateringer for pakker som må utvikles over tid ... som <emphasis role="pkg">spamassassin</emphasis>s deteksjonsregler for spam, <emphasis role="pkg">clamav</emphasis>s virus database, eller sommertidsregler for alle tidssoner (<emphasis role="pkg">tzdata</emphasis>).

source: In practice, this repository is a subset of the <literal>proposed-updates</literal> repository, carefully selected by the Stable Release Managers.
nb_no: I praksis er denne kodebrønnen en undergruppe av <literal>proposed-updates</literal> kodebrønnen, omhyggelig valgt ut av vedlikeholderne av «Stable»-utgivelsen.

source: Proposed Updates
nb_no: Foreslåtte oppdateringer

source: Once published, the <emphasis role="distribution">Stable</emphasis> distribution is only updated about once every 2 months. The <literal>proposed-updates</literal> repository is where the expected updates are prepared (under the supervision of the Stable Release Managers).
nb_no: Etter utgivelsen blir <emphasis role="distribution">Stable</emphasis>-distributsjonen bare oppdatert en gang hver annen måned. <literal>proposed-updates</literal>-kodelageret er der den forventede oppdateringer forberedes (under tilsyn av «Stable»-utgivelsens vedlikeholdere).
