Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: The other relevant configuration element is the interface used by the front-end. If you choose <literal>noninteractive</literal> out of the choices, all user interaction is disabled. If a package tries to display an informative note, it will be sent to the administrator by email.
nb_no: Det andre relevante konfigurasjonselementet er grensesnittet som brukes av grenseflaten. Hvis du velger <literal>noninteractive</literal> blant valgene, er all brukerinteraksjon deaktivert. Hvis en pakke prøver å vise en informativ merknad, vil den bli sendt til administratoren via e-post.

source: To reconfigure <command>debconf</command>, use the <command>dpkg-reconfigure</command> tool from the <emphasis role="pkg">debconf</emphasis> package; the relevant command is <command>dpkg-reconfigure debconf</command>. Note that the configured values can be temporarily overridden with environment variables when needed (for instance, <varname>DEBIAN_FRONTEND</varname> controls the interface, as documented in the <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry> manual page).
nb_no: For å refigurere <command>debconf</command> bruk <command>dpkg-reconfigure</command>-verktøyet fra <emphasis role="pkg">debconf</emphasis>-pakken; den relevante kommandoen er <command>dpkg-reconfigure debconf</command>. Legg merke til at de konfigurerte verdiene midlertidig kan overstyres av miljøvariabler ved behov (for eksempel <varname>DEBIAN_FRONTEND</varname> kontrollerer brukergrensesnittet, som dokumentert i den manuelle siden <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry>).

source: Handling Command Line Interactions
nb_no: Å håndtere kommandolinjesamhandling

source: The last source of interactions, and the hardest to get rid of, is the configuration scripts run by <command>dpkg</command>. There is unfortunately no standard solution, and no answer is overwhelmingly better than another.
nb_no: Den siste kilden til samhandling, og den vanskeligste å bli kvitt, er konfigurasjonsskriptet som drives av <command>dpkg</command>. Det er dessverre ingen standardløsning, og ingen svar er overveiende bedre enn en annet.

source: The common approach is to suppress the standard input by redirecting the empty content of <filename>/dev/null</filename> into it with <command><replaceable>command</replaceable> &lt;/dev/null</command>, or to feed it with an endless stream of newlines. None of these methods is 100 % reliable, but they generally lead to the default answers being used, since most scripts consider a lack of reply as an acceptance of the default value.
nb_no: Den vanligste metoden er å undertrykke standard inndata ved å omdirigere det tomme innholdet i <filename>/dev/null</filename> til den med <command><replaceable>command</replaceable> &lt;/dev/null</command>, eller å mate den med en endeløs strøm av linjeskift. Ingen av disse metodene er 100 % pålitelige, men de fører vanligvis til at standardsvarene blir brukt, siden de fleste skript vurderer en mangel på svar som å akseptere standardverdien.

source: The Miracle Combination
nb_no: Mirakelkombinasjonen

source: By combining the previous elements, it is possible to design a small but rather reliable script which can handle automatic upgrades.
nb_no: Ved å kombinere de foregående elementene, er det mulig å utforme et lite, men temmelig pålitelig skript som kan håndtere automatiske oppgraderinger.

source: Non-interactive upgrade script
nb_no: Ikke-interaktive oppgraderingsskript

source: <emphasis>IN PRACTICE</emphasis> The Falcot Corp case
nb_no: <emphasis>I PRAKSIS</emphasis> The Falcot Corp case

source: Falcot computers are a heterogeneous system, with machines having various functions. Administrators will therefore pick the most relevant solution for each computer.
nb_no: Falcon datamaskiner er et heterogent system, med maskiner med ulike funksjoner. Administratorer vil derfor velge ut den mest relevante løsningen for hver datamaskin.

source: In practice, the servers running <emphasis role="distribution">Jessie</emphasis> are configured with the “miracle combination” above, and are kept up to date automatically. Only the most critical servers (the firewalls, for instances) are set up with <command>apticron</command>, so that upgrades always happen under the supervision of an administrator.
nb_no: I praksis kjører tjenerne som<emphasis role="distribution">Jessie</emphasis> er konfigurert med «mirakelkombinasjonen» ovenfor, og holdes oppdatert automatisk. Bare de mest kritiske tjenere (brannmurene for eksempel) er satt opp med<command>apticron</command>, slik at oppgraderinger alltid skjer under oppsyn av en administrator.

source: The office workstations in the administrative services also run <emphasis role="distribution">Jessie</emphasis>, but they are equipped with <emphasis role="pkg">gnome-packagekit</emphasis>, so that users trigger the upgrades themselves. The rationale for this decision is that if upgrades happen without an explicit action, the behavior of the computer might change unexpectedly, which could cause confusion for the main users.
nb_no: Kontorets arbeidsstasjoner for de administrative tjenestene kjører også <emphasis role="distribution">Jessie</emphasis>, men de er utstyrt med <emphasis role="pkg">gnome-packagekit</emphasis>, slik at brukerne utløser oppgraderinger selv. Begrunnelsen for denne beslutningen er at hvis oppgraderinger skjer uten en eksplisitt handling, kan oppførselen til datamaskinen endres uventet, noe som kan føre til forvirring for de viktigste brukerne.

source: In the lab, the few computers using <emphasis role="distribution">Testing</emphasis> — to take advantage of the latest software versions — are not upgraded automatically either. Administrators only configure APT to prepare the upgrades but not enact them; when they decide to upgrade (manually), the tedious parts of refreshing package lists and downloading packages will be avoided, and administrators can focus on the really useful part.
nb_no: I laboratoriet, der de få datamaskinene som bruker <emphasis role="distribution">Testing</emphasis> - kan få fordelen med de siste programvareversjonene - er heller ikke oppgradert automatisk. Administratorer konfigurerer bare APT til å forberede oppgraderinger, ikke til å implementere dem. Når de bestemmer seg for å oppgradere (manuelt), vil de kjedelige delene med å oppdatere pakkelister, og med nedlasting av pakker unngås, og administratorer kan fokusere på den virkelig nyttige delen.

source: Searching for Packages
nb_no: Søke etter pakker

source: With the large and ever-growing amount of software in Debian, there emerges a paradox: Debian usually has a tool for most tasks, but that tool can be very difficult to find amongst the myriad other packages. The lack of appropriate ways to search for (and to find) the right tool has long been a problem. Fortunately, this problem has almost entirely been solved.
nb_no: Med den store og stadig voksende mengden av programvare i Debian, fremkommer det et paradoks: Debian har vanligvis et verktøy for de fleste oppgaver, men verktøyet kan være svært vanskelig å finne blant de utallige andre pakkene. Mangelen på egnede måter å søke etter (og finne) riktig verktøy har lenge vært et problem. Heldigvis er dette problemet blitt løst nesten helt.

source: The most trivial search possible is looking up an exact package name. If <command>apt show <replaceable>package</replaceable></command> returns a result, then the package exists. Unfortunately, this requires knowing or even guessing the package name, which isn't always possible.
nb_no: Enklest mulig søk er det nøyaktige navnet for en pakke. Hvis <command>apt show <replaceable>pakke</replaceable></command> returnerer et resultat, da eksisterer pakken. Dessverre krever dette å kunne, eller gjette, navnet på pakken, noe som ikke alltid er mulig.

source: <emphasis>TIP</emphasis> Package naming conventions
nb_no: <emphasis>TIP</emphasis> Konvensjoner for navngiving av pakker

source: Some categories of packages are named according to a conventional naming scheme; knowing the scheme can sometimes allow you to guess exact package names. For instance, for Perl modules, the convention says that a module called <literal>XML::Handler::Composer</literal> upstream should be packaged as <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. The library enabling the use of the <command>gconf</command> system from Python is packaged as <emphasis role="pkg">python-gconf</emphasis>. It is unfortunately not possible to define a fully general naming scheme for all packages, even though package maintainers usually try to follow the choice of the upstream developers.
nb_no: Noen kategorier av pakker navngis i henhold til en konvensjonell navneordning; idet vi vet at ordningen noen ganger kan tillate deg å gjette nøyaktige pakkenavn. For eksempel, for Perl-moduler, sier konvensjonen at en modul kalt <literal>XML::Handler::Composer</literal> oppstrøms skulle bli pakket som <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. Biblioteket som gjør bruken av <command>gconf</command>-systemet fra Python mulig, er pakket som <emphasis role="pkg">python-gconf</emphasis>. Det er dessverre ikke mulig å definere en helt generell ordning for navning av alle pakkene, selv om pakkevedlikeholdere vanligvis prøver å følge oppstrømsvalget til utviklerne.

source: A slightly more successful searching pattern is a plain-text search in package names, but it remains very limited. You can generally find results by searching package descriptions: since each package has a more or less detailed description in addition to its package name, a keyword search in these descriptions will often be useful. <command>apt-cache</command> and <command>axi-cache</command> are the tools of choice for this kind of search; for instance, <command>apt-cache search video</command> will return a list of all packages whose name or description contains the keyword “video”.
nb_no: Et litt mer vellykket søkemønster er et bare tekstsøk (ren tekstsøk) i pakkenavn, men det er fortsatt svært begrenset. Du kan vanligvis finne resultater ved å søke i pakkebeskrivelser: Siden hver pakke har en mer eller mindre detaljert beskrivelse i tillegg til pakkenavnet, vil et søkeord i disse beskrivelsene ofte være nyttig <command>apt-cache</command>, og <command>axi-cache</command> er de valgte verktøyene for denne type søk; for eksempel vil <command>apt-cache search video</command> gi en liste med alle pakker hvis navn eller beskrivelse inneholder nøkkelordet «video».

source: For more complex searches, a more powerful tool such as <command>aptitude</command> is required. <command>aptitude</command> allows you to search according to a logical expression based on the package's meta-data fields. For instance, the following command searches for packages whose name contains <literal>kino</literal>, whose description contains <literal>video</literal> and whose maintainer's name contains <literal>paul</literal>:
nb_no: For mer komplekse søk kreves et kraftigere verktøy, som <command>aptitude</command>. <command>aptitude</command> lar deg søke etter et logisk uttrykk basert på pakkemetadatafelt. For eksempel vil følgende kommando søke etter pakker med navn som inneholder <literal>kino</literal>, der beskrivelsen inneholder <literal>video</literal>, og der vedlikeholderens navn inneholder <literal>paul</literal>:

source: The search only returns one package, <emphasis role="pkg">kino</emphasis>, which satisfies all three criteria.
nb_no: Søket returnerer bare en pakke, <emphasis role="pkg">kino</emphasis>, som tilfredsstiller de tre kriteriene.

source: Even these multi-criteria searches are rather unwieldy, which explains why they are not used as much as they could. A new tagging system has therefore been developed, and it provides a new approach to searching. Packages are given tags that provide a thematical classification along several strands, known as a “facet-based classification”. In the case of <emphasis role="pkg">kino</emphasis> above, the package's tags indicate that Kino is a Gnome-based software that works on video data and whose main purpose is editing.
nb_no: Selv disse multi-kriteriesøkene er ganske uhåndterlige, noe som forklarer hvorfor de ikke brukes så mye som de kunne. Et nytt merkesystem har derfor blitt utviklet, og det gir en ny tilnærming til det å søke. Pakker er gitt koder som gir en tematisk klassifisering langs flere tråder, kjent som en «fasettbasert klassifikasjon». Når det gjelder <emphasis role="pkg">kino</emphasis> ovenfor, tyder pakkenes koder på at Kino er en Gnome-basert programvare, som fungerer på videodata, og har som hovedformål å redigere.

source: Browsing this classification can help you to search for a package which corresponds to known needs; even if it returns a (moderate) number of hits, the rest of the search can be done manually. To do that, you can use the <literal>~G</literal> search pattern in <command>aptitude</command>, but it is probably easier to simply navigate the site where tags are managed: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" />
nb_no: Å søke etter denne klassifiseringen kan hjelpe deg å finne en pakke som tilsvarer kjente behov; selv om det gir et (moderat) antall treff, kan resten av søket gjøres manuelt. For å gjøre det kan du bruke <literal>~G</literal> søkestreng i <command>aptitude</command>, men det er nok trolig lettere å navigere på nettstedet der taggene styres fra: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" />

source: <primary>tag</primary>
nb_no: <primary>tagg</primary>

source: Selecting the <literal>works-with::video</literal> and <literal>use::editing</literal> tags yields a handful of packages, including the <emphasis role="pkg">kino</emphasis> and <emphasis role="pkg">pitivi</emphasis> video editors. This system of classification is bound to be used more and more as time goes on, and package managers will gradually provide efficient search interfaces based on it.
nb_no: Å velge <literal>works-with::video</literal> og <literal>use::editing</literal>-tagger gir en håndfull pakker, inkludert <emphasis role="pkg">kino</emphasis> og <emphasis role="pkg">pitivi</emphasis>-videoredigerere. Dette klassifiseringssystemet er bare bundet til å bli brukt mer og mer som tiden går, og pakkehåndterere vil gradvis levere effektive søkegrensesnitt basert på det.

source: To sum up, the best tool for the job depends on the complexity of the search that you wish to do:
nb_no: For å oppsummere, det beste verktøyet for jobben avhenger av hvor komplekse søk som du ønsker å gjøre:

source: <command>apt-cache</command> only allows searching in package names and descriptions, which is very convenient when looking for a particular package that matches a few target keywords;
nb_no: <command>apt-cache</command> tillater bare søking i pakkenavn og beskrivelser, noe som er veldig praktisk når vi leter etter en bestemt pakke som stemmer med noen få målrettede søkeord;

source: when the search criteria also include relationships between packages or other meta-data such as the name of the maintainer, <command>synaptic</command> will be more useful;
nb_no: når søkekriteriene også omfatter forhold mellom pakker eller andre meta-data, for eksempel navnet på vedlikeholderen, vil <command>synaptic</command> være nyttigere;

source: when a tag-based search is needed, a good tool is <command>packagesearch</command>, a graphical interface dedicated to searching available packages along several criteria (including the names of the files that they contain). For usage on the command-line, <command>axi-cache</command> will fit the bill.
nb_no: når et taggbasert søk er nødvendig, er <command>packagesearch</command> et godt verktøy, et grafisk grensesnitt laget for å søke i tilgjengelige pakker med flere kriterier (inkludert navnene på filene som de inneholder). For bruk på kommandolinjen vil <command>axi-cache</command> være egnet.

source: finally, when the searches involve complex expressions with logic operations, the tool of choice will be <command>aptitude</command>'s search pattern syntax, which is quite powerful despite being somewhat obscure; it works in both the command-line and the interactive modes.
nb_no: til slutt, når søkene har komplekse uttrykk med logiske operasjoner, vil det valgte verktøyet være <command>aptitude</command>s søkemønstersyntaks, som er ganske kraftig til tross for at den er noe uklar; det virker både i kommandolinjen og i interaktiv modus.
