Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: The security and stable updates documented in the former sections are always included in this repository, but there is more too, because package maintainers also have the opportunity to fix important bugs that do not deserve an immediate release.
nb_no: Sikkerheten og stabile oppdateringer som er dokumentert i de foregående avsnittene, er alltid med i dette kodelageret, men det er mer også, fordi pakkens vedlikeholdere har også mulighet til å fikse viktige feil som ikke fortjener å bli gitt ut med en gang.

source: Anyone can use this repository to test those updates before their official publication. The extract below uses the <literal>jessie-proposed-updates</literal> alias which is both more explicit and more consistent since <literal>wheezy-proposed-updates</literal> also exists (for the <emphasis role="distribution">Oldstable</emphasis> updates):
nb_no: Alle kan bruke dette kodelageret for å teste disse oppdateringene før den offentlige publiseringen. Utdraget nedenfor bruker <literal>jessie-proposed-updates</literal>-aliaset som både er mer eksplisitt og mer konsekvent, <literal>wheezy-proposed-updates</literal> er også der (for oppdateringene av <emphasis role="distribution">Oldstable</emphasis>):

source: Stable Backports
nb_no: Stabile tilbakeføringer

source: <primary>updates</primary><secondary>backports</secondary>
nb_no: <primary>oppdateringer</primary><secondary>backports</secondary>

source: The <literal>stable-backports</literal> repository hosts “package backports”. The term refers to a package of some recent software which has been recompiled for an older distribution, generally for <emphasis role="distribution">Stable</emphasis>.
nb_no: <literal>stable-backports</literal>kodelager har «pakketilbakeføringer». Begrepet refererer til en pakke med noen nyere programmer som har blitt kompilert for en eldre distribusjon, vanligvis for <emphasis role="distribution">Stable</emphasis>.

source: When the distribution becomes a little dated, numerous software projects have released new versions that are not integrated into the current <emphasis role="distribution">Stable</emphasis> (which is only modified to address the most critical problems, such as security problems). Since the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> distributions can be more risky, package maintainers sometimes offer recompilations of recent software applications for <emphasis role="distribution">Stable</emphasis>, which has the advantage to limit potential instability to a small number of chosen packages. <ulink type="block" url="http://backports.debian.org" />
nb_no: Når distribusjonen blir litt utdatert, har mange programvareprosjekter lansert nye versjoner som ikke er integrert i den nåværende <emphasis role="distribution">Stable</emphasis> (som bare er modifisert for å løse de mest kritiske problemer, slik som sikkerhetsproblemer). Ettersom <emphasis role="distribution">Testing</emphasis> og <emphasis role="distribution">Unstable</emphasis>-distribusjoner kan være mer risikable, tilbyr pakkevedlikeholderne noen ganger rekompileringer av nyere programmer for<emphasis role="distribution">Stable</emphasis>, som har fordelen å begrense mulig ustabilitet til et lite antall valgte pakker. <ulink type="block" url="http://backports.debian.org" />

source: The <literal>stable-backports</literal> repository is now available on the usual Debian mirrors. But backports for <emphasis role="distribution">Squeeze</emphasis> are still hosted on a dedicated server (<literal>backports.debian.org</literal>), and requires the following <filename>sources.list</filename> entry:
nb_no: <literal>stable-backports</literal> kodelageret er nå tilgjengelig fra de vanlige Debian-speilene. Men tilbakeføringer for <emphasis role="distribution">Squeeze</emphasis> ligger fremdeles på en en egen tjener (<literal>backports.debian.org</literal>), og krever den følgende <filename>sources.list</filename> inngangen:

source: Backports from <literal>stable-backports</literal> are always created from packages available in <emphasis role="distribution">Testing</emphasis>. This ensures that all installed backports will be upgradable to the corresponding stable version once the next stable release of Debian is available.
nb_no: Tilbakeføringer fra <literal>stable-backports</literal> er alltid laget fra pakker som er tilgjengelig i <emphasis role="distribution">Testing</emphasis>. Det sikrer at alle installerte tilbakeføringer kan oppgraderes til den samsvarende stabile versjonen så snart den neste stabile utgivelsen av Debian er tilgjengelig.

source: Even though this repository provides newer versions of packages, APT will not install them unless you give explicit instructions to do so (or unless you have already done so with a former version of the given backport):
nb_no: Selv om dette arkivet gir nyere versjoner av pakker, vil ikke APT installere dem med mindre du gir klare instruksjoner om å gjøre det (eller hvis du ikke allerede har gjort det med en tidligere versjon av den gitte tilbakeføringen):

source: Repositories for <emphasis role="distribution">Testing</emphasis>/<emphasis role="distribution">Unstable</emphasis> Users
nb_no: Kodelager for <emphasis role="distribution">Testing</emphasis>/<emphasis role="distribution">Unstable</emphasis> brukere

source: Here is a standard <filename>sources.list</filename> for a system running the <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> version of Debian:
nb_no: Her er en standard <filename>sources.list</filename> for et system som kjører <emphasis role="distribution">Testing</emphasis>, eller <emphasis role="distribution">Unstable</emphasis>-versjonen av Debian:

source: <filename>/etc/apt/sources.list</filename> file for users of Debian <emphasis role="distribution">Testing</emphasis>/<emphasis role="distribution">Unstable</emphasis>
nb_no: <filename>/etc/apt/sources.list</filename>-fil for brukere av Debian <emphasis role="distribution">Testing</emphasis>/<emphasis role="distribution">Unstable</emphasis>

source: With this <filename>sources.list</filename> file APT will install packages from <emphasis role="distribution">Unstable</emphasis>. If that is not desired, use the <literal>APT::Default-Release</literal> setting (see <xref linkend="sect.apt-upgrade" />) to instruct APT to pick packages from another distribution (most likely <emphasis role="distribution">Testing</emphasis> in this case).
nb_no: Med denne <filename>sources.list</filename> fil vil APT installere pakker fra <emphasis role="distribution">Unstable</emphasis>. Hvis det ikke er ønsket, bruk <literal>APT::Default-Release</literal>-settingen (se <xref linkend="sect.apt-upgrade" />) for å instruere APT til å velge pakker fra en annen distribusjon (mest sannsynlig <emphasis role="distribution">Testing</emphasis> i dette tilfellet).

source: There are good reasons to include all those repositories, even though a single one should be enough. <emphasis role="distribution">Testing</emphasis> users will appreciate the possibility to cherry-pick a fixed package from <emphasis role="distribution">Unstable</emphasis> when the version in <emphasis role="distribution">Testing</emphasis> is affected by an annoying bug. On the opposite, <emphasis role="distribution">Unstable</emphasis> users bitten by unexpected regressions have the possibility to downgrade packages to their (supposedly working) <emphasis role="distribution">Testing</emphasis> version.
nb_no: Det er gode grunner til å inkludere alle disse kodelagrene, selv om en eneste en skulle være nok. <emphasis role="distribution">Testing</emphasis> ville brukere sette pris på muligheten til å velge seg ut en fast pakke fra <emphasis role="distribution">Unstable</emphasis> når versjonen i <emphasis role="distribution">Testing</emphasis> berøres av en irriterende feil. På den andre siden, <emphasis role="distribution">Unstable</emphasis>-brukere som treffer på uventede regresjoner, har muligheten til å nedgradere pakkene til <emphasis role="distribution">Testing</emphasis>-versjonen (som forutsettes å virke).

source: The inclusion of <emphasis role="distribution">Stable</emphasis> is more debatable but it often gives access to some packages which have been removed from the development versions. It also ensures that you get the latest updates for packages which have not been modified since the last stable release.
nb_no: Å inkludere <emphasis role="distribution">Stable</emphasis> er mer diskutabelt, men det ofte gir tilgang til noen pakker som har blitt fjernet i utviklingsversjoner. Det sikrer også at du får de siste oppdateringene for pakker som ikke har blitt endret siden den siste stabile utgaven.

source: The <emphasis role="distribution">Experimental</emphasis> Repository
nb_no: <emphasis role="distribution">Experimental</emphasis> kodelageret

source: The archive of <emphasis role="distribution">Experimental</emphasis> packages is present on all Debian mirrors, and contains packages which are not in the <emphasis role="distribution">Unstable</emphasis> version yet because of their substandard quality — they are often software development versions or pre-versions (alpha, beta, release candidate…). A package can also be sent there after undergoing subsequent changes which can generate problems. The maintainer then tries to uncover them with help from advanced users who can handle important issues. After this first stage, the package is moved into <emphasis role="distribution">Unstable</emphasis>, where it reaches a much larger audience and where it will be tested in much more detail.
nb_no: Arkivet med <emphasis role="distribution">Experimental</emphasis>-pakker er med i alle Debian-speil, og som ikke er med i <emphasis role="distribution">Unstable</emphasis>-versjonen ennå, på grunn av at kvaliteten er dårligere. De er ofte programutviklingsversjoner eller pre-versjoner (alpha, beta, utgivelseskandidater...). En pakke kan også bli sendt dit etter å ha fått endringer som kan generere problemer. Utvikleren prøver deretter å avdekke problemer med hjelp av avanserte brukere som kan håndtere alvorlige problemer. Etter dette første trinnet, blir pakken flyttet til <emphasis role="distribution">Unstable</emphasis>, der den når et mye større publikum, og hvor den vil bli testet i mer detalj.

source: <emphasis role="distribution">Experimental</emphasis> is generally used by users who do not mind breaking their system and then repairing it. This distribution gives the possibility to import a package which a user wants to try or use as the need arises. That is exactly how Debian approaches it, since adding it in APT's <filename>sources.list</filename> file does not lead to the systematic use of its packages. The line to be added is:
nb_no: <emphasis role="distribution">Experimental</emphasis> brukes vanligvis av dem som ikke har noe imot at systemet deres svikter, og deretter må reparere det. Denne distribusjonen gir mulighet til å importere en pakke som en bruker ønsker å prøve eller bruke om behovet oppstår. Det er akkurat Debians tilnærming, når det legges i APTs <filename>sources.list</filename>-fil fører det ikke til den systematiske bruken av akkurat disse pakkene. Linjen som må legges til er:

source: Non-Official Resources: <literal>mentors.debian.net</literal>
nb_no: Uoffisielle ressurser: <literal>mentors.debian.net</literal>

source: There are numerous non-official sources of Debian packages set up by advanced users who have recompiled some software (Ubuntu made this popular with their Personal Package Archive service), by programmers who make their creation available to all, and even by Debian developers who offer pre-versions of their package online.
nb_no: Det er mange ikke-offisielle kilder til Debian-pakker lagt ut av avanserte brukere som har rekompilert noen programmer (Ubuntu gjorde dette populært med sin personlige Package Archive service), laget av programmerere som gjør det de har laget tilgjengelig for alle. Selv Debians utviklere tilbyr pre-versjoner av pakken sin på nettet.

source: The <literal>mentors.debian.net</literal> site is interesting (although it only provides source packages), since it gathers packages created by candidates to the status of official Debian developer or by volunteers who wish to create Debian packages without going through that process of integration. These packages are made available without any guarantee regarding their quality; make sure that you check their origin and integrity and then test them before you consider using them in production.
nb_no: <literal>mentors.debian.net</literal>-området er interessant (selv om det bare gir kildepakkene), fordi det samler pakker opprettet av kandidater til status som offisielle Debian-utviklere, eller av frivillige som ønsker å lage Debian-pakker uten å gå gjennom denne integreringsprosessen. Disse pakkene er gjort tilgjengelige uten kvalitetsgaranti. Sørg for at du sjekker opprinnelsen og integriteten deres, og test dem deretter ut før du vurderer å bruke dem i produksjonen.

source: <emphasis>COMMUNITY</emphasis> The <literal>debian.net</literal> sites
nb_no: <emphasis>SAMFUNNET</emphasis> The <literal>debian.net</literal> sites

source: The <emphasis>debian.net</emphasis> domain is not an official resource of the Debian project. Each Debian developer may use that domain name for their own use. These websites can contain unofficial services (sometimes personal sites) hosted on a machine which does not belong to the project and set up by Debian developers, or even prototypes about to be moved on to <emphasis>debian.org</emphasis>. Two reasons can explain why some of these prototypes remain on <emphasis>debian.net</emphasis>: either no one has made the necessary effort to transform it into an official service (hosted on the <emphasis>debian.org</emphasis> domain, and with a certain guarantee of maintenance), or the service is too controversial to be officialized.
nb_no: <emphasis>debian.net</emphasis>-domenet er ikke en offisiell ressurs i Debian-prosjektet. Hver Debian-utvikler kan bruke dette domenenavnet til eget bruk. Disse nettstedene kan inneholde uoffisielle tjenester (noen ganger personlige nettsteder) som ligger på en maskin som ikke hører til prosjektet, og er satt opp av Debians utviklere, eller til og med prototyper som er i ferd med å bli flyttet til <emphasis>debian.org</emphasis>. To grunner kan forklare hvorfor noen av disse prototypene forblir på <emphasis>debian.net</emphasis>: Fordi enten har ingen gjort det nødvendige arbeidet med å gjøre det til en offisiell tjeneste (lagret på <emphasis>debian.org</emphasis>-domenet, og med en viss garanti for vedlikehold), eller tjenesten er for kontroversiell å bli gjort offisiell.

source: Installing a package means giving root rights to its creator, because they decide on the contents of the initialization scripts which are run under that identity. Official Debian packages are created by volunteers who have been co-opted and reviewed and who can seal their packages so that their origin and integrity can be checked.
nb_no: Å installere en pakke betyr å gi rotrettigheter til den som har laget den, fordi de fastsetter innholdet i initialiseringsskriptet som kjøres under denne identiteten. Offisielle Debian-pakker er laget av frivillige som er valgt inn og vurdert, og kan forsegle sine pakker, slik at opprinnelsen og integriteten kan kontrolleres.

source: In general, be wary of a package whose origin you don't know and which isn't hosted on one of the official Debian servers: evaluate the degree to which you can trust the creator, and check the integrity of the package. <ulink type="block" url="http://mentors.debian.net/" />
nb_no: Generelt, vær skeptisk til en pakke med en opprinnelse du ikke kjenner, og som ikke ligger på en av de offisielle Debian-serverne; vurder i hvilken grad du kan stole på den som har laget den, og sjekk integriteten til pakken. <ulink type="block" url="http://mentors.debian.net/" />

source: <emphasis>GOING FURTHER</emphasis> Old package versions: <literal>snapshot.debian.org</literal>
nb_no: <emphasis>GÅR VIDERE</emphasis> Old package versions: <literal>snapshot.debian.org</literal>

source: The <literal>snapshot.debian.org</literal> service, introduced in April 2010, can be used to “go backwards in time” and to find an old version of a package. It can be used for example to identify which version of a package introduced a regression, and more concretely, to come back to the former version while waiting for the regression fix.
nb_no: Tjenesten <literal>snapshot.debian.org</literal>, introdusert i april 2010, kan brukes til å «gå bakover i tid», og finne en gammel versjon av en pakke. Den kan for eksempel brukes til å identifisere hvilken versjon av en pakke som innførte en regresjon, og mer konkret, å komme tilbake til den tidligere versjonen mens du venter på regresjonfixen.

source: Caching Proxy for Debian Packages
nb_no: Mellomlagringstjener for Debian-pakker

source: <primary>proxy cache</primary>
nb_no: <primary>mellomtjener lager</primary>

source: <primary>cache, proxy</primary>
nb_no: <primary>lager, mellomtjener</primary>

source: When an entire network of machines is configured to use the same remote server to download the same updated packages, any administrator knows that it would be beneficial to have an intermediate proxy acting as a network-local cache (see sidebar <xref linkend="sidebar.cache" />).
nb_no: Når et helt nettverk av maskiner er konfigurert til å bruke samme eksterne server for å laste ned de samme oppdaterte pakker, vet enhver administrator at det vil være fordelaktig å ha en mellomtjener som virker som et nettverks-lokalt hurtiglager (se sidefelt <xref linkend="sidebar.cache" />).

source: You can configure APT to use a "standard" proxy (see <xref linkend="sect.apt-config" /> for the APT side, and <xref linkend="sect.http-ftp-proxy" /> for the proxy side), but the Debian ecosystem offers better options to solve this problem. The dedicated software presented in this section are smarter than a plain proxy cache because they can rely on the specific structure of APT repositories (for instance they know when individual files are obsolete or not, and thus adjust the time during which they are kept).
nb_no: Du kan konfigurere APT til å bruke en «standard» mellomtjener (se <xref linkend="sect.apt-config" /> etter APT-siden, og <xref linkend="sect.http-ftp-proxy" /> etter mellomtjener-siden). Debian økosystem tilbyr imidlertid bedre alternativer for å løse dette problemet. Den egne programvaren som presenteres i dette avsnittet er smartere enn et vanlig mellomtjener hurtiglager fordi de kan stole på den spesifikke strukturen i APTs kodelagre (for eksempel at de vet når enkeltfiler er foreldet eller ikke, og dermed kan justere den tiden de skal beholdes).

source: <emphasis role="pkg">apt-cacher</emphasis> and <emphasis role="pkg">apt-cacher-ng</emphasis> work like usual proxy cache servers. APT's <filename>sources.list</filename> is left unchanged, but APT is configured to use them as proxy for outgoing requests.
nb_no: <emphasis role="pkg">apt-cacher</emphasis> og <emphasis role="pkg">apt-cacher-ng</emphasis> virker som vanlige mellomlager hurtiglager-tjenere. APTs <filename>sources.list</filename> holdes uendret, mens APT konfigureres til å bruke dem som mellomlager for utgående forespørsler.

source: <emphasis role="pkg">approx</emphasis>, on the other hand, acts like an HTTP server that “mirrors” any number of remote repositories in its top-level URLs. The mapping between those top-level directories and the remote URLs of the repositories is stored in <filename>/etc/approx/approx.conf</filename>:
nb_no: <emphasis role="pkg">approx</emphasis>, på den andre siden, fungerer som en HTTP-tjener som «speiler» et ubegrenset antall eksterne kodelagre i sitt øverste nettadresse-nivå. Tilknytningen mellom disse toppnivå-nettlagrene og de eksterne nettadressene til kodelagrene er lagret i <filename>/etc/approx/approx.conf</filename>:

source: <emphasis role="pkg">approx</emphasis> runs by default on port 9999 via inetd (see <xref linkend="sect.inetd" />) and requires the users to adjust their <filename>sources.list</filename> file to point to the approx server:
nb_no: <emphasis role="pkg">approx</emphasis> kjører som standard på port 9999 via inetd (se <xref linkend="sect.inetd" />), og krever at brukerne justerer sine <filename>sources.list</filename>-filer til å peke mot approx-tjeneren:

source: <command>aptitude</command>, <command>apt-get</command>, and <command>apt</command> Commands
nb_no: <command>aptitude</command>, <command>apt-get</command>, og <command>apt</command>-kommandoer

source: APT is a vast project, whose original plans included a graphical interface. It is based on a library which contains the core application, and <command>apt-get</command> is the first front end — command-line based — which was developed within the project. <command>apt</command> is a second command-line based front end provided by APT which overcomes some design mistakes of <command>apt-get</command>.
nb_no: APT er et stort prosjekt, der et grafisk grensesnitt inngår i de opprinnelige planene. Det er basert på et bibliotek med kjernen programmet (the core application), og <command>apt-get</command> er den første grenseflaten - kommandolinjebasert - som ble utviklet i prosjektet. <command>apt</command> er en andre kommandolinjebaserte grenseflate, levert fra APT, som overkommer noen designfeil i <command>apt-get</command>.

source: Numerous other graphical interfaces then appeared as external projects: <command>synaptic</command>, <command>aptitude</command> (which includes both a text mode interface and a graphical one — even if not complete yet), <command>wajig</command>, etc. The most recommended interface, <command>apt</command>, is the one that we will use in the examples given in this section. Note however that <command>apt-get</command> and <command>aptitude</command> have a very similar command line syntax. When there are major differences between <command>apt</command>, <command>apt-get</command> and <command>aptitude</command>, these differences will be detailed.
nb_no: Tallrike andre grafiske grensesnitt dukket opp som eksterne prosjekter: <command>synaptic</command>, <command>aptitude</command> (som inkluderer både et tekstmodus grensesnitt og et grafisk - selv om det ikke er fullført ennå), <command>wajig</command>, etc. Det mest anbefalte grensesnittet, <command>apt</command>, er det vi vil bruke i eksemplene vi gir i denne seksjonen. Noter gjerne at <command>apt-get</command> og <command>aptitude</command> har en veldig lik kommandolinje-syntaks. Når det er store forskjeller mellom <command>apt</command>, <command>apt-get</command> og <command>aptitude</command>, vil disse forskjellene være detaljerte.

source: Initialization
nb_no: Initialisering

source: Installing and Removing
nb_no: Installere og fjerne

source: <primary>package</primary><secondary>installation</secondary>
nb_no: <primary>pakke</primary><secondary>installasjon</secondary>

source: <primary>package</primary><secondary>removal</secondary>
nb_no: <primary>pakke</primary><secondary>fjerne</secondary>

source: <primary>installation</primary><secondary>package installation</secondary>
nb_no: <primary>installasjon</primary><secondary>pakkeinstallasjon</secondary>

source: <primary>removal of a package</primary>
nb_no: <primary>fjerning av en pakke</primary>
