Repository: Debian-VN/debian-handbook
Catalog: */06_apt.po
Languages: nb_no

source: To gain a better understanding of the mechanism of priority, do not hesitate to execute <command>apt-cache policy</command> to display the default priority associated with each package source. You can also use <command>apt-cache policy <replaceable>package</replaceable></command> to display the priorities of all available versions of a given package.
nb_no: For å få en bedre forståelse av prioritetsmekanismen nøl ikke med å kjøre <command>apt-cache policy</command> for å vise standardprioriteten for hver pakkekilde. Du kan også bruke <command>apt-cache policy <replaceable>pakke</replaceable></command> for å vise prioriteringen for alle tilgjengelige versjoner av en gitt pakke.

source: Let's assume that you have installed version 1 of a first package from <emphasis role="distribution">Stable</emphasis> and that version 2 and 3 are available respectively in <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis>. The installed version has a priority of 100 but the version available in <emphasis role="distribution">Stable</emphasis> (the very same) has a priority of 990 (because it is part of the target release). Packages in <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> have a priority of 500 (the default priority of a non-installed version). The winner is thus version 1 with a priority of 990. The package “stays in <emphasis role="distribution">Stable</emphasis>”.
nb_no: La oss anta at du har installert versjon 1 av en første pakke fra <emphasis role="distribution">Stable</emphasis>, og at versjon 2 og 3 respektivt er tilgjengelig i <emphasis role="distribution">Testing</emphasis> og <emphasis role="distribution">Unstable</emphasis>. Den installerte versjonen har en prioritet på 100 mens versjonen som ligger i <emphasis role="distribution">Stable</emphasis> (akkurat den samme) har en prioritet på 990 (fordi den er en del av målet utgivelse (target release)). Pakker i <emphasis role="distribution">Testing</emphasis>, og <emphasis role="distribution">Unstable</emphasis> har en prioritet på 500 (standardprioriteten til en ikke-installert versjon). Vinneren er da versjon 1 med en prioritet på 990. Pakken «står i <emphasis role="distribution">Stable</emphasis>».

source: Let's take the example of another package whose version 2 has been installed from <emphasis role="distribution">Testing</emphasis>. Version 1 is available in <emphasis role="distribution">Stable</emphasis> and version 3 in <emphasis role="distribution">Unstable</emphasis>. Version 1 (of priority 990 — thus lower than 1000) is discarded because it is lower than the installed version. This only leaves version 2 and 3, both of priority 500. Faced with this alternative, APT selects the newest version, the one from <emphasis role="distribution">Unstable</emphasis>.If you don't want a package installed from <emphasis role="distribution">Testing</emphasis> to migrate to <emphasis role="distribution">Unstable</emphasis>, you have to assign a priority lower than 500 (490 for example) to packages coming from <emphasis role="distribution">Unstable</emphasis>. You can modify <filename>/etc/apt/preferences</filename> to this effect:
nb_no: La oss ta et eksempel fra en annen pakke som versjon 2 er installert fra <emphasis role="distribution">Testing</emphasis>. Version 1 er tilgjengelig i <emphasis role="distribution">Stable</emphasis>, og versjon 3 i <emphasis role="distribution">Unstable</emphasis>. Versjon 1 (med prioritet 990 - altså lavere enn 1000) forkastes fordi det er lavere enn den installerte versjonen. Bare versjon 2 og 3 står igjen, begge med prioritet 500. Konfrontert med dette alternativet, velger APT den nyeste versjonen, den ene fra <emphasis role="distribution">Unstable</emphasis>. Hvis du ikke ønsker en pakke installert fra <emphasis role="distribution">Testing</emphasis> til å flytte til <emphasis role="distribution">Unstable</emphasis>, må du tildele en prioritet lavere enn 500 (490 for eksempel) til pakker som kommer fra <emphasis role="distribution">Unstable</emphasis>. Du kan endre <filename>/etc/apt/preferences</filename> med denne effekten:

source: Tracking Automatically Installed Packages
nb_no: Å finne installerte pakker automatisk

source: One of the essential functionalities of <command>apt</command> is the tracking of packages installed only through dependencies. These packages are called “automatic”, and often include libraries for instance.
nb_no: En av de svært viktige funksjonene i <command>apt</command> er sporing av pakker som bare er installert ved avhengigheter. Disse pakkene kalles «automatiske», og inkluderer for eksempel ofte biblioteker.

source: With this information, when packages are removed, the package managers can compute a list of automatic packages that are no longer needed (because there is no “manually installed” packages depending on them). <command>apt-get autoremove</command> will get rid of those packages. <command>aptitude</command> and <command>apt</command> do not have this command: the former because it removes them automatically as soon as they are identified, and the latter probably because the user should not have to manually run such a command. In all cases, the tools display a clear message listing the affected packages.
nb_no: Med denne informasjonen, når pakker er fjernet, kan de pakkeansvarlige lage en liste over automatiske pakker som ikke lenger trengs (fordi det ikke er noen «manuelt installerte» pakker som er avhengig av dem). <command>apt-get autoremove</command> vil kvitte seg med disse pakkene. <command>aptitude</command> og <command>apt</command> har ikke denne kommandoen: Den første fordi den fjerner dem automatisk så snart de er identifisert, og sistnevnte trolig fordi brukeren ikke skal måtte kjøre en slik kommando manuelt. I alle tilfelle, verktøyene viser en klar melding som lister de berørte pakkene.

source: It is a good habit to mark as automatic any package that you don't need directly so that they are automatically removed when they aren't necessary anymore. <command>apt-mark auto <replaceable>package</replaceable></command> will mark the given package as automatic whereas <command>apt-mark manual <replaceable>package</replaceable></command> does the opposite. <command>aptitude markauto</command> and <command>aptitude unmarkauto</command> work in the same way although they offer more features for marking many packages at once (see <xref linkend="sect.aptitude" />). The console-based interactive interface of <command>aptitude</command> also makes it easy to review the “automatic flag” on many packages.
nb_no: Det er en god vane å merke med automatisk, pakker som du ikke trenger direkte, slik at de fjernes automatisk når de ikke er nødvendige lenger. <command>apt-mark auto <replaceable>pakke</replaceable></command> vil merke en gitt pakke som automatisk, mens <command>apt-mark manual <replaceable>pakke</replaceable></command> gjør det motsatte. <command>aptitude markauto</command> og <command>aptitude unmarkauto</command> virker på samme måte selv om de tilbyr flere funksjoner for å merke mange pakker på en gang (se <xref linkend="sect.aptitude" />). Det konsollbaserte brukergrensesnittet til <command>aptitude</command> gjør det også enkelt å gjennomgå det «automatiske flagget» hos mange pakker.

source: People might want to know why an automatically installed package is present on the system. To get this information from the command line, you can use <command>aptitude why <replaceable>package</replaceable></command> (<command>apt</command> and <command>apt-get</command> have no similar feature):
nb_no: Folk vil kanskje vite hvorfor en automatisk installert pakke er til stede på systemet. For å få denne informasjonen fra kommandolinjen kan du bruke <command>aptitude why <replaceable>pakke</replaceable></command> (<command>apt</command> og <command>apt-get</command> har ingen tilsvarende funksjon):

source: <emphasis>ALTERNATIVE</emphasis> <command>deborphan</command> and <command>debfoster</command>
nb_no: <emphasis>ALTERNATIV</emphasis> <command>deborphan</command> og <command>debfoster</command>

source: In days where <command>apt</command>, <command>apt-get</command> and <command>aptitude</command> were not able to track automatic packages, there were two utilities producing lists of unnecessary packages: <command>deborphan</command> and <command>debfoster</command>.
nb_no: Da det ikke var mulig for <command>apt</command>, <command>apt-get</command> og <command>aptitude</command> å spore automatiske pakker, var det to verktøy som produserte lister over unødvendige pakker: <command>deborphan</command> og <command>debfoster</command>.

source: <command>deborphan</command> is the most rudimentary of both. It simply scans the <literal>libs</literal> and <literal>oldlibs</literal> sections (in the absence of supplementary instructions) looking for the packages that are currently installed and that no other package depends on. The resulting list can then serve as a basis to remove unneeded packages.
nb_no: <command>deborphan</command> er det mest elementære av begge. Den skanner rett og slett <literal>libs</literal> og <literal>oldlibs</literal>-seksjonene (i fravær av tilleggsveiledninger) på jakt etter installerte pakker som ingen andre pakke er avhengig av. Den resulterende listen kan da tjene som grunnlag for å fjerne unødvendige pakker.

source: <command>debfoster</command> has a more elaborate approach, very similar to APT's one: it maintains a list of packages that have been explicitly installed, and remembers what packages are really required between each invocation. If new packages appear on the system and if <command>debfoster</command> doesn't know them as required packages, they will be shown on the screen together with a list of their dependencies. The program then offers a choice: remove the package (possibly together with those that depend on it), mark it as explicitly required, or ignore it temporarily.
nb_no: <command>debfoster</command> har en mer forseggjort tilnærming, svært lik APTs: Den opprettholder en liste med pakker som helt eksplisitt er installert, og husker hvilke pakker som er virkelig nødvendig mellom hvert kall. Hvis nye pakker vises på systemet, og hvis <command>debfoster</command> ikke kjenner dem som nødvendige pakker, vil de bli vist på skjermen sammen med en liste over avhengighetene sine. Programmet tilbyr deretter et valg: Fjern pakken (eventuelt sammen med dem som er avhengige av den), merk den som eksplisitt nødvendig, eller ignorer den midlertidig.

source: The <command>apt-cache</command> Command
nb_no: Kommandoen <command>apt-cache</command>

source: <primary>APT</primary><secondary>package search</secondary>
nb_no: <primary>APT</primary><secondary>pakkesøk</secondary>

source: <primary>APT</primary><secondary>header display</secondary>
nb_no: <primary>APT</primary><secondary>vise overskrifter</secondary>

source: <primary>search of packages</primary>
nb_no: <primary>søke etter pakker</primary>

source: <primary>package</primary><secondary>search</secondary>
nb_no: <primary>pakke</primary><secondary>søke</secondary>

source: The <command>apt-cache</command> command can display much of the information stored in APT's internal database. This information is a sort of cache since it is gathered from the different sources listed in the <filename>sources.list</filename> file. This happens during the <command>apt update</command> operation.
nb_no: <command>apt-cache</command>-kommandoen kan vise mye av den informasjonen som er lagret i APTs interne database. Denne informasjonen er en slags buffer siden den er samlet inn fra ulike kilder oppført i<filename>sources.list</filename>-filen. Dette skjer under <command>apt update</command>-operasjonen.

source: <emphasis>VOCABULARY</emphasis> Cache
nb_no: <emphasis>ORDFORRÅD</emphasis> Cache

source: A cache is a temporary storage system used to speed up frequent data access when the usual access method is expensive (performance-wise). This concept can be applied in numerous situations and at different scales, from the core of microprocessors up to high-end storage systems.
nb_no: Et hurtiglager er en midlertidig lagringsplass som brukes til å øke hastigheten ved hyppig datatilgang når den vanlige tilgangsmetoden er dyr (ytelsesmessig). Dette konseptet kan brukes i en rekke situasjoner og i ulik skala, fra kjernen med mikroprosessorer opp til avanserte lagringssystemer.

source: In the case of APT, the reference <filename>Packages</filename> files are those located on Debian mirrors. That said, it would be very ineffective to go through the network for every search that we might want to do in the database of available packages. That is why APT stores a copy of those files (in <filename>/var/lib/apt/lists/</filename>) and searches are done within those local files. Similarly, <filename>/var/cache/apt/archives/</filename> contains a cache of already downloaded packages to avoid downloading them again if you need to reinstall them after a removal.
nb_no: Når det gjelder APT, er referansefilene <filename>Packages</filename> de som ligger på Debian-speilene. Når det er sagt, ville det være svært ineffektivt å gå gjennom nettverket for hvert søk som vi kanskje ønsker å gjøre i databasen med tilgjengelige pakker. Det er derfor APT lagrer en kopi av disse filene (i <filename>/var/lib/apt/lists/</filename>), og søkene gjøres i disse lokale filene. På samme måte inneholder <filename>/var/cache/apt/archives/</filename> et hurtiglager for allerede nedlastede pakker for å unngå å laste dem ned på nytt, hvis du må installere dem igjen etter en fjerning.

source: The <command>apt-cache</command> command can do keyword-based package searches with <command>apt-cache search <replaceable>keyword</replaceable></command>. It can also display the headers of the package's available versions with <command>apt-cache show <replaceable>package</replaceable></command>. This command provides the package's description, its dependencies, the name of its maintainer, etc. Note that <command>apt search</command>, <command>apt show</command>, <command>aptitude search</command>, <command>aptitude show</command> work in the same way.
nb_no: <command>apt-cache</command>-kommandoen kan gjøre søkeordbaserte pakkesøk med <command>apt-cache search <replaceable>keyword</replaceable></command>. Den kan også vise topptekstene til tilgjengelige pakkeversjoner med <command>apt-cache show <replaceable>pakke</replaceable></command>. Denne kommandoen gir pakkens beskrivelse, avhengigheter, navnet på dens vedlikehold, etc. Merk at <command>apt search</command>, <command>apt show</command>, <command>aptitude search</command>, <command>aptitude show</command> virker på samme måte.

source: <emphasis>ALTERNATIVE</emphasis> <command>axi-cache</command>
nb_no: <emphasis>ALTERNATIV</emphasis> <command>axi-cache</command>

source: <command>apt-cache search</command> is a very rudimentary tool, basically implementing <command>grep</command> on package's descriptions. It often returns too many results or none at all when you include too many keywords.
nb_no: <command>apt-cache search</command> er et meget elementært verktøy, som egentlig implementerer <command>grep</command> til pakkens beskrivelser. Den returnerer ofte for mange resultater, eller ingen i det hele tatt når du har for mange søkeord.

source: <command>axi-cache search <replaceable>term</replaceable></command>, on the other hand, provides better results, sorted by relevancy. It uses the <emphasis>Xapian</emphasis> search engine and is part of the <emphasis role="pkg">apt-xapian-index</emphasis> package whichs indexes all package information (and more, like the <filename>.desktop</filename> files from all Debian packages). It knows about tags (see sidebar <xref linkend="sidebar.debtags" />) and returns results in a matter of milliseconds.
nb_no: <command>axi-cache search <replaceable>begrep</replaceable></command>, på den annen side, gir bedre resultater, sortert etter relevans. Den bruker <emphasis>Xapian</emphasis> søkemotor og en del av <emphasis role="pkg">apt-xapian-index</emphasis>-pakken som indekserer all pakkeinformasjon (og mer, som <filename>.desktop</filename>-filer fra alle Debian pakkene). Den kjenner til tagger (se sidefelt <xref linkend="sidebar.debtags" />), og resultatene kommer på millisekunder.

source: Some features are more rarely used. For instance, <command>apt-cache policy</command> displays the priorities of package sources as well as those of individual packages. Another example is <command>apt-cache dumpavail</command> which displays the headers of all available versions of all packages. <command>apt-cache pkgnames</command> displays the list of all the packages which appear at least once in the cache.
nb_no: Enkelte funksjoner brukes mer sjelden. For eksempel viser <command>apt-cache policy</command> prioriteringene av pakkekilder så vel som de individuelle pakkene. Et annet eksempel er <command>apt-cache dumpavail</command> som viser topptekstene til alle tilgjengelige versjoner av alle pakker. <command>apt-cache pkgnames</command> viser listen over alle de pakkene som vises minst én gang i hurtiglageret.

source: Frontends: <command>aptitude</command>, <command>synaptic</command>
nb_no: Brukergrensesnitt (Frontends): <command>aptitude</command>, <command>synaptic</command>

source: <primary>APT</primary><secondary>interfaces</secondary>
nb_no: <primary>APT</primary><secondary>grensesnitt</secondary>

source: APT is a C++ program whose code mainly resides in the <command>libapt-pkg</command> shared library. Using a shared library facilitates the creation of user interfaces (front-ends), since the code contained in the library can easily be reused. Historically, <command>apt-get</command> was only designed as a test front-end for <command>libapt-pkg</command> but its success tends to obscure this fact.
nb_no: APT er et C++-program med koden hovedsakelig liggende i det delte <command>libapt-pkg</command>-biblioteket. Å bruke et delt bibliotek gjør det mulig å lage brukergrensesnitt (front-end), ettersom koden som finnes i biblioteket lett kan gjenbrukes. Historisk ble <command>apt-get</command> bare laget som en test til et brukergrensesnitt for <command>libapt-pkg</command>, men suksessen tenderer til å overskygge dette faktum.

source: <command>aptitude</command> is an interactive program that can be used in semi-graphical mode on the console. You can browse the list of installed and available packages, look up all the available information, and select packages to install or remove. The program is designed specifically to be used by administrators, so that its default behaviors are much more intelligent than <command>apt-get</command>'s, and its interface much easier to understand.
nb_no: <command>aptitude</command> er et interaktivt program som kan brukes i semi-grafisk modus i konsollen. Du kan bla gjennom listen over installerte og tilgjengelige pakker, finne all tilgjengelig informasjon, og velge pakker til å installere eller fjerne. Programmet er spesielt utviklet for å brukes av administratorer, slik at standard atferd er mye mer intelligent enn <command>apt-get</command>, og dens grensesnitt mye lettere å forstå.

source: The <command>aptitude</command> package manager
nb_no: The <command>aptitude</command> pakkebehandleren

source: <emphasis>DOCUMENTATION</emphasis> <command>aptitude</command>
nb_no: <emphasis>DOCUMENTASJON</emphasis> <command>aptitude</command>

source: This section does not cover the finer details of using <command>aptitude</command>, it rather focuses on giving you a survival kit to use it. <command>aptitude</command> is rather well documented and we advise you to use its complete manual available in the <emphasis role="pkg">aptitude-doc-en</emphasis> package (see <filename>/usr/share/doc/aptitude/html/en/index.html</filename>).
nb_no: Denne delen dekker ikke de finere detaljene ved å bruke <command>aptitude</command>. Den har heller fokus på å gi deg en overlevelsespakke som bruker. <command>aptitude</command> er ganske godt dokumentert, og vi anbefaler deg å bruke den komplette manualen som ligger i <emphasis role="pkg">aptitude-doc-en</emphasis>-pakken (se <filename>/usr/share/doc/aptitude/html/en/index.html</filename>).

source: To search for a package, you can type <keycombo><keycap>/</keycap></keycombo> followed by a search pattern. This pattern matches the name of the package, but can also be applied to the description (if preceded by <literal>~d</literal>), to the section (with <literal>~s</literal>) or to other characteristics detailed in the documentation. The same patterns can filter the list of displayed packages: type the <keycombo><keycap>l</keycap></keycombo> key (as in <foreignphrase>limit</foreignphrase>) and enter the pattern.
nb_no: For å søke etter en pakke kan du skrive <keycombo><keycap>/</keycap></keycombo> etterfulgt av en søkestreng. Denne strengen stemmer med navnet på pakken, men kan også brukes til beskrivelsen (dersom den innledes med <literal>~d</literal>), til seksjonen (med <literal>~s</literal>), eller til andre karakteristika beskrevet i dokumentasjonen. De samme strengene kan filtrere listen over viste pakker: skriv <keycombo><keycap>l</keycap></keycombo>-nøkkelen (som i <foreignphrase>limit</foreignphrase>), og kjør strengen.

source: Managing the “automatic flag” of Debian packages (see <xref linkend="sect.automatic-tracking" />) is a breeze with <command>aptitude</command>. It is possible to browse the list of installed packages and mark packages as automatic with <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo> or to remove the mark with the <keycombo><keycap>m</keycap></keycombo> key. “Automatic packages” are displayed with an “A” in the list of packages. This feature also offers a simple way to visualize the packages in use on a machine, without all the libraries and dependencies that you don't really care about. The related pattern that can be used with <keycombo><keycap>l</keycap></keycombo> (to activate the filter mode) is <literal>~i!~M</literal>. It specifies that you only want to see installed packages (<literal>~i</literal>) not marked as automatic (<literal>!~M</literal>).
nb_no: Å håndtere «automatiske flagg» i Debian-pakker (se <xref linkend="sect.automatic-tracking" />) er en lek med <command>aptitude</command>. Det er mulig å søke i listen av installerte pakker, og merke installerte pakker som automatiske med <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>, eller gjerne merket med <keycombo><keycap>m</keycap></keycombo>-nøkkelen. «Automatske pakker» vises med en «A» i listen med pakker. Denne funksjonen gir også en enkel måte å vise pakkene i bruk på en maskin, uten alle bibliotekene og avhengigheter som du ikke egentlig bryr seg om. Den relaterte strengen som kan brukes sammen med <keycombo><keycap>l</keycap></keycombo> (for å aktivere filtermoduset) er <literal>~i!~M</literal>. Det spesifiserer at du bare ønsker å se installerte pakker (<literal>~i</literal>) som ikke er merket som automatiske (<literal>!~M</literal>).

source: <emphasis>TOOL</emphasis> Using <command>aptitude</command> on the command-line interface
nb_no: <emphasis>TOOL</emphasis> Å bruke <command>aptitude</command> i brukergrensesnittet for kommandolinjer
