Repository: Debian-VN/debian-handbook
Catalog: */07_solving-problems.po
Languages: nb_no, vi_vn

source: This utility requires a web server. This is why you should choose to install this package on one of your servers: all users of the local network could benefit from this service (including non-Linux machines), and this will allow you not to set up an HTTP server on each workstation. If your server is also accessible from other networks, it may be desirable to restrict access to this service only to users of the local network.
nb_no: Dette verktøyet krever en nettjener. Dette er grunnen til at du bør velge å installere denne pakken på en av tjenerne: Alle brukere av det lokale nettverket kan ha nytte av denne tjenesten (inkludert ikke-Linux-maskiner), og dette vil tillate deg å unngå å sette opp en HTTP-server på hver arbeidsstasjon. Hvis tjeneren også er tilgjengelig fra andre nettverk, kan det være ønskelig å begrense tilgangen til denne tjenesten til brukere i det lokale nettverket.
vi_vn: Tiện ích này buộc phải có một máy phục vụ web. Đây là lý do tại sao bạn nên chọn cài đặt một gói phần mềm trên một trong các máy phục vụ của bạn: tất cả các người sử dụng của mạng nội bộ có thể có lợi được từ dịch vụ này (bao gồm cả các máy tính không phải Linux), và điều này sẽ cho phép bạn không cần cài đặt một máy phục vụ HTTP trên mỗi máy trạm. Nếu máy phục vụ của bạn có thể truy cập được từ các mạng khác, bạn có thể muốn giới hạn truy cập đến dịch vụ này với những người sử dụng của mạng nội bộ.

source: <emphasis>DEBIAN POLICY</emphasis> Required man pages
nb_no: <emphasis>DEBIAN POLICY</emphasis> Nødvendige manualsider
vi_vn: <emphasis>CHÍNH SÁCH DEBIAN</emphasis> Các trang hướng dẫn sử dụng cần thiết

source: Debian requires each program to have a manual page. If the upstream author does not provide one, the Debian package maintainer will usually write a minimal page that will at the very least direct the reader to the location of the original documentation.
nb_no: Debian krever at hvert program må ha en manuell side. Hvis oppstrømsforfatteren ikke gir en, vil Debians pakkevedlikeholder vanligvis skrive en liten side som i det minste henviser leseren til plasseringen av den opprinnelige dokumentasjonen.
vi_vn: Debian buộc mỗi chương trình phải có một trang hướng dẫn sử dụng. Nếu tác giả thượng nguồn không cung cấp nó, nhà bảo trì gói phần mềm Debian sẽ thông thường viết một trang hướng dẫn tối thiểu vốn sẽ ít nhất dẫn người đọc đến nơi của tài liệu hướng dẫn nguyên gốc.

source: <emphasis>info</emphasis> Documents
nb_no: <emphasis>info</emphasis>-dokumenter
vi_vn: Các tài liệu <emphasis>info</emphasis>

source: The GNU project has written manuals for most of its programs in the <emphasis>info</emphasis> format; this is why many manual pages refer to the corresponding <emphasis>info</emphasis> documentation. This format offers some advantages, but the default program to view these documents (it is called <command>info</command>) is also slightly more complex. You would be well advised to use <command>pinfo</command> instead (from the <emphasis role="pkg">pinfo</emphasis> package).
nb_no: GNU-prosjektet har skrevet håndbøker for de fleste av sine programmer i <emphasis>info</emphasis>-format: Det er grunnen til at mange manuelle sider refererer til tilsvarende <emphasis>info</emphasis>-dokumentasjon. Dette formatet gir noen fordeler, men standardprogrammet for å vise disse dokumentene (det kalles <command>info</command>) er også litt mer komplisert. Det ville være lurt å bruke <command>pinfo</command> i stedet (fra <emphasis role="pkg">pinfo</emphasis>-pakken).
vi_vn: Dự án GNU đã viết các tài liệu hướng dẫn cho đa số chương trình của nó dưới định dạng <emphasis>info</emphasis>; đó là lý do nhiều trang hướng dẫn sử dụng chỉ đến các tài liệu hướng dẫn <emphasis>info</emphasis>. Định dạng này có một vài ưu điểm, nhưng chương trình ngầm định để xem các tài liệu này (nó được gọi là <command>info</command>) thì có một chút phức tạp hơn. Thay vào đó, bạn được khuyên hãy sử dụng <command>pinfo</command> (từ gói phần mềm <emphasis role="pkg">pinfo</emphasis>).

source: The <emphasis>info</emphasis> documentation has a hierarchical structure, and if you invoke <command>pinfo</command> without parameters, it will display a list of the nodes available at the first level. Usually, nodes bear the name of the corresponding commands.
nb_no: <emphasis>info</emphasis>-dokumentasjonen har en hierarkisk struktur, og hvis du vil benytte <command>pinfo</command> uten parametre, vil den vise en liste over nodene som er tilgjengelig på første nivå. Vanligvis bærer noder navnet på de tilsvarende kommandoer.
vi_vn: Tài liệu hướng dẫn <emphasis>info</emphasis> có một cấu trúc tầng lớp, và nếu bạn chạy <command>pinfo</command> mà không có tham số, nó sẽ hiển thị một danh sách các nút có sẵn ở tầng đầu tiên. Thông thường, các nút mang tên của các lệnh tương ứng.

source: With <command>pinfo</command> navigating between these nodes is easy to achieve with the arrow keys. Alternatively, you could also use a graphical browser, which is a lot more user-friendly. Again, <command>konqueror</command> and <command>yelp</command> work; the <command>info2www</command> also provides a web interface. <ulink type="block" url="http://localhost/cgi-bin/info2www" />
nb_no: Å navigere <command>pinfo</command> mellom disse nodene er lett å få til med piltastene. Alternativt kan du også bruke en grafisk nettleser, som er mye mer brukervennlig. En gang til, <command>konqueror</command> pg <command>yelp</command> virker; <command>info2www</command> gir også et nettgrensesnitt. <ulink type="block" url="http://localhost/cgi-bin/info2www" />
vi_vn: Với <command>pinfo</command> việc di chuyển giữa các nút này là dễ thực hiện được với các phím mũi tên. Ngoài ra, bạn cũng có thể sử dụng một trình duyệt đồ họa, vốn thân thiện với người sử dụng hơn rất nhiều. Một lần nữa, <command>konqueror</command> và <command>yelp</command> đều hoạt động tốt; <command>info2www</command> cũng cung cấp một giao diện web. <ulink type="block" url="http://localhost/cgi-bin/info2www" />

source: Note that the <emphasis>info</emphasis> system is not suitable for translation, unlike the <command>man</command> page system. <emphasis>info</emphasis> documents are thus almost always in English. However, when you ask the <command>pinfo</command> program to display a non-existing <emphasis>info</emphasis> page, it will fall back on the <emphasis>man</emphasis> page by the same name (if it exists), which might be translated.
nb_no: Merk at <emphasis>info</emphasis>-systemet passer ikke for å bli oversatt, til forskjell fra <command>man</command>-sidesystemet. <emphasis>info</emphasis>-dokumenter er dermed nesten alltid på engelsk. Men når du spør <command>pinfo</command>-programmet om å vise en ikke-eksisterende <emphasis>info</emphasis>-side, vil den gå tilbake til <emphasis>man</emphasis>-siden med samme navn (hvis den eksisterer), som kan bli oversatt.
vi_vn: Ghi chú rằng hệ thống <emphasis>info</emphasis> không phù hợp cho việc phiên dịch, không giống như hệ thống trang <command>man</command>. Các tài liệu <emphasis>info</emphasis> vì thế luôn ở dưới dạng tiếng Anh. Tuy nhiên, nếu bạn yêu cầu chương trình <command>pinfo</command> hiển thị một trang <emphasis>info</emphasis> không có tồn tại, nó sẽ lui về trang <emphasis>man</emphasis> có cùng tên (nếu nó tồn tại), vốn có thể phiên dịch được.

source: Specific Documentation
nb_no: Spesifikk dokumentasjon
vi_vn: Tài liệu hướng dẫn cụ thể

source: Each package includes its own documentation. Even the least well documented programs generally have a <filename>README</filename> file containing some interesting and/or important information. This documentation is installed in the <filename>/usr/share/doc/<replaceable>package</replaceable>/</filename> directory (where <replaceable>package</replaceable> represents the name of the package). If the documentation is particularly large, it may not be included in the program's main package, but might be offloaded to a dedicated package which is usually named <literal><replaceable>package</replaceable>-doc</literal>. The main package generally recommends the documentation package so that you can easily find it.
nb_no: Hver pakke inneholder sin egen dokumentasjon. Selv de minst godt dokumenterte programmene har vanligvis en <filename>README</filename>-fil som inneholder noe interessant og/eller viktig informasjon. Denne dokumentasjonen er installert i <filename>/usr/share/doc/<replaceable>pakke</replaceable>/</filename>-mappen (der <replaceable>pakke</replaceable> representerer navnet på pakken). Hvis dokumentasjonen er særlig stor, kan den ikke legges inn programmets hovedpakke, men kan legges i en egen pakke som vanligvis har navnet <literal><replaceable>pakke</replaceable>-doc</literal>. Hovedpakken anbefaler generelt denne dokumentasjonspakken, slik at den er enkel å finne.
vi_vn: Mỗi gói phần mềm bao gồm tài liệu hướng dẫn của chính nó. Thậm chí các chương trình được hướng dẫn ít chi tiết nhất nhìn chung có một tập tin <filename>README</filename> chứa một vài thông tin thú vị và/hoặc quan trọng. Tài liệu này được cài đặt vào thư mục <filename>/usr/share/doc/<replaceable>gói-phần-mềm</replaceable>/</filename> (trong đó <replaceable>gói-phần-mềm</replaceable> đại diện cho tên của gói phần mềm). Nếu tài liệu hướng dẫn cực kỳ lớn, nó có thể không được đính kèm trong gói phần mềm chính của chương trình đó, nhưng có thể được giảm tải sang một gói phần mềm chỉ dành cho nó vốn thường được đặt tên <literal><replaceable>gói-phần-mềm</replaceable>-doc</literal>. Gói phần mềm chính thường để cử một gói phần mềm hướng dẫn sử dụng để bạn có thể dễ dàng tìm thấy nó.

source: The <filename>/usr/share/doc/<replaceable>package</replaceable>/</filename> directory also contains some files provided by Debian which complete the documentation by specifying the package's particularities or improvements compared to a traditional installation of the software. The <filename>README.Debian</filename> file also indicates all of the adaptations that were made to comply with the Debian Policy. The <filename>changelog.Debian.gz</filename> file allows the user to follow the modifications made to the package over time: it is very useful to try to understand what has changed between two installed versions that do not have the same behavior. Finally, there is sometimes a <filename>NEWS.Debian.gz</filename> file which documents the major changes in the program that may directly concern the administrator.
nb_no: <filename>/usr/share/doc/<replaceable>pakke</replaceable>/</filename>-mappen inneholder også noen filer fra Debian som kompletterer dokumentasjon ved å angi pakkenes særegenheter eller forbedringer sammenlignet med en tradisjonell installasjon av programvaren.<filename>README.Debian</filename>-filen indikerer også alle de tilpasninger som er gjort i samsvar med Debians policy. <filename>changelog.Debian.gz</filename>-filen tillater brukeren å følge endringene som er gjort i pakken over tid: Det er svært nyttig å prøve å forstå hva som har endret seg mellom to installerte versjoner som ikke opptrer likt. Endelig er det noen ganger <filename>NEWS.Debian.gz</filename>-filen som dokumenterer større endringer i programmet som direkte kan angå administratorene.
vi_vn: Thư mục <filename>/usr/share/doc/<replaceable>gói-phần-mềm</replaceable>/</filename> cũng chứa một vài tập tin cung cấp bởi Debian vốn hoàn thiện tài liệu hướng dẫn bằng cách chỉ ra những điểm lạ thường của gói phần mềm hoặc các cải tiến so với bản cài đặt bình thường của phần mềm. Tập tin <filename>README.Debian</filename> cũng chỉ ra tất cả các thay đổi để thích ứng đã được tạo ra để tuân thủ chính sách Debian. Tập tin <filename>changelog.Debian.gz</filename> cho phép người sử dụng theo dõi các thay đổi xảy ra với gói phần mềm theo thời gian: điều đó rất tiện cho những ai cố gắng hiểu điều gì đã xảy ra giữa hai phiên bản đã được cài đặt mà không có cùng một hành vi giống nhau. Cuối cùng, thỉnh thoảng cũng có một tập tin <filename>NEWS.Debian.gz</filename> vốn ghi lại những thay đổi chính thức với chương trình vốn có thể làm cho quản trị viên lo ngại.

source: Websites
nb_no: Nettsider
vi_vn: Các trang thông tin điện tử (Website)

source: In most cases, free software programs have websites that are used to distribute it and to bring together the community of its developers and users. These sites are frequently loaded with relevant information in various forms: official documentation, FAQ (Frequently Asked Questions), mailing list archives, etc. Problems that you may encounter have often already been the subject of many questions; the FAQ or mailing list archives may have a solution for it. A good mastery of search engines will prove immensely valuable to find relevant pages quickly (by restricting the search to the Internet domain or sub-domain dedicated to the program). If the search returns too many pages or if the results do not match what you seek, you can add the keyword <userinput>debian</userinput> to limit results and target relevant information.
nb_no: I de fleste tilfellene har gratis programvare nettsteder som brukes til å distribuere den, og bringe sammen fellesskapet av utviklere og brukere. Disse nettstedene er ofte fylt med relevant informasjon i ulike former: Offisiell dokumentasjon, FAQ (Frequently Asked Questions), postlister, etc. Problemer du kan møte har gjerne vært gjenstand for mange spørsmål allerede, og FAQ, eller listearkivet, kan ha en løsning for det. Et godt grep på søkemotorer vil vise seg svært verdifullt når en trenger relevante sider raskt (ved å begrense søket til et Internett-domene, eller underdomene øremerket for programmet). Hvis søket returnerer for mange sider, eller hvis resultatene ikke samsvarer med hva du søker, kan du legge til søkeordet <userinput>debian</userinput > for å begrense resultatene, og målrette til relevant informasjon.
vi_vn: Trong đa số các trường hợp, các chương trình phần mềm nguồn mở có các trang thông tin điện tử vốn được sử dụng để phân phối các phần mềm đó và để tạo một cộng đồng cho những nhà phát triển và những người sử dụng. Những trang này thường chứa những thông tin liên quan trọng dưới các hình thức khác nhau: tài liệu hướng dẫn chính thức, FAQ (Các câu hỏi thường gặp - Frequently Asked Questions), các kho lưu trữ bó thư điện tử, vâng vâng. Các vấn đề bạn có thể gặp thường đã là chủ đề của nhiều câu hỏi trước đây; FAQ hoặc các kho lưu trữ bó thư điện tử thường có một giải pháp cho nó. Làm chủ các bộ máy tìm kiếm sẽ trở nên vô cùng giá trị trong việc tìm kiếm các trang thông tin liên quan một cách nhanh chóng (bằng việc giới hạn tìm kiếm xuống những miền Internet hoặc các miền phụ chỉ dành cho chương trình đó). Nếu tìm kiếm trả về quá nhiều trang hoặc nếu các kết quả không khớp với cái bạn tìm kiếm, bạn có thể thêm từ khóa <userinput>debian</userinput> để giới hạn các kết quả và nhắm đến các thông tin có liên quan hơn.

source: <emphasis>TIPS</emphasis> From error to solution
nb_no: <emphasis>TIPS</emphasis> Fra feil til løsning
vi_vn: <emphasis>MẸO</emphasis> Từ sự cố đến giải pháp

source: If the software returns a very specific error message, enter it into the search engine (between double quotes, <literal>"</literal>, in order to search not for individual keywords, but for the complete phrase). In most cases, the first links returned will contain the answer that you need.
nb_no: Hvis programvaren returnerer en helt spesifikk feilmelding, skriver du det inn i søkemotoren (mellom doble anførselstegn,<literal>"</literal>, for ikke å søke etter individuelle søkeord, men for hele uttrykket). I de fleste tilfellene vil de første returnerte linkene inneholde svaret som du trenger.
vi_vn: Nếu phần mềm trả về một thông điệp lỗi rất cụ thể, hãy nhập nó vào bộ máy tìm kiếm (giữa các dấu nháy đôi, <literal>"</literal>, để tìm kiếm không chỉ từng từ khóa, mà cả cụm từ khóa). Trong đa số các trường hợp, những kết quả đầu tiên sẽ chứa câu trả lời mà bạn cần.

source: In other cases, you will get very general errors, such as “Permission denied”. In this case, it is best to check the permissions of the elements involved (files, user ID, groups, etc.).
nb_no: I andre tilfeller vil du få svært generelle feil, for eksempel «Permission denied» (Tillatelse avslått). I dette tilfellet er det best å sjekke tillatelsene til elementene som er involvert (filer, bruker-ID, grupper, etc.).
vi_vn: Trong các trường hợp khác, bạn có nhận được các lỗi rất chung chung, như là “Permission denied(Không được phép)”. Trong trường hợp này, tốt nhất hãy kiểm tra các quyền cho phép của những thành phần có liên quan (các tập tin, ID người sử dụng, các nhóm, vâng vâng).

source: If you do not know the address for the software's website, there are various means of getting it. First, check if there is a <literal>Homepage</literal> field in the package's meta-information (<command>apt-cache show <replaceable>package</replaceable></command>). Alternately, the package description may contain a link to the program's official website. If no URL is indicated, look at <filename>/usr/share/doc/<replaceable>package</replaceable>/copyright</filename>. The Debian maintainer generally indicates in this file where they got the program's source code, and this is likely to be the website that you need to find. If at this stage your search is still unfruitful, consult a free software directory, such as FSF's Free Software Directory, or search directly with a search engine, such as Google, DuckDuckGo, Yahoo, etc. <ulink type="block" url="https://directory.fsf.org/wiki/Main_Page" />
nb_no: Hvis du ikke vet adressen for programvarens hjemmeside, er det ulike måter å få det på. Først, sjekk om det er et <literal>Homepage</literal>-felt i pakkens metainformasjon (<command>apt-cache show <replaceable>pakke</replaceable></command>). Alternativt kan pakkebeskrivelsen ha med en link til programmets offisielle hjemmeside. Hvis ingen URL er angitt, se på <filename>/usr/share/doc/<replaceable>pakke</replaceable>/copyright</filename>. I denne filen indikerer vanligvis Debians vedlikeholdere hvor de fikk programmets kildekode, og dette er trolig det nettstedet du trenger å finne. Hvis det på dette stadiet i søket ikke har gitt resultater, ta kontakt med en gratis programvarekatalog, for eksempel FSFs Free Software Directory, eller søk direkte med en søkemotor, for eksempel Google, DuckDuckGo, Yahoo, etc. <ulink type="block" url="https://directory.fsf.org/wiki/Main_Page" />
vi_vn: Nếu bạn không biết địa chỉ của trang web của phần mềm đó, có vài cách để tìm thấy nó. Đầu tiên, kiểm tra xem có một trường <literal>Homepage</literal> trong thông tin phụ về gói phần mềm đó hay không (<command>apt-cache show <replaceable>gói-phần-mềm</replaceable></command>). Ngoài ra, bản mô tả của gói phần mềm có thể chứa một đường dẫn tới trang thông tin điện tử chính thức của chương trình. Nếu không có đường dẫn nào được tìm thấy, hãy nhìn vào <filename>/usr/share/doc/<replaceable>gói-phần-mềm</replaceable>/copyright</filename>. Nhà bảo trì Debian thông thường sẽ chỉ ra trong tập tin này từ đâu họ có được mã nguồn, và đó có thể là trang web bạn cần tìm. Nếu tại bước này tìm kiếm của bạn vẫn chưa có kết quả, hãy tham khảo danh bạ phần mềm tự do, như là Danh bạ Phần mềm Tự do của FSF, hoặc tìm kiếm trực tiếp với một bộ máy tìm kiếm, như là Google, DuckDuckGo, Yahoo, vâng vâng. <ulink type="block" url="https://directory.fsf.org/wiki/Main_Page" />

source: You might also want to check the Debian wiki, a collaborative website where anybody, even simple visitors, can make suggestions directly from their browsers. It is used equally by developers who design and specify their projects, and by users who share their knowledge by writing documents collaboratively. <ulink type="block" url="http://wiki.debian.org/" />
nb_no: Du ønsker kanskje også å sjekke Debian Wiki, et samarbeidsnettsted der hvem som helst, selv vanlige besøkende kan komme med forslag direkte via sine nettlesere. Det er like mye brukt av utviklere som designer og spesifiserer sine prosjekter, og av brukere som deler sin kunnskap ved å skrive dokumenter sammen. <ulink type="block" url="http://wiki.debian.org/" />
vi_vn: Bạn có thể muốn nhìn qua bách khoa toàn thư Debian, một trang web cho phép làm việc với nhau nơi mà bất cứ ai, thậm chí những vị khách, có thể đóng góp gợi ý trực tiếp từ trình duyệt của họ. Nó được sử dụng như nhau bởi các nhà phát triển thiết kế và soạn thảo chi tiết kỹ thuật cho các dự án của họ, và bởi những người sử dụng chia sẻ kiến thức của họ bằng việc phối hợp soạn thảo các tài liệu hướng dẫn. <ulink type="block" url="http://wiki.debian.org/" />

source: Tutorials (<emphasis>HOWTO</emphasis>)
nb_no: Veiledninger(<emphasis>HOWTO</emphasis>)
vi_vn: Hướng dẫn từng bước (<emphasis>HOWTO</emphasis>)

source: A howto is a document that describes, in concrete terms and step by step, “how to” reach a predefined goal. The covered goals are relatively varied, but often technical in nature: for example, setting up IP Masquerading, configuring software RAID, installing a Samba server, etc. These documents often attempt to cover all of the potential problems likely to occur during the implementation of a given technology.
nb_no: En «howto» er et dokument som beskriver, konkret og trinnvis, «hvordan» nå et forhåndsdefinert mål. Målene den dekker er relativt variert, men ofte av teknisk karakter, for eksempel sette opp IP-maskering, konfigurering av programvare-RAID, installere en Samba-server, etc. Disse dokumentene forsøker ofte å dekke alle sannsynlige problemer som kan oppstå under implementeringen av en gitt teknologi.
vi_vn: Một howto là một tài liệu mô tả, sử dụng các cụm từ dễ hiểu và từng bước một, “làm sao“ để đạt được một mục tiêu cho trước. Các mục tiêu được đề cập tương đối đa dạng, nhưng thông thường mang nặng tính kĩ thuật: ví dụ, cài đặt IP Masquerading, cấu hình RAID phần mềm, cài đặt một máy phục vụ Samba, vâng vâng. Những tài liệu này thường cố gắng bao phủ hết tất cả các vấn đề có thể xảy ra trong suốt quá trình hiện thực hóa một công nghệ cho trước.

source: Many such tutorials are managed by the Linux Documentation Project (LDP), whose website hosts all of these documents: <ulink type="block" url="http://www.tldp.org/" />
nb_no: Mange slike veiledere styres av Linux Documentation Project (LDP), hvis nettside har alle disse dokumentene: <ulink type="block" url="http://www.tldp.org/" />
vi_vn: Rất nhiều hướng dẫn từng bước như vậy được quản lý bởi Dự án Tài liệu Hướng dẫn Linux (Linux Documentation Project (LDP)). Trang thông tin điện tử của họ chứa tất cả những tài liệu này: <ulink type="block" url="http://www.tldp.org/" />
