Repository: Debian-VN/debian-handbook
Catalog: */07_solving-problems.po
Languages: nb_no, vi_vn

source: Documentation
nb_no: Dokumentasjon
vi_vn: Tài liệu hướng dẫn

source: Solving problems
nb_no: Problemløsing
vi_vn: Giải quyết các vấn đề

source: Log files
nb_no: Loggfiler
vi_vn: Các tập tin nhật ký

source: Solving Problems and Finding Relevant Information
nb_no: Å løse problemer og finne relevant informasjon
vi_vn: Giải quyết các vấn đề và Tìm kiếm các Thông tin Liên quan

source: For an administrator, the most important skill is to be able to cope with any situation, known or unknown. This chapter gives a number of methods that will — hopefully — allow you to isolate the cause of any problem that you will encounter, so that you may be able to resolve them.
nb_no: For en administrator er den viktigste ferdigheten å kunne takle enhver situasjon, kjent eller ukjent. Dette kapitlet gir en rekke metoder som – forhåpentligvis – vil gjøre det mulig å isolere årsaken til eventuelle problemer du møter på, slik at du kan være i stand til å løse dem.
vi_vn: Đối với một quản trị viên, kĩ năng quan trọng nhất là khả năng đối kháng được với bất kỳ tình huống nào, dù có là tình huống đã trải qua hay chưa. Chương này trình bày nhiều phương thức sẽ — hi vọng rằng — cho phép bạn cách ly được nguồn gốc của bất cứ vấn đề nào bạn gặp phải, để bạn có thể giải quyết nó.

source: Documentation Sources
nb_no: Dokumentasjonskilder
vi_vn: Các nguồn tài liệu

source: <primary>documentation</primary>
nb_no: <primary>dokumentasjon</primary>
vi_vn: <primary>Tài liệu hướng dẫn</primary>

source: Before you can understand what is really going on when there is a problem, you need to know the theoretical role played by each program involved in the problem. To do this, the best reflex to have is consult their documentation; but since these documentations are many and can be scattered far and wide, you should know all the places where they can be found.
nb_no: Før du kan forstå hva som egentlig skjer når det er et problem, må du vite den teoretiske rolle for hvert program som er involvert i problemet. For å gjøre dette er den beste refleksen å konsultere deres dokumentasjon; men siden det er mye dokumentasjon som kan være spredt vidt og bredt, bør du vite alle stedene der den kan finnes.
vi_vn: Trước khi bạn có thể hiểu chuyện gì đang xảy ra khi có sự cố, bạn cần phải biết vai trò trên lý thuyết của từng chương trình tham gia vào sự cố. Để làm điều này, để có phản xạ tốt nhất, đọc kĩ tài liệu hướng dẫn; nhưng vì những tài liệu này là rất nhiều và có thể bị phân tán rải rác, bạn nên biết hết những nơi có thể tìm thấy chúng.

source: Manual Pages
nb_no: Manuelle sider
vi_vn: Các trang hướng dẫn sử dụng

source: <primary>manual pages</primary>
nb_no: <primary>manuelle side</primary>
vi_vn: <primary>các trang hướng dẫn sử dụng</primary>

source: <emphasis>CULTURE</emphasis> <acronym>RTFM</acronym>
nb_no: <emphasis>KULTUR</emphasis> <acronym>RTFM</acronym>
vi_vn: <emphasis>VĂN HÓA</emphasis> <acronym>HÃY ĐỌC TÀI LIỆU ĐI (RTFM)</acronym>

source: This acronym stands for “Read the F***ing Manual”, but can also be expanded in a friendlier variant, “Read the Fine Manual”. This phrase is sometimes used in (terse) responses to questions from newbies. It is rather abrupt, and betrays a certain annoyance at a question asked by someone who has not even bothered to read the documentation. Some say that this classic response is better than no response at all (since it indicates that the documentation contains the information sought), or than a more verbose and angry answer.
nb_no: Denne forkortelsen står for «Les den f***ede manualen», men kan også utvides til en vennligere variant, «Les den fine manualen». Dette uttrykket brukes noen ganger i (korte/konsise) svar på spørsmål fra nybegynnere. Det er ganske bryskt, og røper en viss irritasjon på et spørsmål stilt av noen som ikke engang har brydd seg om å lese dokumentasjonen. Noen sier at dette klassiske svaret er bedre enn ingen respons i det hele tatt (siden det indikerer at dokumentasjonen inneholder den ettersøkte informasjonen), heller enn et mer utførlig og sint svar.
vi_vn: Từ viết tắt này đại diện cho cụm từ “Hãy đọc tài liệu đi (Read the F***ing Manual)”, nhưng cũng có thể mở rộng ra thành một phiên bản thân thiện hơn, “Xin Hãy Đọc Tài liệu Kĩ Càng hơn(Read the Fine Manual)”. Cụm từ này thỉnh thoảng được sử dụng trong các câu trả lời (ngắn gọn) cho các câu hỏi của những người mới bắt đầu. Nó khá là ngắn, và thể hiện một cảm giác phiền phức với một câu hỏi được hỏi bởi một người không chịu để tâm đến việc đọc tài liệu hướng dẫn. Một số nói rằng câu trả lời kinh điển này tốt hơn là không có câu trả lời nào (bởi nó cho thấy rằng tài liệu hướng dẫn có chứa thông tin cần tìm), hoặc tốt hơn một câu trả lời dài dòng và đầy sự giận dữ.

source: In any case, if someone responds “RTFM” to you, it is often wise not to take offense. Since this answer may be perceived as vexing, you might want to try and avoid receiving it. If the information that you need is not in the manual, which can happen, you might want to say so, preferably in your initial question. You should also describe the various steps that you have personally taken to find information before you raised a question on a forum. Following Eric Raymond's guidelines is a good way to avoid the most common mistakes and get useful answers. <ulink type="block" url="http://catb.org/~esr/faqs/smart-questions.html" />
nb_no: I alle fall, hvis noen svarer «RTFM» til deg, er det ofte lurt å ikke bli fornærmet. Siden dette svaret kan oppfattes som irriterende, kan du ønske å unngå å motta det. Hvis informasjonen du trenger ikke er i manualen, noe som kan skje, kan det være lurt å si det, fortrinnsvis i det opprinnelige spørsmålet. Du bør også beskrive de ulike trinnene som du personlig har gjennomført for å finne informasjon før du reiser et spørsmål i et forum. Å følge Eric Raymonds retningslinjer er en god måte å unngå de vanligste feilene, og få nyttige svar. <ulink type="block" url="http://catb.org/~esr/faqs/smart-questions.html" />
vi_vn: Trong bất cứ trường hợp nào, nếu một người nào đó trả lời “RTFM” với bạn, sẽ tốt hơn nếu bạn đừng coi đó là xúc phạm. Bởi câu trả lời này thường bị xem là dễ gây ra sự tức giận, bạn có thể muốn cố gắng tránh nhận câu trả lời này. Nếu thông tin bạn cần không có trong hướng dẫn sử dụng, vốn có thể xảy ra, bạn có thể muốn nói ra điều đó, và thực sự nên làm điều đó trong câu hỏi đầu tiên của bạn. Bạn cũng nên mô tả các bước bạn đã một mình thử để tìm thông tin trước khi bạn đưa ra một câu hỏi trên một diễn đàn. Tuân thủ theo các hướng dẫn của Eric Raymon là một cách tốt để tránh các sai lầm thường gặp phải và nhận được các câu trả lời hữu dụng. <ulink type="block" url="http://catb.org/~esr/faqs/smart-questions.html" />

source: Manual pages, while relatively terse in style, contain a great deal of essential information. We will quickly go over the command for viewing them. Simply type <command>man <replaceable>manual-page</replaceable></command> — the manual page usually goes by the same name as the command whose documentation is sought. For example, to learn about the possible options for the <command>cp</command> command, you would type the <command>man cp</command> command at the shell prompt (see sidebar <xref linkend="sidebar.shell" />).
nb_no: Manuelle sider inneholder, samtidig som stilen er relativt konsis, mye viktig informasjon. Vi vil raskt gå over kommandoen for å vise dem. Bare skriv inn <command>man <replaceable>manual-page</replaceable></command> - den manuelle siden har som regel samme navn som den kommandoen man søker dokumentasjon om. For eksempel, for å lære om mulige alternativer for kommandoen <command>cp</command> må du skrive <command>man cp</command>-kommandoen i ledeteksten (se sidefelt <xref linkend="sidebar.shell" />).
vi_vn: Các trang hướng dẫn sử dựng, mặc dù có phong cách khá ngắn gọn, nhưng chứa rất nhiều thông tin. Chúng ta sẽ đi nhanh qua lệnh này để xem chúng. Đơn giản chỉ nhập <command>man <replaceable>trang-hướng-dẫn</replaceable></command> — trang hướng dẫn sử dụng thường có cùng tên với lệnh mà chúng ta cần tìm hướng dẫn. Ví dụ, để tìm các lựa chọn cho lệnh <command>cp</command>, bạn sẽ nhập lệnh <command>man cp</command> ở dòng lệnh (xem <xref linkend="sidebar.shell" />).

source: <emphasis>BACK TO BASICS</emphasis> The shell, a command line interpreter
nb_no: <emphasis>TILBAKE TIL BASIS</emphasis> Skallet, en kommandolinjetolk
vi_vn: <emphasis>TRỞ VỀ CƠ BẢN</emphasis> Shell, một trình phiên dịch dòng lệnh

source: <primary>command line interpreter</primary>
nb_no: <primary>kommandolinjetolk</primary>
vi_vn: <primary>trình phiên dịch dòng lệnh</primary>

source: <primary>shell</primary>
nb_no: <primary>skall</primary>

source: A command line interpreter, also called a “shell”, is a program that executes commands that are either entered by the user or stored in a script. In interactive mode, it displays a prompt (usually ending in <literal>$</literal> for a normal user, or by <literal>#</literal> for an administrator) indicating that it is ready to read a new command. <xref linkend="short-remedial-course" /> describes the basics of using the shell.
nb_no: En kommandolinjetolk, også kalt et «skall», er et program som utfører kommandoer som enten er skrevet inn av brukeren, eller lagres i et skript. I interaktiv modus vises en ledetekst (som vanligvis slutter i <literal>$</literal> for en vanlig bruker, eller med <literal>#</literal> for en administrator) som indikerer at den er klar til å lese en ny kommando. <xref linkend="short-remedial-course" /> beskriver den grunnleggende bruken av «skall».
vi_vn: Một trình biên dịch dòng lệnh, cũng được gọi là “shell”, là một chương trình chạy các lệnh được nhập bởi người sử dụng hoặc được lưu sẵn trong một tập tin kịch bản. Trong chế độ tương tác trực tiếp, nó hiển thị một cụm từ nhắc (thường kết thúc bằng <literal>$</literal> cho một người sử dụng bình thường, hoặc bằng <literal>#</literal> cho một quản trị viên) cho biết rằng nó đã sẵn sàng để đọc vào một lệnh mới. <xref linkend="short-remedial-course" /> mô tả những cơ bản của việc sử dụng shell.

source: The default and most commonly used shell is <command>bash</command> (Bourne Again SHell), but there are others, including <command>dash</command>, <command>csh</command>, <command>tcsh</command> and <command>zsh</command>.
nb_no: Standard og det mest brukte skall er <command>bash</command> (Bourne Again SHell), men det er andre, medregnet <command>dash</command>, <command>csh</command>, <command>tcsh</command> og <command>zsh</command>.
vi_vn: Shell ngầm định được sử dụng nhiều nhất là <command>bash</command> (Bourne Again SHell), nhưng cũng có những công cụ khác, bao gồm <command>dash</command>, <command>csh</command>, <command>tcsh</command> và <command>zsh</command>.

source: Among other things, most shells offer help during input at the prompt, such as the completion of command or file names (which you can generally activate by pressing the <keycap>tab</keycap> key), or recalling previous commands (history management).
nb_no: Blant annet tilbyr de fleste skall hjelp under inntasting i ledeteksten, for eksempel fullføring av navn på kommandoer eller filer (som du vanligvis kan aktivere ved å trykke på <keycap>tab</keycap>-nøkkelen), eller hente frem tidligere kommandoer (historiehåndtering).
vi_vn: Trong những thứ khác, đa phần các shell hỗ trợ giúp đỡ trong lúc nhập ở dòng lệnh, ví dụ như tự động hoàn tất lệnh hoặc các tên tập tin (vốn bạn có thể kích hoạt bởi nhấn nút <keycap>tab</keycap>), hoặc gọi lại các lệnh trước đó (quản lý lịch sử).

source: Man pages not only document programs accessible from the command line, but also configuration files, system calls, C library functions, and so forth. Sometimes names can collide. For example, the shell's <command>read</command> command has the same name as the <function>read</function> system call. This is why manual pages are organized in numbered sections:
nb_no: Manuelle sider dokumenterer ikke bare programmer som er tilgjengelige fra kommandolinjen, men også konfigurasjonsfiler, systemoppkalling, C bibliotek-funksjoner, og så videre. Noen ganger kan navnene kollidere. For eksempel at; skallets <command>read</command>-kommando har det samme navnet som <function>read</function> systemoppkalling. Dette er fordi manuelle sider er organisert i nummererte seksjoner:
vi_vn: Các trang hướng dẫn sử dụng không chỉ hướng dẫn các chương trình truy cập được từ dòng lệnh mà còn các tập tin cấu hình, các lệnh gọi hệ thống, các hàm số thư viện của C, và vâng vâng. Thỉnh thoảng tên có thể trùng lặp. Ví dụ, lệnh <command>read</command> của shell có cùng tên với lệnh gọi hệ thống <function>read</function>. Đó là lý do tại sao các trang hướng dẫn sử dụng được cấu trúc theo các phần được đánh số:

source: commands that can be executed from the command line;
nb_no: kommandoer som kan utføres fra kommandolinjen;
vi_vn: các lệnh có thể được chạy từ dòng lệnh

source: system calls (functions provided by the kernel);
nb_no: systemkall (funksjoner som leveres av kjernen);
vi_vn: các lệnh gọi hệ thống (các hàm được cung cấp bởi nhân (kernel));

source: library functions (provided by system libraries);
nb_no: biblioteksfunksjoner (gitt av systembiblioteker);
vi_vn: các hàm thư viện (được cung cấp bởi các thư viện hệ thống);

source: devices (on Unix-like systems, these are special files, usually placed in the <filename>/dev/</filename> directory);
nb_no: enheter (på Unix-lignende systemer, disse er spesialfiler, vanligvis plassert i <filename>/dev/</filename>-katalogen);
vi_vn: các thiết bị (trên các hệ thống giống Unix, chúng là những tập tin đặc biệt, thường được đặt trong thư mục <filename>/dev/</filename>);

source: configuration files (formats and conventions);
nb_no: konfigurasjonsfiler (formater og konvensjoner);
vi_vn: các tập tin cấu hình (các định dạng và quy tắc truyền thống);

source: games;
nb_no: spill;
vi_vn: các trò chơi;

source: sets of macros and standards;
nb_no: sett med makroer og standarder;
vi_vn: các tập hợp macro và các tiêu chuẩn

source: system administration commands;
nb_no: kommandoer for systemadministrasjon;
vi_vn: các lệnh quản lý hệ thống

source: kernel routines.
nb_no: kjernerutiner.
vi_vn: các tập lệnh của nhân

source: It is possible to specify the section of the manual page that you are looking for: to view the documentation for the <function>read</function> system call, you would type <command>man 2 read</command>. When no section is explicitly specified, the first section that has a manual page with the requested name will be shown. Thus, <command>man shadow</command> returns <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry> because there are no manual pages for <foreignphrase>shadow</foreignphrase> in sections 1 to 4.
nb_no: Det er mulig å spesifisere den seksjonen på manualsiden du er ute etter: For å vise dokumentasjonen for <function>read</function>-systemoppkallingen, må du skrive <command>man 2 read</command>. Når ingen seksjon er uttrykkelig angitt, vil den første seksjonen som har en manuell side med det riktige navnet bli vist. Dermed kommer <command>man shadow</command> tilbake <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry> fordi det ikke er noen manuell side for <foreignphrase>shadow</foreignphrase> i seksjonene fra 1 til 4.
vi_vn: Ta có thể chỉ định phần cho trang hướng dẫn ta đang tìm: để xem tài liệu hướng dẫn cho lệnh gọi hệ thống <function>read</function>, bạn có thể nhập <command>man 2 read</command>. Khi không có phần nào được chỉ định công khai, phần đầu tiên có một trang hướng dẫn sử dụng với tên trùng sẽ được hiển thị. Vì thế, <command>man shadow</command> trả về <citerefentry><refentrytitle>shadow</refentrytitle><manvolnum>5</manvolnum></citerefentry> bởi vì không có trang hướng dẫn sử dụng nào cho <foreignphrase>shadow</foreignphrase> trong phần 1 tới phần 4.

source: <emphasis>TIP</emphasis> <command>whatis</command>
nb_no: <emphasis>TIPS</emphasis> <command>whatis</command>
vi_vn: <emphasis>MẸO</emphasis> <command>whatis</command>

source: If you do not want to look at the full manual page, but only a short description to confirm that it is what you are looking for, simply enter <command>whatis <replaceable>command</replaceable></command>.
nb_no: Hvis du ikke ønsker å se på hele den manuelle siden, men bare en kort beskrivelse for å bekrefte at det er det du leter etter, skriv bare <command>whatis <replaceable>kommando</replaceable></command>.
vi_vn: Nếu bạn không muốn đọc hết trang hướng dẫn, nhưng chỉ muốn một mô tả ngắn gọn để xác nhận rằng đó là thứ mình cần tìm, hãy đơn giản nhập <command>whatis <replaceable>command</replaceable></command>.

source: This short description is included in the <emphasis>NAME</emphasis> section at the beginning of all manual pages.
nb_no: Denne korte beskrivelse er inkludert i <emphasis>NAME</emphasis>-seksjonen ved starten av alle manuelle sider.
vi_vn: Phần mô tả ngắn gọn sau được đính kèm trong phần <emphasis>NAME</emphasis> ở đoạn đầu của tất cả các trang hướng dẫn sử dụng.

source: Of course, if you do not know the names of the commands, the manual is not going to be of much use to you. This is the purpose of the <command>apropos</command> command, which helps you conduct a search in the manual pages, or more specifically in their short descriptions. Each manual page begins essentially with a one line summary. <command>apropos</command> returns a list of manual pages whose summary mentions the requested keyword(s). If you choose them well, you will find the name of the command that you need.
nb_no: Selvfølgelig, hvis du ikke vet navnene på kommandoene, kommer ikke manualen til å være til stor nytte for deg. Dette er hensikten med <command>apropos</command>-kommandoen, som hjelper deg å utføre et søk i manualsidene, eller mer spesifikt i de korte beskrivelsene. Hver manualside begynner egentlig med en linjes sammendrag.<command>apropos</command> returnerer en liste med manuelle sider der oppsummeringen har med de forespurte søkeord(ene). Med gode valg, vil du finne navnet på kommandoen du trenger.
vi_vn: Dĩ nhiên, nếu bạn không muốn biết những tên của các lệnh, hướng dẫn sử dụng sẽ không có ít gì. Đây là mục đích của lệnh <command>apropos</command>, vốn giúp bạn thực hiện một lệnh tìm kiếm trong các trang hướng dẫn sử dụng, hoặc cụ thể hơn trong các mô tả ngắn gọn của chúng. Mỗi một trang hướng dẫn sử dụng bắt đầu bằng một bản tóm tắt có độ dài một dòng. <command>apropos</command> trả về một danh sách các trang hướng dẫn sử dụng mà bản hướng dẫn của chúng có đề cập đến (các) từ khóa. Nếu bạn chọn từ khóa tốt, bạn sẽ tìm thấy tên của lệnh bạn cần.

source: Finding <command>cp</command> with <command>apropos</command>
nb_no: Finne <command>cp</command> med <command>apropos</command>
vi_vn: Tìm kiếm <command>cp</command> với <command>apropos</command>

source: <emphasis>TIP</emphasis> Browsing by following links
nb_no: <emphasis>TIP</emphasis> Blar etter følgende linker
vi_vn: <emphasis>MẸO</emphasis> Duyệt bằng cách đi theo các đường dẫn (đường link)

source: Many manual pages have a “SEE ALSO” section, usually at the end. It refers to other manual pages relevant to similar commands, or to external documentation. In this way, it is possible to find relevant documentation even when the first choice is not optimal.
nb_no: Mange manuelle sider har en «Se også» del, vanligvis på slutten. Det refererer til andre manuelle sider som er relevante for tilsvarende kommandoer, eller til ekstern dokumentasjon. På denne måte er det mulig å finne relevante dokumenter, selv når det første valget ikke er optimalt.
vi_vn: Nhiều trang hướng dẫn có một phần “SEE ALSO”, vốn nằm ở cuối. Chúng thường nói về các trang hướng dẫn khác liên quan đến các lệnh tương tự, hoặc về các tài liệu hướng dẫn bên ngoài. Bằng cách này, ta có thể tìm nhiều tài liệu hướng dẫn có liên quan hơn thậm chí khi lựa chọn tìm kiếm đầu tiên không tối ưu.

source: The <command>man</command> command is not the only means of consulting the manual pages, since <command>konqueror</command> (in KDE) and <command>yelp</command> (under GNOME) programs also offer this possibility. There is also a web interface, provided by the <command>man2html</command> package, which allows you to view manual pages in a web browser. On a computer where this package is installed, use this URL: <ulink type="block" url="http://localhost/cgi-bin/man/man2html" />
nb_no: <command>man</command>-kommandoen er ikke den eneste måten å konsultere manualsidene på, ettersom sidene <command>konqueror</command> (i KDE), og <command>yelp</command> (under GNOME) programmer også gir denne muligheten. Det er også et nettgrensesnitt, levert av <command>man2html</command>-pakken, som lar deg vise manuelle sider i en nettleser. På en datamaskin der denne pakken er installert, kan du bruke denne nettadressen <ulink type="block" url="http://localhost/cgi-bin/man/man2html" />
vi_vn: Lệnh <command>man</command> không chỉ là cách duy nhất để tra cứu các trang hướng dẫn, bởi các chương trình <command>konqueror</command> (trong KDE) và <command>yelp</command> (trong GNOME) cũng cho phép khả năng này. Cũng có một giao diện web, được cung cấp bởi gói phần mềm <command>man2html</command>, vốn cho phép bạn xem các trang hướng dẫn sử dụng trên một trình duyệt. Trên một máy tính nơi mà gói phần mềm được cài đặt, sử dụng đường dẫn trang web sau: <ulink type="block" url="http://localhost/cgi-bin/man/man2html" />
