Repository: Debian-VN/debian-handbook
Catalog: */07_solving-problems.po
Languages: nb_no, vi_vn

source: These documents should be taken with a grain of salt. They are often several years old; the information they contain is sometimes obsolete. This phenomenon is even more frequent for their translations, since updates are neither systematic nor instant after the publication of a new version of the original documents. This is part of the joys of working in a volunteer environment and without constraints…
nb_no: Disse dokumentene bør tas med en klype salt. De er ofte flere år gamle; den informasjonen de inneholder er noen ganger foreldet. Dette fenomenet er enda hyppigere for oversettelsene, ettersom oppdateringene verken er systematiske eller kommer samtidig med offentliggjøringen av en ny versjon av originaldokumentene. Dette er en del av gleden av å jobbe i et frivillig miljø, og uten begrensninger …
vi_vn: Những tài liệu này nên được đọc cẩn thận. Chúng thường đã tồn tại một vài năm, thông tin chứa ở trong các tài liệu này thỉnh thoảng đã lỗi thời. Hiện tượng này thậm chí thường xuyên hơn với các bản dịch của chúng, bởi các cập nhật thường không có tính hệ thống và không tức thời sau lần xuất bản của phiên bản mới nhất của các tài liệu nguyên gốc. Đây là một phần của việc làm việc với môi trường tình nguyện và không có ràng buộc…

source: Common Procedures
nb_no: Vanlige prosedyrer
vi_vn: Các quy trình phổ biến

source: <primary>standard procedure</primary>
nb_no: <primary>standard prosedyre</primary>
vi_vn: <primary>quy trình chuẩn</primary>

source: The purpose of this section is to present some general tips on certain operations that an administrator will frequently have to perform. These procedures will of course not cover every possible case in an exhaustive way, but they may serve as starting points for the more difficult cases.
nb_no: Formålet med denne seksjonen er å presentere noen generelle tips om visse operasjoner som en administrator ofte må utføre. Disse prosedyrene vil selvsagt ikke dekke alle mulige tilfeller uttømmende, men de kan tjene som utgangspunkt i de mer vanskelige sakene.
vi_vn: Mục đích của phần này là trình bày một vài mẹo chung cho một số tác vụ mà quản trị viên sẽ thường phải thực hiện. Các quy trình này sẽ dĩ nhiên không bao phủ từng ngóc ngách của tất cả các trường hợp có thể, nhưng chúng sẽ được sử dụng như những điểm bắt đầu cho các trường hợp khó hơn.

source: <emphasis>DISCOVERY</emphasis> Documentation in other languages
nb_no: <emphasis>OPPDAGELSE</emphasis> Dokumentasjon på andre språk
vi_vn: <emphasis>KHÁM PHÁ</emphasis> Tài liệu hướng dẫn theo các ngôn ngữ khác

source: Often, documentation translated into a non-English language is available in a separate package with the name of the corresponding package, followed by <literal>-<replaceable>lang</replaceable></literal> (where <replaceable>lang</replaceable> is the two-letter ISO code for the language).
nb_no: Ofte er dokumentasjon oversatt til et annet språk enn engelsk tilgjengelig i en egen pakke med navnet på den tilsvarende pakken, etterfulgt av <literal>-<replaceable>lang</replaceable></literal> (hvor <replaceable>lang</replaceable> er tobokstavs-ISO-koden for språket).
vi_vn: Thông thường, tài liệu hướng dẫn được dịch sang một ngôn ngữ không phải tiếng Anh sẽ có sẵn trong một gói phần mềm riêng biệt với tên của gói phần mềm tương ứng, theo sau bởi <literal>-<replaceable>lang</replaceable></literal> (trong đó <replaceable>lang</replaceable> là mã ISO 2 ký tự đại diện cho ngôn ngữ đó).

source: For instance, the <emphasis>apt-howto-fr</emphasis> package contains the French translation of the howto for <emphasis>APT</emphasis>. Likewise, the <emphasis>quick-reference-fr</emphasis> and <emphasis>debian-reference-fr</emphasis> packages are the French versions of the reference guides for Debian (initially written in English by Osamu Aoki).
nb_no: For eksempel; <emphasis>apt-howto-fr</emphasis>-pakken inneholder den franske versjonen av «howto»-en av <emphasis>APT</emphasis>. På samme måte; <emphasis>quick-reference-fr</emphasis>, og <emphasis>debian-reference-fr</emphasis>-pakkene er de franske versjonene av Debians referanse-guider (opprinnelig skrevet på engelsk av Osamu Aoki).
vi_vn: Ví dụ, gói phần mềm <emphasis>apt-howto-fr</emphasis> chứa bản dịch tiếng Pháp của <emphasis>APT</emphasis>. Tương tự, các gói phần mềm <emphasis>quick-reference-fr</emphasis> và <emphasis>debian-reference-fr</emphasis> là các phiên bản tiếng Pháp của các tài liệu tham khảo cho Debian (ban đầu được viết theo tiếng Anh bởi Osamu Aoki).

source: Configuring a Program
nb_no: Konfigurere et program
vi_vn: Cấu hình một chương trình

source: <primary>configuration</primary><secondary>program configuration</secondary>
nb_no: <primary>konfigurasjon</primary><secondary>programkonfigurasjon</secondary>
vi_vn: <primary>cấu hình</primary><secondary>cấu hình chương trình</secondary>

source: <primary>program</primary><secondary>configuration</secondary>
nb_no: <primary>program</primary><secondary>konfigurasjon</secondary>
vi_vn: <primary>chương trình</primary><secondary>cấu hình</secondary>

source: When you want to configure an unknown package, you must proceed in stages. First, you should read what the package maintainer has documented. Reading <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename> will indeed allow you to learn of specific provisions made to simplify the use of the software. It is sometimes essential in order to understand the differences from the original behavior of the program, as described in the general documentation, such as howtos. Sometimes this file also details the most common errors in order for you to avoid wasting time on common problems.
nb_no: Når du ønsker å konfigurere en ukjent pakke, må du gå frem i etapper. Først må du lese pakkeutviklerens dokumentasjon. Å lese <filename>/usr/share/doc/<replaceable>pakke</replaceable>/README.Debian</filename> vil faktisk åpne for å lære spesifikke grep for å forenkle bruken av programvaren. Det er noen ganger nødvendig for å forstå avvikene fra hva det opprinnelige programmet gjør, som beskrevet i den generelle dokumentasjonen, for eksempel i howtos. Noen ganger har denne filen også detaljer over de vanligste feilene, slik at du skal unngå å kaste bort tid på vanlige problemer.
vi_vn: Khi bạn muốn cấu hình một gói lạ, bạn nên đi từng bước một. Trước tiên, bạn nên đọc những gì đã được hướng dẫn bởi nhà bảo trì gói phần mềm đó. Đọc <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename> sẽ thực sự cho phép bạn biết những thứ được cung cấp sẵn để làm đơn giản việc sử dụng phần mềm. Điều này thỉnh thoảng rất quan trọng để hiểu được những sự khác biệt so với hành vi nguyên gốc, như được mô tả trong tài liệu hướng dẫn chung, như là các tài liệu hướng dẫn từng bước. Thỉnh thoảng tập tin này cũng đi sâu vào chi tiết những lỗi thường gặp để bạn có thể tránh mất thời gian vào các vấn đề này.

source: Then, you should look at the software's official documentation — refer to <xref linkend="sect.documentation-sources" /> to identify the various existing documentation sources. The <command>dpkg -L <replaceable>package</replaceable></command> command gives a list of files included in the package; you can therefore quickly identify the available documentation (as well as the configuration files, located in <filename>/etc/</filename>). <command>dpkg -s <replaceable>package</replaceable></command> displays the package meta-data and shows any possible recommended or suggested packages; in there, you can find documentation or a utility that will ease the configuration of the software.
nb_no: Deretter bør du se på programvarens offisielle dokumentasjon - se <xref linkend="sect.documentation-sources" /> for å identifisere de forskjellige foreliggende dokumentasjonskilder. <command>dpkg -L <replaceable>pakke</replaceable></command>-kommandoen gir en liste over filene i pakken: Dermed kan du raskt identifisere tilgjengelig dokumentasjon (samt konfigurasjonsfiler, som ligger i <filename>/etc/</filename>). <command>dpkg -s <replaceable>pakke</replaceable></command> viser pakkens meta-data, og viser eventuelle anbefalte eller foreslåtte pakker. Der kan du finne dokumentasjon eller et verktøy som letter programvarekonfigurasjonen.
vi_vn: Sau đó, bạn nên nhìn vào tài liệu hướng dẫn chính thức của phần mềm — hãy xem <xref linkend="sect.documentation-sources" /> để nhận định được các nguồn tài liệu sẵn có. Lệnh <command>dpkg -L <replaceable>package</replaceable></command> trả về danh sách những tập tin được đính kèm trong gói phần mềm này; bạn có thể nhanh chóng nhận ra những tài liệu sẵn có (cũng như các tập tin cấu hình, nằm trong <filename>/etc/</filename>). Lệnh <command>dpkg -s <replaceable>package</replaceable></command> hiển thị những thông tin phụ của gói phần mềm và hiển thị bất kỳ các gói phần mềm được đề nghị hay gợi ý; ở trong đó, bạn có thể tìm thấy tài liệu hướng dẫn, hoặc một tiện ích vốn sẽ giúp giảm bớt khó khăn trong việc cấu hình phần mềm.

source: Finally, the configuration files are often self-documented by many explanatory comments detailing the various possible values for each configuration setting. So much so that it is sometimes enough to just choose a line to activate from among those available. In some cases, examples of configuration files are provided in the <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename> directory. They may serve as a basis for your own configuration file.
nb_no: Til slutt, oppsettfilene er ofte selv-dokumenterte ved mange forklarende kommentarer som går i detaljer om de mulige verdier for hver oppsettsinnstilling. Så mye at det noen ganger er nok å bare velge en linje blant de tilgjengelige for å aktivere dem. I noen tilfeller er eksempler på oppsettsfiler gitt i <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename>-mappen. De kan tjene som grunnlag for din egen oppsettsfil.
vi_vn: Cuối cùng, các tập tin cấu hình thường có những dòng ghi chú đọc là hiểu giải thích các giá trị có thể có cho mỗi thiết lập cấu hình. Rất nhiều đến nỗi thỉnh thoảng chỉ cần chọn một dòng để kích hoạt giữa những thứ có sẵn là đủ. Trong một số trường hợp, các ví dụ về các tập tin cấu hình được cung cấp trong thư mục <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename>. Chúng có thể là cơ sở cho tập tin cấu hình của riêng bạn.

source: <emphasis>DEBIAN POLICY</emphasis> Location of examples
nb_no: <emphasis>DEBIAN POLICY</emphasis> Lokalisering av eksempler
vi_vn: <emphasis>CHÍNH SÁCH DEBIAN</emphasis> Địa chỉ của các ví dụ

source: <primary>examples, location</primary>
nb_no: <primary>eksempler, plassering</primary>
vi_vn: <primary>các ví dụ, địa chỉ</primary>

source: All examples must be installed in the <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename> directory. This may be a configuration file, program source code (an example of the use of a library), or a data conversion script that the administrator can use in certain cases (such as to initialize a database). If the example is specific to a particular architecture, it should be installed in <filename>/usr/lib/<replaceable>package</replaceable>/examples/</filename> and there should be a link pointing to that file in the <filename>/usr/share/doc/<replaceable>package</replaceable>/examples/</filename> directory.
nb_no: Alle eksemplene må være installert i <filename>/usr/share/doc/<replaceable>pakke</replaceable>/examples/</filename>-mappen. Dette kan være en konfigurasjonsfil, programkildekoden (et eksempel på å bruke et bibliotek), eller et datakonverteringsskript som administratoren kan bruke i visse tilfeller (for eksempel for å internalisere en database). Hvis eksempelet er spesifikt for en bestemt arkitektur, bør det være installert i <filename>/usr/lib/<replaceable>pakke</replaceable>/examples/</filename>, og det bør være en lenke som peker til denne filen i <filename>/usr/share/doc/<replaceable>pakke</replaceable>/examples/</filename>-mappen.
vi_vn: Tất cả các ví dụ phải được cài đặt vào thư mục <filename>/usr/share/doc/<replaceable>gói-phần-mềm</replaceable>/examples/</filename>. Đây có thể là một tập tin cấu hình, mã nguồn chương trình (một ví dụ về cách sử dụng một thư viện) hoặc một kịch bản chuyển đổi dữ liệu mà quản trị viên có thể sử dụng trong một số trường hợp nhất định (như là khởi động một cơ sở dữ liệu). Nếu ví dụ đó chỉ liên quan tới một kiến trúc máy tính nào đó, nó nên được cài đặt vào <filename>/usr/lib/<replaceable>package</replaceable>/examples/</filename> và phải có một đường dẫn chỉ đến tập tin đó trong thư mục <filename>/usr/share/doc/<replaceable>gói-phần-mềm</replaceable>/examples/</filename>.

source: Monitoring What Daemons Are Doing
nb_no: Å følge med i hva nissene gjør
vi_vn: Theo dõi Hoạt động của Các dịch vụ nền

source: Understanding what a daemon does is somewhat more complicated, since it does not interact directly with the administrator. To check that a daemon is actually working, you need to test it. For example, to check the Apache (web server) daemon, test it with an HTTP request.
nb_no: Å forstå hva en nisse gjør er noe mer komplisert, siden den ikke kommuniserer direkte med administrator. For å sjekke at en nisse faktisk fungerer, må du teste den. For eksempel, for å sjekke Apache (nettjener) nissen, test den med en HTTP-forespørsel.
vi_vn: Hiểu những gì một dịch vụ chạy nền đang làm thì có một chút phức tạp, bởi nó không tương tác trực tiếp với quản trị viên. Để kiểm tra rằng một dịch vụ nền đang thực sự chạy, bạn cần phải kiểm tra nó. Ví dụ, để kiểm tra dịch vụ chạy nền Apache (máy phục vụ web), hãy kiểm tra nó với một yêu cầu HTTP.

source: To allow such tests, each daemon generally records everything that it does, as well as any errors that it encounters, in what are called “log files” or “system logs”. Logs are stored in <filename>/var/log/</filename> or one of its subdirectories. To know the precise name of a log file for each daemon, see its documentation. Note: a single test is not always sufficient if it does not cover all the possible usage cases; some problems only occur in particular circumstances.
nb_no: For å tillate slike tester registrerer hver nisse generelt alt den gjør, samt eventuelle feil som den møter, i det som kalles «loggfiler» eller «systemlogger». Loggene lagres i <filename>/var/log/</filename>, eller en av underkatalogene dens. For å vite det nøyaktige navnet på en loggfil for hver nisse, se dokumentasjonen. Merk: En enkel test er ikke alltid tilstrekkelig dersom det ikke dekker alle mulige brukstilfeller; noen problemer oppstår bare i spesielle tilfeller.
vi_vn: Để cho phép những bài kiểm tra đó, mỗi dịch vụ chạy nền nhìn chung ghi lại tất cả những gì nó làm, và cả những lỗi nó gặp phải, vào những thứ được gọi là “các tập tin nhật ký” hoặc “các nhật ký hệ thống”. Các nhật ký được lưu trong <filename>/var/log/</filename> hoặc một trong các thư mục con của nó. Để biết tên cụ thể của tập tin nhật ký của mỗi dịch vụ nền, hãy xem tài liệu hướng dẫn của nó. Chú ý: một bài kiểm tra luôn không đủ để bao phủ hết tất cả các trường hợp; một vài vấn đề chỉ xảy ra trong các trường hợp đặc biệt.

source: <emphasis>TOOL</emphasis> The <command>rsyslogd</command> daemon
nb_no: <emphasis>VERKTØY</emphasis> <command>rsyslogd</command> nissen
vi_vn: <emphasis>CÔNG CỤ</emphasis> Dịch vụ nền <command>rsyslogd</command>

source: <primary>logs</primary><secondary>files</secondary>
nb_no: <primary>logger</primary><secondary>filer</secondary>
vi_vn: <primary>các nhật ký</primary><secondary>các tập tin</secondary>

source: <primary>files</primary><secondary>logs</secondary>
nb_no: <primary>filer</primary><secondary>logger</secondary>
vi_vn: <primary>các tập tin</primary><secondary>các nhật ký</secondary>

source: <command>rsyslogd</command> is special: it collects logs (internal system messages) that are sent to it by other programs. Each log entry is associated with a subsystem (e-mail, kernel, authentication, etc.) and a priority; <command>rsyslogd</command> processes these two pieces of information to decide on what to do. The log message may be recorded in various log files, and/or sent to an administration console. The details are defined in the <filename>/etc/rsyslog.conf</filename> configuration file (documented in the manual page of the same name).
nb_no: <command>rsyslogd</command> er spesiell: Den samler logger (interne systemmeldinger) som sendes til den fra andre programmer. Hver loggoppføring er knyttet til et delsystem (e-post, kernel, autentisering, etc.) og en prioritet; <command>rsyslogd</command> behandler disse to delene med informasjon for å bestemme hva de skal gjøre. Loggmeldingen kan bli registrert i forskjellige loggfiler, og/eller sendes til et administrasjonskonsoll. Detaljene er definert i <filename>/etc/rsyslog.conf</filename>-konfigurasjonsfilen (dokumentert i manualsiden med samme navn).
vi_vn: <command>rsyslogd</command> rất đặc biệt: nó thu thập các thông điệp nhật ký (các thông điệp nội bộ hệ thống) vốn được gửi tới nó bởi các chương trình khác. Mỗi chỉ mục trong nhật ký được liên kết với một hệ thống nhỏ (thư điện tử, nhân(kernel), xác thực, vâng vâng) và một mức ưu tiên; <command>rsyslogd</command> xử lý hai mẩu thông tin này để quyết định phải làm gì. Thông điệp nhật ký có thể được lưu lại trong các tập tin nhật ký, và/hoặc gửi đến một cửa sổ dòng lệnh cho quản trị viên. Chi tiết được định nghĩa trong tập tin cấu hình <filename>/etc/rsyslog.conf</filename> (được hướng dẫn trong trang hướng dẫn sử dụng có cùng tên).

source: Certain C functions, which are specialized in sending logs, simplify the use of the <command>rsyslogd</command> daemon. However some daemons manage their own log files (this is the case, for example, of <command>samba</command>, that implements Windows shares on Linux).
nb_no: Enkelte C-funksjoner, som er spesialisert for å sende logger, forenkler bruken av <command>rsyslogd</command>-nissen. Men noen nisser administrerer sine egne loggfiler (dette er tilfelle, for eksempel, med <command>samba</command>, som implementerer Windows-delinger på Linux).
vi_vn: Một vài hàm C, vốn chuyên để gửi đi các thông điệp nhật ký, đơn giản hóa việc sử dụng dịch vụ nền <command>rsyslogd</command>. Tuy nhiên, một vài dịch vụ nền quản lý các tập tin nhật ký riêng của chúng (đây là trường hợp, ví dụ, của <command>samba</command>, vốn hiện thực hóa các chia sẻ Windows trên Linux).

source: Note that when <command>systemd</command> is in use, the logs are actually collected by <command>systemd</command> before being forwarded to <command>rsyslogd</command>. They are thus also available via <command>systemd</command>'s journal and can be consulted with <command>journalctl</command> (see <xref linkend="sect.systemd" /> for details).
nb_no: Merk at når <command>systemd</command> er i bruk, blir loggende faktisk samlet av <command>systemd</command> før den sendes videre til <command>rsyslogd</command>. Slik er de også tilgjengelige via <command>systemd</command>s journal, og kan bli konsultert med <command>journalctl</command> (se <xref linkend="sect.systemd" /> for detaljer).
vi_vn: Ghi chú rằng khi <command>systemd</command> đang hoạt động, các thông điệp nhật ký được thu thập bởi <command>systemd</command> trước khi được chuyển tới <command>rsyslogd</command>. Vì thế chúng cũng có thể được truy cập thông qua nhật ký <command>systemd</command> và có thể tham khảo với <command>journalctl</command> (xem <xref linkend="sect.systemd" /> để biết thêm chi tiết).

source: <emphasis>BACK TO BASICS</emphasis> Daemon
nb_no: <emphasis>TILBAKE TIL BASIS</emphasis> Nisse
vi_vn: <emphasis>TRỞ VỀ CƠ BẢN</emphasis> Dịch vụ chạy nền

source: <primary>daemon</primary>
nb_no: <primary>nisse</primary>
vi_vn: <primary>dịch vụ chạy nền</primary>

source: A daemon is a program that is not explicitly invoked by the user and that stays in the background, waiting for a certain condition to be met before performing a task. Many server programs are daemons, a term that explains that the letter “d” is frequently present at the end of their name (<command>sshd</command>, <command>smtpd</command>, <command>httpd</command>, etc.).
nb_no: En nisse er et program som ikke eksplisitt er aktivert av brukeren, og som holder seg i bakgrunnen, og venter på at en bestemt betingelse må være oppfylt før den utfører en oppgave. Mange serverprogrammer er nisser, et begrep som forklarer at bokstaven «d» ofte er med på slutten av navnet sitt (<command>sshd</command>, <command>smtpd</command>, <command>httpd</command>, etc.).
vi_vn: Một dịch vụ chạy nền là một chương trình không được khởi động trực tiếp bởi người sử dụng và tiếp tục chạy nền, chờ cho một điều kiện nào đó được thỏa để thực hiện một tác vụ. Nhiều chương trình máy phục vụ là các dịch vụ chạy nền, một cụm từ giải thích tốt hơn là ký tự “d” thường xuất hiện ở cuối tên của chúng (<command>sshd</command>, <command>smtpd</command>, <command>httpd</command>, vâng vâng).
