Repository: Debian-VN/debian-handbook
Catalog: */07_solving-problems.po
Languages: nb_no, vi_vn

source: As a preventive operation, the administrator should regularly read the most relevant server logs. They can thus diagnose problems before they are even reported by disgruntled users. Indeed users may sometimes wait for a problem to occur repeatedly over several days before reporting it. In many cases, there are specific tools to analyze the contents of the larger log files. In particular, such utilities exist for web servers (such as <command>analog</command>, <command>awstats</command>, <command>webalizer</command> for Apache), for FTP servers, for proxy/cache servers, for firewalls, for e-mail servers, for DNS servers, and even for print servers. Some of these utilities operate in a modular manner and allow analysis of several types of log files. This is the case of <command>lire</command>. Other tools, such as <command>logcheck</command> (a software discussed in <xref linkend="security" />), scan these files in search of alerts to be dealt with.
nb_no: Som en forebyggende operasjon bør administratoren regelmessig lese de mest relevante serverlogger. De kan dermed diagnostisere problemer til og med før de blir rapportert inn av misfornøyde brukere. Faktisk kan brukere noen ganger vente på et problem skal skje gjentatte ganger over flere dager før de rapportere det. I mange tilfeller er det spesifikke verktøy for å analysere innholdet av de større loggfilene. Spesielt finnes slike verktøy for nettjenere (for eksempel <command>analog</command>, <command>awstats</command>, <command>webalizer</command> for Apache), for FTP-servere, for tjenere for mellomlagre/hurtiglagre, for brannmurer, for e-posttjenere, for DNS-servere, og selv for utskriftstjenere. Noen av disse verktøyene opererer modulært, og tillater analyse av flere typer av loggfiler. Dette er tilfelle for <command>lire</command>. Andre verktøy, slike som <command>logcheck</command> (et program diskutert i <xref linkend="security" />), skanner disse filene for å finne varsler som må behandles.
vi_vn: Như là một biện pháp phòng chống, quản trị viên nên thường xuyên đọc những nhật ký máy phục vụ có liên quan nhất. Chúng có thể giúp chẩn đoán được các vấn đề trước khi chúng bị báo cáo bởi các người sử dụng đầy giận dữ. Thực vậy, những người sử dụng có thể thỉnh thoảng chờ để một vấn đề xảy ra lặp đi lặp lại qua vài ngày trước khi báo cáo nó. Trong nhiều trường hợp, có nhiều công cụ cụ thể để phân tích nội dung của các tập tin nhật ký lớn hơn. Cụ thể hơn, các tiện ích này tồn tại cho các máy phục vụ web (như là <command>analog</command>, <command>awstats</command>, <command>webalizer</command> cho Apache), cho các máy phục vụ FTP, cho các máy phục vụ trạm chuyển hướng(proxy)/bộ nhớ tạm(cache), cho các tường lửa, cho các máy phục vụ thư điện tử, cho các máy phục vụ DNS, và thậm chí cho các máy phục vụ in ấn. Một số trong những tiện ích trên hoạt động dựa trên nhiều mô-đun và cho phép phân tích nhiều loại tập tin nhật ký. Đây là trường hợp của <command>lire</command>. Các công cụ khác, như là <command>logcheck</command> (một phần mềm được thảo luận ở <xref linkend="security" />), quét qua các tập tin này để tìm kiếm các cảnh báo và xử lý chúng.

source: Asking for Help on a Mailing List
nb_no: Å be om hjelp på en postliste

source: If your various searches haven't helped you to get to the root of a problem, it is possible to get help from other, perhaps more experienced people. This is exactly the purpose of the <email>debian-user@lists.debian.org</email> mailing list. As with any community, it has rules that need to be followed. Before asking any question, you should check that your problem isn't already covered by recent discussions on the list or by any official documentation. <ulink type="block" url="https://wiki.debian.org/DebianMailingLists" /> <ulink type="block" url="https://lists.debian.org/debian-user/" />
nb_no: Hvis de ulike søkene ikke har hjulpet deg til å komme til kjernen av et problem, er det mulig å få hjelp fra andre, kanskje mer erfarne folk. Dette er nettopp hensikten med <email>debian-user@lists.debian.org</email>-postliste. Som med ethvert samfunn, har det regler som må følges. Før du stiller noen spørsmål, bør du sjekke at problemet ikke allerede er dekket av nyere diskusjoner på listen, eller ved en offisiell dokumentasjon.<ulink type="block" url="https://wiki.debian.org/DebianMailingLists" /> <ulink type="block" url="https://lists.debian.org/debian-user/" />

source: <primary>mailing lists</primary>
nb_no: <primary>postlister</primary>

source: <emphasis>TIP</emphasis> Reading a list on the Web
nb_no: <emphasis>TIP</emphasis> Å lese en liste på nettet

source: For high volume mailing lists, such as <email>debian-user@lists.debian.org</email>, it may be worthwhile to go through them as a discussion forum (or newsgroup). Gmane.org allows consultation of the Debian lists in this format. The list mentioned above is available at: <ulink type="block" url="http://dir.gmane.org/gmane.linux.debian.user" />
nb_no: For postlister med stort volum, slike som <email>debian-user@lists.debian.org</email>, kan det være verdt å gå gjennom dem som et diskusjonsforum (eller nyhetsgruppe). Gmane.org åpner for konsultasjon i Debians lister i dette formatet. Listen nevnt ovenfor er tilgjengelig på: <ulink type="block" url="http://dir.gmane.org/gmane.linux.debian.user" />

source: <emphasis>BACK TO BASICS</emphasis> Netiquette applies
nb_no: <emphasis>TILBAKE TIL BASIS</emphasis> Nettetikette gjelder

source: In general, for all correspondence on e-mail lists, the rules of Netiquette should be followed. This term refers to a set of common sense rules, from common courtesy to mistakes that should be avoided. <ulink type="block" url="http://tools.ietf.org/html/rfc1855" /> <indexterm><primary>Netiquette</primary></indexterm>
nb_no: Generelt for all korrespondanse på e-postlister er at reglene for nettetikette bør følges. Dette begrepet refererer til et sett av regler for sunn fornuft-regler, fra vanlig høflighet til feil som bør unngås. <ulink type="block" url="http://tools.ietf.org/html/rfc1855" /> <indexterm><primary>Netiquette</primary></indexterm>

source: Furthermore, for any communication channel managed by the Debian project, you are bound by the Debian Code of Conduct: <ulink type="block" url="https://www.debian.org/code_of_conduct" />
nb_no: Videre, i enhver kommunikasjonskanal som forvaltes av Debian-prosjektet, er du bundet av Debian Code of Conduct (Debians kode for oppførsel): <ulink type="block" url="https://www.debian.org/code_of_conduct" />

source: Once those two conditions are met, you can think of describing your problem to the mailing list. Include as much relevant information as possible: various tests conducted, documentation consulted, how you attempted to diagnose the problem, the packages concerned or those that may be involved, etc. Check the Debian Bug Tracking System (BTS, described in sidebar <xref linkend="sidebar.bts" />) for similar problems, and mention the results of that search, providing links to bugs found. BTS starts on: <ulink type="block" url="http://www.debian.org/Bugs/index.html" />
nb_no: Når disse to vilkår er oppfylt, kan du forberede å beskrive problemet til e-postlisten. Inkluder så mye relevant informasjon som mulig: Ulike tester som er utført, dokumentasjon som er konsultert, hvordan du forsøkte å diagnostisere problemet, de berørte pakker eller de som kan være involvert, etc. Sjekk Debian Bug Tracking System (BTS, beskrevet i sidepanelet <xref linkend="sidebar.bts" />) for lignende problemer, og nevn resultatene av det søket, og gi linker til feil som er funnet. BTS starter på: <ulink type="block" url="http://www.debian.org/Bugs/index.html" />

source: The more courteous and precise you have been, the greater your chances are of getting an answer, or, at least, some elements of response. If you receive relevant information by private e-mail, think of summarizing this information publicly so that others can benefit. This also allows the list's archives, searched through various search engines, to show the resolution for others who may have the same question.
nb_no: Jo mer høflig og presis du har vært, desto større er sjansen for å få et svar, eller i det minste noen elementer av respons. Hvis du mottar relevant informasjon i privat e-post, vurder å sammenfatte denne informasjonen offentlig, slik at andre kan dra nytte av den. Dette gjør det mulig for listens arkiver, når de søkes gjennom ulike søkemotorer, å vise løsningen for andre som kanskje har det samme spørsmålet.

source: Reporting a Bug When a Problem Is Too Difficult
nb_no: Å rapportere en feil når problemet er for vanskelig

source: <primary>report a bug</primary>
nb_no: <primary>rapporter en bug</primary>

source: <primary>bug report</primary>
nb_no: <primary>bug rapportere</primary>

source: If all of your efforts to resolve a problem fail, it is possible that a resolution is not your responsibility, and that the problem is due to a bug in the program. In this case, the proper procedure is to report the bug to Debian or directly to the upstream developers. To do this, isolate the problem as much as possible and create a minimal test situation in which it can be reproduced. If you know which program is the apparent cause of the problem, you can find its corresponding package using the command, <command>dpkg -S <replaceable>file_in_question</replaceable></command>. Check the Bug Tracking System (<literal>https://bugs.debian.org/<replaceable>package</replaceable></literal>) to ensure that the bug has not already been reported. You can then send your own bug report, using the <command>reportbug</command> command, including as much information as possible, especially a complete description of those minimal test cases that will allow anyone to recreate the bug.
nb_no: Hvis alle dine anstrengelser for å løse et problem mislykkes, er det mulig at en løsning ikke er ditt ansvar, og at problemet skyldes en feil i programmet. I dette tilfellet er den riktige fremgangsmåten å rapportere feilen til Debian, eller direkte til oppstrøms utviklere. For å gjøre dette, isoler problemet så mye som mulig, og lag en minimal testsituasjon der problemet kan reproduseres. Hvis du vet hvilket program som er den åpenbare årsaken til problemet, kan du finne den tilsvarende pakken ved hjelp av kommandoen, <command>dpkg -S <replaceable>aktuell_fil</replaceable></command>. Sjekk Bug Tracking System (<literal>https://bugs.debian.org/<replaceable>pakke</replaceable></literal>) for å sikre at feilen ikke allerede er rapportert. Deretter kan du sende din egen feilrapport, ved hjelp av <command>reportbug</command>-kommandoen, inkludert så mye informasjon som mulig, spesielt en fullstendig beskrivelse av disse minimale testtilfeller som vil tillate alle å gjenskape feilen.

source: The elements of this chapter are a means of effectively resolving issues that the following chapters may bring about. Use them as often as necessary!
nb_no: Delene i dette kapitlet er et hjelpemiddel til effektivt å løse problemer som de følgende kapitler kan føre til. Bruk dem så ofte som nødvendig!

source: Manual
vi_vn: Hướng dẫn sử dụng

source: <primary><acronym>RTFM</acronym></primary>
vi_vn: <primary><acronym>HÃY ĐỌC TÀI LIỆU ĐI (RTFM)</acronym></primary>

source: <primary>Free Software Directory</primary>
vi_vn: <primary>Danh bạ Phần mềm Tự do (Free Software Directory)</primary>

source: <primary>Linux Documentation Project</primary>
vi_vn: <primary>Dự án Tài liệu Hướng dẫn Linu(Linux Documentation Project)</primary>
