Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: # See /usr/share/postfix/main.cf.dist for a commented, more complete version # Debian specific: Specifying a file name will cause the first # line of that file to be used as the name. The Debian default # is /etc/mailname. #myorigin = /etc/mailname smtpd_banner = $myhostname ESMTP $mail_name (Debian/GNU) biff = no # appending .domain is the MUA's job. append_dot_mydomain = no # Uncomment the next line to generate "delayed mail" warnings #delay_warning_time = 4h readme_directory = no # TLS parameters smtpd_tls_cert_file=/etc/ssl/certs/ssl-cert-snakeoil.pem smtpd_tls_key_file=/etc/ssl/private/ssl-cert-snakeoil.key smtpd_use_tls=yes smtpd_tls_session_cache_database = btree:${data_directory}/smtpd_scache smtp_tls_session_cache_database = btree:${data_directory}/smtp_scache # See /usr/share/doc/postfix/TLS_README.gz in the postfix-doc package for # information on enabling SSL in the smtp client. smtpd_relay_restrictions = permit_mynetworks permit_sasl_authenticated defer_unauth_destination myhostname = mail.falcot.com alias_maps = hash:/etc/aliases alias_database = hash:/etc/aliases myorigin = /etc/mailname mydestination = mail.falcot.com, falcot.com, localhost.localdomain, localhost relayhost = mynetworks = 127.0.0.0/8 [::ffff:127.0.0.0]/104 [::1]/128 192.168.0.0/16 mailbox_command = procmail -a "$EXTENSION" mailbox_size_limit = 0 recipient_delimiter = + inet_interfaces = all inet_protocols = all
vi_vn: # Tham khảo tập tin /usr/share/postfix/main.cf.dist để xem bản có ghi chú chi tiết hơn # Riêng cho Debian: Đặt tên cho tập tin sẽ dùng # dòng đầu tiên của tập tin đó làm tên. Ngầm định của Debian # là /etc/mailname. #myorigin = /etc/mailname smtpd_banner = $myhostname ESMTP $mail_name (Debian/GNU) biff = no # Thêm vào .domain là nhiệm vụ của MUA. append_dot_mydomain = no # Bỏ dấu ghi chú cho dòng tiếp theo để xuất các cảnh báo cho các thư điện tử bị "hoãn" #delay_warning_time = 4h readme_directory = no # Các tham số TLS smtpd_tls_cert_file=/etc/ssl/certs/ssl-cert-snakeoil.pem smtpd_tls_key_file=/etc/ssl/private/ssl-cert-snakeoil.key smtpd_use_tls=yes smtpd_tls_session_cache_database = btree:${data_directory}/smtpd_scache smtp_tls_session_cache_database = btree:${data_directory}/smtp_scache # Xem /usr/share/doc/postfix/TLS_README.gz trong gói phần mềm postfix-doc để biết # cách bật SSL cho các chương trình khách smtp(smtp client). smtpd_relay_restrictions = permit_mynetworks permit_sasl_authenticated defer_unauth_destination myhostname = mail.falcot.com alias_maps = hash:/etc/aliases alias_database = hash:/etc/aliases myorigin = /etc/mailname mydestination = mail.falcot.com, falcot.com, localhost.localdomain, localhost relayhost = mynetworks = 127.0.0.0/8 [::ffff:127.0.0.0]/104 [::1]/128 192.168.0.0/16 mailbox_command = procmail -a "$EXTENSION" mailbox_size_limit = 0 recipient_delimiter = + inet_interfaces = all inet_protocols = all

source: <emphasis>SECURITY</emphasis> <emphasis>Snake oil</emphasis> SSL certificates
vi_vn: <emphasis>AN NINH</emphasis> Các chứng chỉ SSL <emphasis>Giả</emphasis>

source: The <emphasis>snake oil</emphasis> certificates, like the <emphasis>snake oil</emphasis> “medicine” sold by unscrupulous quacks in old times, have absolutely no value: you cannot rely on them to authenticate the server since they are automatically generated self-signed certificates. However they are useful to improve the privacy of the exchanges.
nb_no: <emphasis>snake oil</emphasis>-sertifikatene, som ble solgt som <emphasis>snake oil</emphasis>-«medisin» av skruppelløse kvakksalvere i gamle dager, har absolutt ingen verdi Du kan ikke stole på dem til å godkjenne tjeneren, for de blir automatisk generert med selvsignerte sertifikater. Men de er nyttige for å bedre personvernet ved utvekslingene.
vi_vn: Các chứng chỉ <emphasis>giả</emphasis>, như những loại "thuốc" <emphasis>giả</emphasis> bán bởi những thầy lang bất cẩn trong xã hội cũ, hoàn toàn không có giá trị: bạn không thể dựa trên chúng để chứng thực máy phục vụ bởi vì chúng là các chứng chỉ được tự ký và được tạo ra tự động. Tuy nhiên chúng rất hữu dụng để tăng cường độ riêng tư của các giao dịch.

source: In general they should only be used for testing purposes, and normal service must use real certificates; these can be generated with the procedure described in <xref linkend="sect.easy-rsa" />.
nb_no: Generelt bør de bare brukes til testformål, og i vanlig drift må en bruke ekte sertifikater. Disse kan genereres med fremgangsmåten beskrevet i <xref linkend="sect.easy-rsa" />.
vi_vn: Nhìn chung chúng chỉ nên được sử dụng cho mục đích kiểm tra, và khi hoạt động bình thường phải sử dụng chứng chỉ thực; những chứng chỉ này được tạo ra theo quy trình được mô tả trong <xref linkend="sect.easy-rsa" />.

source: Configuring Virtual Domains
nb_no: Konfigurering av virtuelle domener
vi_vn: Cấu hình các miền ảo (Virtual Domains)

source: <primary>domain</primary><secondary>virtual</secondary>
nb_no: <primary>domene</primary><secondary>virtuelt</secondary>
vi_vn: <primary>Miền</primary><secondary>ảo</secondary>

source: <primary>virtual domain</primary>
nb_no: <primary>virtuelt domene</primary>
vi_vn: <primary>miền ảo</primary>

source: The mail server can receive emails addressed to other domains besides the main domain; these are then known as virtual domains. In most cases where this happens, the emails are not ultimately destined to local users. Postfix provides two interesting features for handling virtual domains.
nb_no: E-posttjeneren kan motta e-post adressert til andre domener i tillegg til hoveddomenet. Disse er da kjent som virtuelle domener. I de fleste tilfeller der dette skjer, blir e-postene i siste instans ikke ment for lokale brukere. Postfix gir to interessante funksjoner for håndtering av virtuelle domener.
vi_vn: Máy phục vụ thư điện tử có thể nhận các thư gửi đến các miền khác ngoài miền chính; những miền này được biết đến như là miền ảo. Trong đa số các trường hợp mà điều này xảy ra, các thư điện tử thường không gửi tới người dùng nội bộ. Postfix cung cấp hai tính năng hiệu quả để xử lý các miền ảo.

source: <emphasis>CAUTION</emphasis> Virtual domains and canonical domains
nb_no: <emphasis>VÆR VARSOM</emphasis> Virtuelle domener og «kanoniske» (autoriserte) domener
vi_vn: <emphasis>LƯU Ý</emphasis> Các miền ảo và các miền chính thống

source: None of the virtual domains must be referenced in the <literal>mydestination</literal> variable; this variable only contains the names of the “canonical” domains directly associated to the machine and its local users.
nb_no: Ingen av de virtuelle domener må være referert i <literal>mydestination</literal>-variabelen. Denne variabelen inneholder kun navnene på «kanoniske» (autoriserte) domener direkte knyttet til maskinen og dens lokale brukere.
vi_vn: Chẳng có miền ảo nào được liệt kê trong tham biến <literal>mydestination</literal>; tham biến này chỉ chứa các tên của các miền "chính thống" trực tiếp liên quan tới máy này và các những người dùng nội bộ của máy này.

source: Virtual Alias Domains
nb_no: Vituelle alias-domener
vi_vn: Những miền hư danh

source: <primary>alias</primary><secondary>virtual alias domain</secondary>
nb_no: <primary>alias</primary><secondary>virtuelt alias-domene</secondary>
vi_vn: <primary>danh xưng</primary><secondary>miền hư danh</secondary>

source: <primary>virtual domain</primary><secondary>virtual alias domain</secondary>
nb_no: <primary>virtuelt domene</primary><secondary>virtuelt alias-domene</secondary>
vi_vn: <primary>miền ảo</primary><secondary>miền hư danh</secondary>

source: A virtual alias domain only contains aliases, i.e. addresses that only forward emails to other addresses.
nb_no: Et virtuelt alias-domene inneholder kun aliaser, dvs. adresser som bare videresender e-post til andre adresser.
vi_vn: Một miền hư danh (virtual alias domain) chỉ chứa những danh xưng. Chúng là những địa chỉ dùng để chuyển hướng các thư điện tử tới những địa chỉ khác.

source: Such a domain is enabled by adding its name to the <literal>virtual_alias_domains</literal> variable, and referencing an address mapping file in the <literal>virtual_alias_maps</literal> variable.
nb_no: Et slikt domene aktiveres ved å legge navnet sitt til <literal>virtual_alias_domains</literal>-variabelen, og vise til en adressekartleggingsfil i <literal>virtual_alias_maps</literal>-variabelen.
vi_vn: Một miền như vậy được đưa vào sử dụng bằng việc thêm tên của nó vào tham biến <literal>virtual_alias_domains</literal>, và liệt kê tên của một tập tin ánh xạ địa chỉ (address mapping file) vào tham biến <literal>virtual_alias_maps</literal>.

source: Directives to add in the <filename>/etc/postfix/main.cf</filename> file
nb_no: Direktiver til å legge i <filename>/etc/postfix/main.cf</filename>-filen
vi_vn: Những dòng được thêm vào tập tin <filename>/etc/postfix/main.cf</filename>

source: The <filename>/etc/postfix/virtual</filename> file describes a mapping with a rather straightforward syntax: each line contains two fields separated by whitespace; the first field is the alias name, the second field is a list of email addresses where it redirects. The special <literal>@domain.com</literal> syntax covers all remaining aliases in a domain.
nb_no: Filen <filename>/etc/postfix/virtual</filename> beskriver en kartlegging med en ganske grei syntaks: Hver linje inneholder to felt adskilt med mellomrom: Det første feltet er alias-navnet, det andre feltet er en liste over e-postadresser der det omdirigeres. Den spesielle <literal>@domain.com</literal>-syntaksen dekker alle gjenstående aliaser i et domene.
vi_vn: Tập tin <filename>/etc/postfix/virtual</filename> mô tả một ánh xạ bằng một cú pháp đơn giản: mỗi dòng chứa hai trường tách ra bởi một khoảng trắng; trường đầu tiên là danh xưng(alias), trường thứ hai là một danh sách liệt những địa chỉ thư điện tử mà nó sẽ chuyển hướng tới. Địa chỉ đặc biệt <literal>@domain.com</literal> bao gồm tất cả những danh xưng (aliases) trong một miền (domain).

source: Example <filename>/etc/postfix/virtual</filename> file
nb_no: Eksempel <filename>/etc/postfix/virtual</filename>-fil
vi_vn: Ví dụ cho tập tin <filename>/etc/postfix/virtual</filename>

source: webmaster@falcotsbrand.com jean@falcot.com contact@falcotsbrand.com laure@falcot.com, sophie@falcot.com # The alias below is generic and covers all addresses within # the falcotsbrand.com domain not otherwise covered by this file. # These addresses forward email to the same user name in the # falcot.com domain. @falcotsbrand.com @falcot.com
vi_vn: webmaster@falcotsbrand.com jean@falcot.com contact@falcotsbrand.com laure@falcot.com, sophie@falcot.com # Danh xưng dưới đây là rất chung chung và bao gồm tất cả những địa chỉ trong # tên miền falcotsbrand.com vốn trên thực tế không được kể đến trong tập tin này. # Những địa chỉ này chuyển hướng thư đến những địa chỉ với cùng tên người dùng trong # miền falcot.com. @falcotsbrand.com @falcot.com

source: Virtual Mailbox Domains
nb_no: Virtuelle postboksdomener
vi_vn: Những miền có hộp thư ảo

source: <emphasis>CAUTION</emphasis> Combined virtual domain?
nb_no: <emphasis>VÆR VARSOM</emphasis> Kombinert virtuelt domene?
vi_vn: <emphasis>CẢNH BÁO</emphasis> Miền ảo phối hợp

source: Postfix does not allow using the same domain in both <literal>virtual_alias_domains</literal> and <literal>virtual_mailbox_domains</literal>. However, every domain of <literal>virtual_mailbox_domains</literal> is implicitly included in <literal>virtual_alias_domains</literal>, which makes it possible to mix aliases and mailboxes within a virtual domain.
nb_no: Postfix tillater ikke bruk av det samme domenet i både <literal>virtual_alias_domains</literal>, og <literal>virtual_mailbox_domains</literal>. Imidlertid, alle domener hos <literal>virtual_mailbox_domains</literal> er implisitt inkludert i <literal>virtual_alias_domains</literal>, som gjør det mulig å blande aliaser og postkasser i et virtuelt domene.
vi_vn: Postfix không cho phép sử dụng một miền cho cả <literal>virtual_alias_domains</literal> và <literal>virtual_mailbox_domains</literal>. Tuy nhiên, mỗi miền của <literal>virtual_mailbox_domains</literal> được hiểu ngầm là được liệt kê trong <literal>virtual_alias_domains</literal>. Điều đó cho phép trộn lẫn các danh xưng(alias) và các hộp thư trong một miền ảo.

source: <primary>mailbox, virtual domain</primary>
nb_no: <primary>postboks, virtuelt domene</primary>
vi_vn: <primary>hộp thư, miền ảo</primary>

source: <primary>virtual domain</primary><secondary>virtual mailbox domain</secondary>
nb_no: <primary>virtuelt domene</primary><secondary>virtuell postboks-domene</secondary>
vi_vn: <primary>miền ảo</primary><secondary>miền có hộp thư ảo</secondary>

source: Messages addressed to a virtual mailbox domain are stored in mailboxes not assigned to a local system user.
nb_no: Meldinger adressert til et virtuelt postboksdomene er lagret i postkasser som ikke er lagt til en lokal systembruker.
vi_vn: Những tin nhắn được gửi đến một miền có hộp thư ảo được lưu lại trong các hộp thư ảo vốn không dành cho một người dùng nội bộ nào.

source: Enabling a virtual mailbox domain requires naming this domain in the <literal>virtual_mailbox_domains</literal> variable, and referencing a mailbox mapping file in <literal>virtual_mailbox_maps</literal>. The <literal>virtual_mailbox_base</literal> parameter contains the directory under which the mailboxes will be stored.
nb_no: Aktivering av et virtuelt postboksdomene krever navngiving av dette domenet i <literal>virtual_mailbox_domains</literal>-variabelen, og refererer til en postkassekartleggingsfil i <literal>virtual_mailbox_maps</literal>. Parameteren <literal>virtual_mailbox_base</literal> inneholder katalogen der postkasser vil bli lagret.
vi_vn: Bật một miền có hộp thư ảo buộc phải đặt tên miền này trong tham biến <literal>virtual_mailbox_domains</literal>, và liệt kê tập tin ánh xạ hộp thư trong <literal>virtual_mailbox_maps</literal>. Tham biến <literal>virtual_mailbox_base</literal> chứa thư mục vốn được dùng để lưu trữ các hộp thư.

source: The <literal>virtual_uid_maps</literal> parameter (respectively <literal>virtual_gid_maps</literal>) references the file containing the mapping between the email address and the system user (respectively group) that “owns” the corresponding mailbox. To get all mailboxes owned by the same owner/group, the <literal>static:5000</literal> syntax assigns a fixed UID/GID (of value 5000 here).
nb_no: Parameteret <literal>virtual_uid_maps</literal> (respektivt <literal>virtual_gid_maps</literal>) refererer til filen som inneholder kartleggingen mellom e-postadressen og systembrukeren (henholdsvis gruppen) som «eier» den tilsvarende postkassen. For å få alle postkasser som eies av samme eier/gruppe tilordner <literal>static:5000</literal> syntaksen en fast UID/GID (med verdien 5000 her).
vi_vn: Tham biến <literal>virtual_uid_maps</literal> (và <literal>virtual_gid_maps</literal>) tham chiếu một tập tin chứa một ánh xa giữa địa chỉ email và người dùng cấp hệ thống (và nhóm) "sở hữu" hộp thư tương ứng đó. Để có tất cả những hộp thư sở hữu bởi cùng một người/nhóm, cú pháp <literal>static:5000</literal> gán một UID/GID cố định (có giá trị 5000 như trong trường hợp này)

source: Again, the syntax of the <filename>/etc/postfix/vmailbox</filename> file is quite straightforward: two fields separated with whitespace. The first field is an email address within one of the virtual domains, and the second field is the location of the associated mailbox (relative to the directory specified in <emphasis>virtual_mailbox_base</emphasis>). If the mailbox name ends with a slash (<literal>/</literal>), the emails will be stored in the <emphasis>maildir</emphasis> format; otherwise, the traditional <emphasis>mbox</emphasis> format will be used. The <emphasis>maildir</emphasis> format uses a whole directory to store a mailbox, each individual message being stored in a separate file. In the <emphasis>mbox</emphasis> format, on the other hand, the whole mailbox is stored in one file, and each line starting with “<literal>From </literal>” (<literal>From</literal> followed by a space) signals the start of a new message.
nb_no: Igjen, syntaksen til <filename>/etc/postfix/vmailbox</filename>-filen er ganske enkel: To felt adskilt med mellomrom. Det første feltet er en e-postadresse i et av de virtuelle domenene, og det andre feltet er plasseringen av den tilhørende postkasse (i forhold til katalogen spesifisert i <emphasis>virtual_mailbox_base</emphasis>). Hvis postboksen ender med en skråstrek (<literal>/</literal>), blir e-postene lagret i <emphasis>maildir</emphasis>-formatet; ellers blir det tradisjonelle <emphasis>mbox</emphasis>-formatet brukt. Formatet <emphasis>maildir</emphasis> bruker en hel katalog for å lagre en postkasse, hver enkelt melding blir lagret i en egen fil. I <emphasis>mbox</emphasis>-formatet, på den andre siden, er hele postboksen lagret i en fil, og hver linje som starter med «<literal>From </literal>» (<literal>From</literal> fulgt av et mellomrom) signaliserer starten på en ny e-post.
vi_vn: Một lần nữa, cú pháp của tập tin <filename>/etc/postfix/vmailbox</filename> khá dễ hiểu: hai trường tách ra bởi một khoảng trắng. Trường đầu tiên là một địa chỉ thư điện thử nằm trong một trong số những miền ảo, và trường thứ hai là địa chỉ của hộp thư tương ứng (địa chỉ tương đối so với thư mục được chỉ ra trong <emphasis>virtual_mailbox_base</emphasis>). Nếu tên hộp thư điện tử kết thúc bằng một dấu xuyệt (<literal>/</literal>), những thư điện tử sẽ được lưu dưới định dạng <emphasis>maildir</emphasis>; nếu không, định dạng <emphasis>mbox</emphasis> truyền thống sẽ được sử dụng. Định dạng <emphasis>maildir</emphasis> sử dụng toàn bộ một thư mục để lưu trữ một hộp thư, mỗi tin nhắn một được lưu trong một tập tin độc lập." Ngược lại, dưới định dạng <emphasis>mbox</emphasis>, toàn bộ hộp thư điện tử được lưu trong một tập tin, và mỗi dòng bắt đầu bằng “<literal>From </literal>” (<literal>From</literal> theo sau bởi khoảng trắng) báo hiệu tiếp theo là một thông điệp mới.

source: The <filename>/etc/postfix/vmailbox</filename> file
nb_no: Filen <filename>/etc/postfix/vmailbox</filename>
vi_vn: Tập tin <filename>/etc/postfix/vmailbox</filename>

source: # Jean's email is stored as maildir, with # one file per email in a dedicated directory jean@falcot.org falcot.org/jean/ # Sophie's email is stored in a traditional "mbox" file, # with all mails concatenated into one single file sophie@falcot.org falcot.org/sophie
vi_vn: # Thư điện tử của Jean được lưu dưới định dạng maildir, với # mỗi một tập tin cho một thư điện tử nằm trong một thư mục riêng jean@falcot.org falcot.org/jean/ # Thư điện tử của Sophie được lưu trong một tập tin "mbox" truyền thống, # với tất cả các thư điện tử được nối lại với nhau thành một tập tin duy nhất sophie@falcot.org falcot.org/sophie

source: Restrictions for Receiving and Sending
nb_no: Restriksjoner for å motta og sende
vi_vn: Giới hạn cho việc Nhận và Gửi

source: The growing number of unsolicited bulk emails (<emphasis>spam</emphasis>) requires being increasingly strict when deciding which emails a server should accept. This section presents some of the strategies included in Postfix.
nb_no: Det økende antall uønskede e-poster (<emphasis>spam</emphasis>) krever større strenghet når man bestemmer hvilke e-postmeldinger en tjener bør akseptere. Denne seksjonen presenterer noen av de strategiene som inngår i Postfix.
vi_vn: Sự tăng trưởng về số lượng những thư điện tử gửi với số lượng lớn mà không có yêu cầu (<emphasis>spam</emphasis>) buộc phải nghiêm khắc hơn khi quyết định thư điện tử nào một máy phục vụ nên nhận. Phần này trình bày một số chiến thuật được kèm trong Postfix.

source: <emphasis>CULTURE</emphasis> The spam problem
nb_no: <emphasis>KULTUR</emphasis> Spamproblemet
vi_vn: <emphasis>VĂN HÓA</emphasis> Vấn đề spam

source: “Spam” is a generic term used to designate all the unsolicited commercial emails (also known as UCEs) that flood our electronic mailboxes; the unscrupulous individuals sending them are known as spammers. They care little about the nuisance they cause, since sending an email costs very little, and only a very small percentage of recipients need to be attracted by the offers for the spamming operation to make more money than it costs. The process is mostly automated, and any email address made public (for instance, on a web forum, or on the archives of a mailing list, or on a blog, and so on) will be discovered by the spammers' robots, and subjected to a never-ending stream of unsolicited messages.
nb_no: «Spam» er et generelt begrep som brukes for å betegne alle uønskede kommersielle e-poster (også kjent som UCES) som oversvømmer våre elektroniske postkasser. De skruppelløse individer som sender dem, er kjent som spammere. De bryr seg lite om de ordensforstyrrelser de forårsaker, siden det å sende en e-post koster svært lite, og bare en svært liten andel av mottakerne trenger å bli tiltrukket av tilbudene for at spamming-operasjonen tjener mer penger enn det koster. Prosessen er for det meste automatisert, og en offentliggjort e-postadresse (for eksempel på et nettforum, registrert på en adresseliste, eller på en blogg, og så videre) vil bli oppdaget av spammeroboter, og utsatt for en endeløs strøm av uønskede meldinger.
vi_vn: “Spam” là một khái niệm chung bao quát tất cả những thư điện tử mang tính thương mại không có ai yêu cầu nhận (cũng được biết đến là các UCE) vốn làm ngập úng các hộp thư điện tử; các cá nhân vô trách nhiệm gửi chúng ra được gọi là những spammer. Họ quan tâm rất ít về những thứ họ gây ra, bởi việc gửi một thư điện tử tốn rất ít tiền, và chỉ cần có một lượng nhỏ trong những người nhận bị thu hút bởi những lời mời chào này là làm cho công việc gửi thư rác thu nhiều lời hơn là lỗ. Quy trình thì gần như là tự động hoàn toàn, và bất kỳ một địa chỉ thư điện tử nào được sử dụng công cộng (ví dụ như, trên một diễn dàn trên mạng, hoặc trên những kho lưu trữ của một bó thư điện tử (mailing list), hoặc trên một nhật ký điện tử(blog), và vâng vâng) sẽ được khám phá ra bởi những con rô-bốt của những spammer, và sẽ dễ nhận một chuỗi dài vô tận những thông điệp mà không ai yêu cầu.
