Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: CUPS is an elegant solution for printing from a Linux workstation to a printer shared by a Windows machine. When the <emphasis role="pkg">smbclient</emphasis> is installed, CUPS allows installing Windows shared printers automatically.
nb_no: CUPS er en elegant løsning for utskrift fra en Linux-arbeidsstasjon til en skriver som deles av en Windows-maskin. Når <emphasis role="pkg">smbclient</emphasis> er installert, tillater CUPS automatisk installasjon av Windows-delte skrivere.
vi_vn: CUPS là một giải pháp tiện lợi cho in ấn từ một máy trạm Linux sang một máy in được chia sẻ bởi một máy Windows. Khi <emphasis role="pkg">smbclient</emphasis> được cài đặt, CUPS cho phép cài đặt các máy in được chia sẻ bởi Windows một cách tự động.

source: Here are the required steps:
nb_no: Her er skrittene som kreves:
vi_vn: Đây là các bước bắt buộc:

source: Enter the CUPS configuration interface: <literal>http://localhost:631/admin</literal>
nb_no: Bruk CUPS konfigurasjonsgrensesnittet:<literal>http://localhost:631/admin</literal>
vi_vn: Nhập vào địa chỉ của giao diện cấu hình CUPS: <literal>http://localhost:631/admin</literal>

source: Click on “Add Printer”.
nb_no: Klikk på «Legg til skriver».
vi_vn: Nhấn chuộc vào “Thêm Máy In (Add Printer)”.

source: Choose the printer device, pick “Windows Printer via SAMBA”.
nb_no: Velg skriverenheten, plukk ut «Windows Printer via SAMBA».
vi_vn: Chọn thiết bị in, chọn “Máy in Windows thông qua SAMBA“.

source: Enter the connection URI for the network printer. It should look like the following:
nb_no: Bruk tilkoblings-URI-en (angi URI) for nettverksskriveren. Den skal se ut som følger:
vi_vn: Nhập đường dẫn URI cho kết nối đến máy in mạng. Nó giống như sau:

source: Enter the name that will uniquely identify this printer. Then enter the description and location of the printer. Those are the strings that will be shown to end users to help them identify the printers.
nb_no: Skriv inn navnet som unikt identifiserer denne skriveren. Deretter skriver du inn beskrivelsen og plasseringen av skriveren. De er strengene som skal vises til sluttbrukere for å hjelpe dem med å identifisere skriverne.
vi_vn: Nhập tên vốn sẽ nhận diện được ngay máy in này. Sau đó nhập mô tả và địa điểm của máy in. Đó là những chuỗi ký tự sẽ được xuất ra cho những người dùng cuối để giúp họ nhận ra các máy in.

source: Indicate the manufacturer/model of the printer, or directly provide a working printer description file (PPD).
nb_no: Indiker produsenten/skrivermodellen, eller lever/gi direkte en skriverbeskrivelsesfil (PPD (PostScript Printer Description)) som virker.
vi_vn: Báo nhà sản xuất/mô-đen của máy in hoặc trực tiếp cung cấp một tập tin mô tả máy in đang chạy tốt (Printer Description file - PPD).

source: Voilà, the printer is operational!
nb_no: Voilà,skriveren er operativ!
vi_vn: Voilà, máy in đã hoạt động!

source: HTTP/FTP Proxy
nb_no: HTTP/FTP-mellomtjener
vi_vn: Trạm chuyển hướng HTTP/FTP

source: An HTTP/FTP proxy acts as an intermediary for HTTP and/or FTP connections. Its role is twofold:
nb_no: En HTTP/FTP-mellomtjener fungerer som et mellomledd for HTTP- og/eller FTP-tilkoblinger. Dens rolle er todelt:
vi_vn: Một trạm chuyển hướng HTTP/FTP hoạt động như một bên trung gian cho các kết nối HTTP và/hoặc FTP. Vai trò của nó có hai mặt:

source: Caching: recently downloaded documents are copied locally, which avoids multiple downloads.
nb_no: Hurtiglager: Nylig nedlastede dokumenter kopieres lokalt, noe som hindrer flere/multiple nedlastinger.
vi_vn: Bộ nhớ tạm thời: các tài liệu được tải về gần đây được sao chép nội bộ, vốn tránh được sự trùng lặp trong việc tải xuống.

source: Filtering server: if use of the proxy is mandated (and outgoing connections are blocked unless they go through the proxy), then the proxy can determine whether or not the request is to be granted.
nb_no: Filtreringstjener: Kreves bruk av mellomtjeneren (og utgående tilkoblinger blokkeres med mindre de går gjennom mellomtjeneren), da kan mellomtjeneren avgjøre om forespørselen skal imøtekommes.
vi_vn: Máy phục vụ cho việc lọc: nếu bắt buộc phải dùng trạm chuyển hướng (và các kết nối đi ra bên ngoài bị chặn trừ khi chúng đi thông qua trạm chuyển hướng), trạm chuyển hướng có thể quyết định một yêu cầu có được chấp thuận hay không.

source: <primary>proxy cache</primary>
nb_no: <primary>mellomtjener lager</primary>
vi_vn: <primary>bộ nhớ tạm thời của trạm chuyển hướng</primary>

source: Falcot Corp selected Squid as their proxy server.
nb_no: Falcot Corp valgte Squid som sin mellomtjener.
vi_vn: Công ty Falcot đã lựa chọn Squid làm máy phục vụ trạm chuyển hướng của họ.

source: Installing
nb_no: Å installere
vi_vn: Cài đặt

source: The <emphasis role="pkg">squid3</emphasis> Debian package only contains the modular (caching) proxy. Turning it into a filtering server requires installing the additional <emphasis role="pkg">squidguard</emphasis> package. In addition, <emphasis role="pkg">squid-cgi</emphasis> provides a querying and administration interface for a Squid proxy.
nb_no: Debian-pakken <emphasis role="pkg">squid3</emphasis> inneholder bare den modulære (mellomlagring/caching) tjener. Å snu den til en filtreringstjener krever installering av tilleggspakken <emphasis role="pkg">squidguard</emphasis>. I tillegg gir <emphasis role="pkg">squid-cgi</emphasis> et forespørsels- og administrasjonsgrensesnitt for en Squid-mellomtjener.
vi_vn: Gói phần mềm Debian <emphasis role="pkg">squid3</emphasis> chỉ chứa trạm chuyển hướng có cấu hình mô-đun (có bộ nhớ tạm). Biến nó thành một máy phục vụ lọc buộc phải cài đặt thêm gói phần mềm <emphasis role="pkg">squidguard</emphasis>. Ngoài ra, <emphasis role="pkg">squid-cgi</emphasis> cung cấp một giao diện truy xuất và quản trị cho một trạm trung chuyển Squid.

source: Prior to installing, care should be taken to check that the system can identify its own complete name: the <command>hostname -f</command> must return a fully-qualified name (including a domain). If it does not, then the <filename>/etc/hosts</filename> file should be edited to contain the full name of the system (for instance, <literal>arrakis.falcot.com</literal>). The official computer name should be validated with the network administrator in order to avoid potential name conflicts.
nb_no: Før du installerer, er det viktig å ta hensyn til at systemet kan identifisere sitt eget fullstendige navn: <command>hostname -f</command> må returnere et fullt kvalifisert navn (inkludert et domene). Hvis den ikke gjør det, så skal <filename>/etc/hosts</filename>-filen redigeres til å inneholde fullt navn på systemet (for eksempel <literal>arrakis.falcot.com</literal>). Det offisielle navnet på datamaskinen skal godkjennes av nettverksadministratoren for å unngå potensielle navnekonflikter .
vi_vn: Trước khi cài đặt, phải cẩn thận kiểm tra xem hệ thống có nhận diện được tên đầy đủ của nó không: lệnh <command>hostname -f</command> phải trả về một tên đầy đủ (bao gồm cả tên miền). Nếu không, tập tin <filename>/etc/hosts</filename> phải được sửa đổi để chứa tên đầy đủ của hệ thống (ví dụ, <literal>arrakis.falcot.com</literal>). Tên chính thức của máy tính nên được kiểm tra với nhà quản trị mạng để tránh xung đột tên có thể có.

source: Configuring a Cache
nb_no: Å konfigurere et hurtiglager
vi_vn: Cấu hình một Bộ nhớ tạm thời

source: Enabling the caching server feature is a simple matter of editing the <filename>/etc/squid3/squid.conf</filename> configuration file and allowing machines from the local network to run queries through the proxy. The following example shows the modifications made by the Falcot Corp administrators:
nb_no: Å aktivere funksjonen til hurtiglagstjener er så enkelt som å redigere <filename>/etc/squid3/squid.conf</filename>-konfigurasjonsfilen, og la maskinene fra det lokale nettverket kjøre forespørsler gjennom mellomtjeneren. Det følgende eksemplet viser modifikasjonene Falcot Corp-administratorene har gjort:
vi_vn: Kích hoạt tính năng bộ nhớ tạm thời chỉ đơn giản là chỉnh sửa tập tin cấu hình <filename>/etc/squid3/squid.conf</filename> và cho phép các máy tính từ miền nội bộ chạy các truy xuất thông qua trạm chuyển hướng. Ví dụ sau cho thấy những thay đổi được tạo ra bởi các nhà quản trị hệ thống của Công ty Falcot:

source: The <filename>/etc/squid3/squid.conf</filename> file (excerpts)
nb_no: <filename>/etc/squid3/squid.conf</filename>-filen (utdrag)
vi_vn: Tập tin <filename>/etc/squid3/squid.conf</filename> (những trích đoạn)

source: # INSERT YOUR OWN RULE(S) HERE TO ALLOW ACCESS FROM YOUR CLIENTS # Example rule allowing access from your local networks. Adapt # to list your (internal) IP networks from where browsing should # be allowed acl our_networks src 192.168.1.0/24 192.168.2.0/24 http_access allow our_networks http_access allow localhost # And finally deny all other access to this proxy http_access deny all
vi_vn: # CHÈN NHỮNG QUY TẮC CỦA BẠN VÀO ĐÂY ĐỂ CHO PHÉP CÁC CHƯƠNG TRÌNH KHÁCH TRUY CẬP # Quy tắc ví dụ cho phép truy cập từ những mạng nội bộ. Chỉnh sửa nó # để liệt kê các mạng IP nội bộ của bạn nơi mà hành động duyệt nên được # cho phép acl our_networks src 192.168.1.0/24 192.168.2.0/24 http_access allow our_networks http_access allow localhost # Và cuối cùng từ chối tất các truy cập khác đến trạm chuyển hướng này http_access deny all

source: Configuring a Filter
nb_no: Å sette opp et filter
vi_vn: Cấu hình một Bộ lọc

source: <command>squid</command> itself does not perform the filtering; this action is delegated to <command>squidGuard</command>. The former must then be configured to interact with the latter. This involves adding the following directive to the <filename>/etc/squid3/squid.conf</filename> file:
nb_no: <command>squid</command> utfører ikke filtreringen selv; den er delegert til <command>squidGuard</command>. Den førstnevnte må da være konfigurert til å samvirke med den sistnevnte. Dette innebærer å legge følgende direktiv til <filename>/etc/squid3/squid.conf</filename>-filen:
vi_vn: <command>squid</command> bản thân nó không thực hiện lọc; hành động này được chuyển cho <command>squidGuard</command>. Cái đầu tiên phải được cấu hình để tương tác với cái sau. Điều này bao gồm thêm chỉ thị sau vào tập tin <filename>/etc/squid3/squid.conf</filename>:

source: The <filename>/usr/lib/cgi-bin/squidGuard.cgi</filename> CGI program also needs to be installed, using <filename>/usr/share/doc/squidguard/examples/squidGuard.cgi.gz</filename> as a starting point. Required modifications to this script are the <varname>$proxy</varname> and <varname>$proxymaster</varname> variables (the name of the proxy and the administrator's contact e-mail, respectively). The <varname>$image</varname> and <varname>$redirect</varname> variables should point to existing images representing the rejection of a query.
nb_no: CGI-programmet <filename>/usr/lib/cgi-bin/squidGuard.cgi</filename> trenger også å bli installert, ved å bruke <filename>/usr/share/doc/squidguard/examples/squidGuard.cgi.gz</filename> som startpunkt. Nødvendige endringer i dette skriptet er <varname>$proxy</varname> og <varname>$proxymaster</varname>-variablene (navnet på henholdsvis mellomtjener og administratorens kontakt-e-post). Variablene <varname>$image</varname> og <varname>$redirect</varname> skal peke til eksisterende bilder som viser avvisning av en forespørsel.
vi_vn: Chương trình CGI <filename>/usr/lib/cgi-bin/squidGuard.cgi</filename> cũng cần được cài đặt, sử dụng <filename>/usr/share/doc/squidguard/examples/squidGuard.cgi.gz</filename> làm điểm khởi động. Các điều chỉnh bắt buộc với đoạn kịch bản này là các biến <varname>$proxy</varname> và <varname>$proxymaster</varname> (tên của trạm chuyển hướng và địa chỉ thư điện tử của nhà quản trị, theo thứ tự). Các biến <varname>$image</varname> và <varname>$redirect</varname> nên chỉ đến các tấm hình đại diện cho sự từ chối yêu cầu.

source: The filter is enabled with the <command>service squid3 reload</command> command. However, since the <emphasis role="pkg">squidguard</emphasis> package does no filtering by default, it is the administrator's task to define the policy. This can be done by creating the <filename>/etc/squid3/squidGuard.conf</filename> file (using <filename>/etc/squidguard/squidGuard.conf.default</filename> as template if required).
nb_no: Filteret er aktivert med <command>service squid3 reload</command>-kommandoen. Imidlertid, ettersom <emphasis role="pkg">squidguard</emphasis>-pakken utfører ikke filtrering som standard; er det administratorens oppgave å definere oppgaven. Dette kan gjøres ved å lage <filename>/etc/squid3/squidGuard.conf</filename>-filen (som bruker <filename>/etc/squidguard/squidGuard.conf.default</filename> som mal hvis det kreves).
vi_vn: Bộ lọc phải được kích hoạt với lệnh <command>service squid3 reload</command>. Tuy nhiên, bởi gói phần mềm <emphasis role="pkg">squidguard</emphasis> không thực hiện lọc theo ngầm định, ra chính sách là nhiệm vụ của nhà quản trị. Điều này có thể được thực hiện bằng việc tạo tập tin <filename>/etc/squid3/squidGuard.conf</filename> (sử dụng <filename>/etc/squidguard/squidGuard.conf.default</filename> như một bản mẫu nếu bị buộc).

source: The working database must be regenerated with <command>update-squidguard</command> after each change of the <command>squidGuard</command> configuration file (or one of the lists of domains or URLs it mentions). The configuration file syntax is documented on the following website: <ulink type="block" url="http://www.squidguard.org/Doc/configure.html" />
nb_no: Den gjeldende databasen må regenereres med <command>update-squidguard</command> etter hver forandring i <command>squidGuard</command>-konfigurasjonsfilen (eller en av de lister over domener eller nettadresser den nevner). Konfigurasjonsfilssyntaksen er dokumentert på den følgende nettsiden: <ulink type="block" url="http://www.squidguard.org/Doc/configure.html" />
vi_vn: Cơ sở dữ liệu hiện tại phải được tái tạo lại với <command>update-squidguard</command> sau khi bất kỳ thay đổi nào của tập tin cấu hình <command>squidGuard</command> (hoặc một trong những miền máy tính hoặc các URL nó đề cập). Cú pháp của tập tin cấu hình được ghi lại trong trang web sau: <ulink type="block" url="http://www.squidguard.org/Doc/configure.html" />

source: <emphasis>ALTERNATIVE</emphasis> DansGuardian
nb_no: <emphasis>ALTERNATIV</emphasis> DansGuardian
vi_vn: <emphasis>LỰA CHỌN THAY THẾ</emphasis> DansGuardian

source: The <emphasis role="pkg">dansguardian</emphasis> package is an alternative to <emphasis>squidguard</emphasis>. This software does not simply handle a blacklist of forbidden URLs, but it can take advantage of the PICS system (<emphasis>Platform for Internet Content Selection</emphasis>) to decide whether a page is acceptable by dynamic analysis of its contents.
nb_no: Pakken <emphasis role="pkg">dansguardian</emphasis> er et alternativ til <emphasis>squidguard</emphasis>. Denne programvaren håndterer ikke bare en svarteliste med forbudte URL-er, men den kan nyttiggjøre seg PICS-systemet (<emphasis>Platform for Internet Content Selection</emphasis>) for å avgjøre om en side er akseptabel ved en dynamisk analyse av innholdet.
vi_vn: Gói phần mềm <emphasis role="pkg">dansguardian</emphasis> là một lựa chọn thay thế cho <emphasis>squidguard</emphasis>. Phần mềm này không đơn giản là xử lý một danh sách đen của các URL bị cấm, nhưng nó có thể tận dụng hệ thống PICS (<emphasis>Nền tảng cho Việc Lựa chọn Nội dung InternetPlatform for Internet Content Selection</emphasis>) để quyết định một trang web có thể chấp nhận được bởi quá trình phân tích động của những nội dung của nó.

source: LDAP Directory
nb_no: LDAP-mappe
vi_vn: Danh bạ LDAP

source: <primary>directory, LDAP</primary>
nb_no: <primary>mappe, LDAP</primary>
vi_vn: <primary>danh bạ, LDAP</primary>

source: OpenLDAP is an implementation of the LDAP protocol; in other words, it is a special-purpose database designed for storing directories. In the most common use case, using an LDAP server allows centralizing management of user accounts and the related permissions. Moreover, an LDAP database is easily replicated, which allows setting up multiple synchronized LDAP servers. When the network and the user base grows quickly, the load can then be balanced across several servers.
nb_no: OpenLDAP er en implementering av LDAP-protokollen; med andre ord, den er en database med spesialformål å lagre kataloger. I det mest vanlige brukertilfellet, tillater bruk av en LDAP-tjener sentral forvaltning av brukerkontoer og de tilhørende rettighetene. Dessuten er det lett å kopiere LDAP-databasen, som tillater oppsett av flere synkroniserte LDAP-tjenere. Når nettverket og brukerbasen vokser raskt, kan lasten så bli balansert over flere tjenere.
vi_vn: OpenLDAP là một sự hiện thực hoá của giao thức LDAP; nói cách khác, nó là một cơ sở dữ liệu chuyên dùng để lưu trữ danh bạ. Trong trường hợp sử dụng phổ biến nhất, sử dụng một máy phục vụ LDAP cho phép quản lý tập trung các tài khoản người dùng và các quyền sử dụng liên quan. Hơn thế, một cơ sở dữ liệu LDAP rất dễ sao chép, cho phép cài đặt nhiều máy phục vụ LDAP đồng bộ với nhau. Khi mạng và lượng người sử dụng tăng nhanh, tải có thể được cân bằng giữa nhiều máy phục vụ.

source: LDAP data is structured and hierarchical. The structure is defined by “schemas” which describe the kind of objects that the database can store, with a list of all their possible attributes. The syntax used to refer to a particular object in the database is based on this structure, which explains its complexity.
nb_no: LDAP-data er strukturert og hierarkisk. Strukturen er definert av «skjemaer», som beskriver den type objekter som databasen kan lagre, med en liste over alle de mulige egenskapene deres. Syntaksen brukes for å referere til et bestemt objekt i databasen basert på denne strukturen, noe som forklarer kompleksiten.
vi_vn: Dữ liệu LDAP có cấu trúc và có tính hệ thống. Cấu trúc được định nghĩa bởi các “schemas” vốn mô tả các loại đối tượng mà cơ sở dữ liệu lưu trữ, cùng với một danh sách tất cả các đặc trưng có thể có của chúng. Cú pháp được sử dụng để xác định một đối tượng nào đó trong cơ sở dữ liệu được hình thành dựa trên cấu trúc này, vốn cho thấy sự phức tạp của nó.

source: The <emphasis role="pkg">slapd</emphasis> package contains the OpenLDAP server. The <emphasis role="pkg">ldap-utils</emphasis> package includes command-line tools for interacting with LDAP servers.
nb_no: Pakken <emphasis role="pkg">slapd</emphasis> inneholder den åpne OpenLDAP-tjeneren. Pakken <emphasis role="pkg">ldap-utils</emphasis> inneholder kommandolinjeverktøy for samhandling med LDAP-tjenere.
vi_vn: Gói phần mềm <emphasis role="pkg">slapd</emphasis> chứa máy phục vụ OpenLDAP. Gói phần mềm <emphasis role="pkg">ldap-utils</emphasis> bao gồm cả các công cụ dòng lệnh để tương tác với các máy phục vụ LDAP.

source: Installing <emphasis role="pkg">slapd</emphasis> usually asks very few questions and the resulting database is unlikely to suit your needs. Fortunately a simple <command>dpkg-reconfigure slapd</command> will let you reconfigure the LDAP database with more details:
nb_no: Å installere <emphasis role="pkg">slapd</emphasis> stiller vanligvis få spørsmål, og det er usannsynlig at den resulterende databasen dekker dine behov. Heldigvis, en enkel <command>dpkg-reconfigure slapd</command> vil la deg konfigurere LDAP-databasen med flere detaljer:
vi_vn: Cài đặt <emphasis role="pkg">slapd</emphasis> thường hỏi rất ít câu hỏi và cơ sở dữ liệu có được thường ít đáp ứng được các nhu cầu của bạn. May mắn thay, dòng lệnh đơn giản <command>dpkg-reconfigure slapd</command> sẽ cho phép bạn cấu hình lại cơ sở dữ liệu LDAP với nhiều chi tiết hơn:

source: Omit OpenLDAP server configuration? No, of course, we want to configure this service.
nb_no: Utelate OpenLDAP-tjeneroppsettet? Nei, selvfølgelig ønsker vi å konfigurere denne tjenesten.
vi_vn: Bỏ qua cấu hình máy phục vụ OpenLDAP? Dĩ nhiên là không, chúng ta muốn cấu hình dịch vụ này.

source: DNS domain name: “<literal>falcot.com</literal>”.
nb_no: DNS-domenenavn: «<literal>falcot.com</literal>».
vi_vn: Tên miền DNS: “<literal>falcot.com</literal>”.

source: Organization name: “Falcot Corp”.
nb_no: Organisasjonsnavn: «Falcot Corp».
vi_vn: Tên tổ chức: “Falcot Corp”.

source: An administrative passwords needs to be typed in.
nb_no: Et administrativt passord må skrives inn.
vi_vn: Các mật mã quản trị cần phải được nhập vào.

source: Database backend to use: “MDB”.
vi_vn: Cơ sở dữ liệu để sử dụng ở hậu phương: “MDB”.

source: Do you want the database to be removed when <emphasis role="pkg">slapd</emphasis> is purged? No. No point in risking losing the database in case of a mistake.
nb_no: Ønsker du at databasen skal fjernes når <emphasis role="pkg">slapd</emphasis> tvinges? Nei. Det er ingen vits i å risikere å miste databasen på grunn av en feil.
vi_vn: Bạn có muốn cơ sở dữ liệu được tháo bỏ khi <emphasis role="pkg">slapd</emphasis> bị xóa? Không. Sẽ không có nghĩa gì khi mạo hiểm mất cơ sở dữ liệu nếu có lỗi phát sinh.

source: Move old database? This question is only asked when the configuration is attempted while a database already exists. Only answer “yes” if you actually want to start again from a clean database, for instance if you run <command>dpkg-reconfigure slapd</command> right after the initial installation.
nb_no: Flytte den gamle databasen? Dette spørsmålet blir bare spurt når konfigurasjonen er forsøkt, og en database allerede eksisterer. Bare svar «ja» hvis du faktisk ønsker å starte på nytt med en ren database; for eksempel hvis du kjører <command>dpkg-reconfigure slapd</command> rett etter den første installasjonen.
vi_vn: Di chuyển cơ sở dữ liệu cũ? Câu hỏi này chỉ được hỏi khi cấu hình này được thử trong khi cơ sở dữ liệu đã tồn tại. Chỉ trả lời “yes” nếu bạn thực sự muốn bắt đầu lại từ đầu với một cơ sở dữ liệu trống, ví dụ như nếu bạn chạy lệnh <command>dpkg-reconfigure slapd</command> ngay sau lần cài đặt đầu tiên.

source: Allow LDAPv2 protocol? No, there is no point in that. All the tools we are going to use understand the LDAPv3 protocol.
nb_no: Tillate LDAPv2-protokoll? Nei, det er ingen vits i det. Alle verktøyene vi skal bruke forstår LDAPv3-protokollen.
vi_vn: Cho phép giao thức LDAP phiên bản số 2? Không, không có lý gì cả. Tất cả các công cụ chúng ta sẽ sử dụng đều đã hiểu được giao thức LDAP phiên bản số 3.

source: <emphasis>BACK TO BASICS</emphasis> LDIF format
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> LDIF-format
vi_vn: <emphasis>TRỞ VỀ CƠ BẢN</emphasis> Định dạng LDIF
