Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: An LDIF file (<emphasis>LDAP Data Interchange Format</emphasis>) is a portable text file describing the contents of an LDAP database (or a portion thereof); this can then be used to inject the data into any other LDAP server.
nb_no: En LDIF-file (<emphasis>LDAP Data Interchange Format</emphasis>) er en flyttbar tekstfil som beskriver innholdet i en LDAP-database (eller en del av den); denne kan så brukes til å injisere data inn i en hvilken som helst annen LDAP-tjener.
vi_vn: Một tập tin LDIF (<emphasis>Định dạng Trao đổi Dữ liệu LDAP(LDAP Data Interchange Format)</emphasis>) là một tập tin chữ cơ động mô tả nội dung của một cơ sở dữ liệu LDAP (hoặc chỉ một phần của nó); điều này có thể được sử dụng để chèn dữ liệu vào bất kỳ một máy phục vụ LDAP nào khác.

source: A minimal database is now configured, as demonstrated by the following query:
nb_no: Nå er en minimal database konfigurert, som demonstrert fra følgende spørring:
vi_vn: Cơ sở dữ liệu tối thiểu đã được cấu hình, như được trình bày trong truy xuất sau:

source: The query returned two objects: the organization itself, and the administrative user.
nb_no: Spørringen returnerte to objekter: Organisasjonen selv, og den administrative brukeren.
vi_vn: Truy xuất trả về hai đối tượng: tổ chức và người dùng quản trị.

source: Filling in the Directory
nb_no: Å fylle ut mappen
vi_vn: Điền vào Danh bạ

source: Since an empty database is not particularly useful, we are going to inject into it all the existing directories; this includes the users, groups, services and hosts databases.
nb_no: Ettersom en tom database ikke er spesielt nyttig, har vi tenkt å injisere i den i alle de eksisterende katalogene; Dette inkluderer brukerne, gruppene, tjenestene og vertsdatabasene.
vi_vn: Bởi một cơ sở dữ liệu trống không thực sự tiện dụng, chúng ta sẽ chèn tất cả các thư mục hiện có vào nó; điều này bao gồm những người sử dụng, các nhóm, các dịch vụ và các cơ sở dữ liệu về máy tính.

source: The <emphasis role="pkg">migrationtools</emphasis> package provides a set of scripts dedicated to extract data from the standard Unix directories (<filename>/etc/passwd</filename>, <filename>/etc/group</filename>, <filename>/etc/services</filename>, <filename>/etc/hosts</filename> and so on), convert this data, and inject it into the LDAP database.
nb_no: Pakken <emphasis role="pkg">migrationtools</emphasis> inneholder et sett skript øremerket til å hente ut data fra standard Unix-kataloger (<filename>/etc/passwd</filename>, <filename>/etc/group</filename>, <filename>/etc/services</filename>, <filename>/etc/hosts</filename>, og så videre), konvertere disse dataene, og sette den inn i LDAP-databasen.
vi_vn: Gói phần mềm <emphasis role="pkg">migrationtools</emphasis> cung cấp một tập hợp các kịch bản dành để trích xuất dữ liệu từ các thư mục Unix chuẩn (<filename>/etc/passwd</filename>, <filename>/etc/group</filename>, <filename>/etc/services</filename>, <filename>/etc/hosts</filename> và vâng vâng), chuyển đổi dữ liệu này và chèn nó vào cơ sở dữ liệu LDAP.

source: Once the package is installed, the <filename>/etc/migrationtools/migrate_common.ph</filename> must be edited; the <varname>IGNORE_UID_BELOW</varname> and <varname>IGNORE_GID_BELOW</varname> options need to be enabled (uncommenting them is enough), and <varname>DEFAULT_MAIL_DOMAIN</varname>/<varname>DEFAULT_BASE</varname> need to be updated.
nb_no: Så snart pakken er installert, må <filename>/etc/migrationtools/migrate_common.ph</filename> redigeres; <varname>IGNORE_UID_BELOW</varname> og <varname>IGNORE_GID_BELOW</varname>-valgene må aktiveres (å avkommentere dem er nok), og <varname>DEFAULT_MAIL_DOMAIN</varname>/<varname>DEFAULT_BASE</varname> trenger oppdatering.
vi_vn: Một khi gói phần mềm đã được cài đặt, <filename>/etc/migrationtools/migrate_common.ph</filename> phải được chỉnh sửa; các lựa chọn <varname>IGNORE_UID_BELOW</varname> và <varname>IGNORE_GID_BELOW</varname> cần phải được kích hoạt (làm cho chúng không phải ghi chú nữa là đủ), và <varname>DEFAULT_MAIL_DOMAIN</varname>/<varname>DEFAULT_BASE</varname> cần phải được cập nhật.

source: The actual migration operation is handled by the <command>migrate_all_online.sh</command> command, as follows:
nb_no: Selve overføringsoperasjonen håndteres av <command>migrate_all_online.sh</command>-kommandoen, som følger:
vi_vn: Hành động di chuyển thực sự được thực hiện bởi lệnh <command>migrate_all_online.sh</command>, như sau:

source: The <command>migrate_all_online.sh</command> asks a few questions about the LDAP database into which the data is to be migrated. <xref linkend="tab-migrate-all" xrefstyle="select: label nopage" /> summarizes the answers given in the Falcot use-case.
nb_no: <command>migrate_all_online.sh</command> stiller noen få spørsmål om LDAP-databasen som dataene skal overføres til. <xref linkend="tab-migrate-all" xrefstyle="select: label nopage" /> oppsummerer svarene fra Falcots brukereksempel.
vi_vn: Lệnh <command>migrate_all_online.sh</command> hỏi một số câu hỏi về cơ sở dữ liệu LDAP mà dữ liệu sẽ được di chuyển vào. <xref linkend="tab-migrate-all" xrefstyle="select: label nopage" /> tóm tắt các câu hỏi được đưa ra trong trường hợp của Falcot.

source: Answers to questions asked by the <command>migrate_all_online.sh</command> script
nb_no: Svar på spørsmål forespurt av <command>migrate_all_online.sh</command>-skriptet
vi_vn: Các câu trả lời cho những câu hỏi được hỏi bởi kịch bản <command>migrate_all_online.sh</command>

source: Question
nb_no: Spørsmål
vi_vn: Câu hỏi

source: Answer
nb_no: Svar
vi_vn: Câu trả lời

source: X.500 naming context
nb_no: X.500 navnekontekst
vi_vn: Ngữ cảnh đặt tên X.500

source: LDAP server hostname
nb_no: Vertsnavnet på LDAP-serveren
vi_vn: Tên máy phục vụ LDAP

source: Manager DN
vi_vn: Tên Đặc trưng(Distinguished name - DN) của nhà quản lý

source: the administrative password
nb_no: det administrative passordet
vi_vn: mật mã của quản trị viên

source: Create DUAConfigProfile
nb_no: Å lage DUAConfigProfile
vi_vn: Tạo DUAConfigProfile

source: We deliberately ignore migration of the <filename>/etc/aliases</filename> file, since the standard schema as provided by Debian does not include the structures that this script uses to describe email aliases. Should we want to integrate this data into the directory, the <filename>/etc/ldap/schema/misc.schema</filename> file should be added to the standard schema.
nb_no: Vi lar bevisst være å flytte <filename>/etc/aliases</filename>-filen, siden standardskjemaet som leveres av Debian ikke inkluderer strukturer som dette skriptet bruker til å beskrive e-postaliaser. Skulle vi ønske å integrere disse dataene i katalogen, skal <filename>/etc/ldap/schema/misc.schema</filename>-filen legges til standardskjemaet.
vi_vn: Chúng ta chủ ý phớt lờ việc chuyển dời của tập tin <filename>/etc/aliases</filename>, bởi sơ đồ (schema) chuẩn cung cấp bởi Debian không bao gồm các cấu trúc mà kịch bản này sử dụng để mô tả các danh xưng (alias) thư điện tử. Nếu bạn muốn tích hợp dữ liệu này vào một thư mục, tập tin <filename>/etc/ldap/schema/misc.schema</filename> nên được thêm vào sơ đồ (schema) chuẩn.

source: <emphasis>TOOL</emphasis> Browsing an LDAP directory
nb_no: <emphasis>VERKTØY</emphasis> Søke i en LDAP-mappe
vi_vn: <emphasis>CÔNG CỤ</emphasis> Duyệt qua một thư mục LDAP

source: The <command>jxplorer</command> command (in the package of the same name) is a graphical tool allowing to browse and edit an LDAP database. It is an interesting tool that provides an administrator with a good overview of the hierarchical structure of the LDAP data.
nb_no: Kommandoen <command>jxplorer</command> (i pakken med samme navn) er et grafisk verktøy som tillater å bla gjennom og redigere en LDAP-database. Dette er et interessant verktøy som gir en administrator en god oversikt over den hierarkiske strukturen i LDAP-dataene.
vi_vn: Lệnh <command>jxplorer</command> (trong gói phần mềm cùng tên) là một công cụ có giao diện đồ hoạ cho phép duyệt và chỉnh sửa một cơ sở dữ liệu LDAP. Đây là một công cụ thú vị cung cấp cho quản trị viên một cái nhìn chung tốt về cấu trúc tầng lớp của dữ liệu LDAP.

source: Also note the use of the <literal>-c</literal> option to the <command>ldapadd</command> command; this option requests that processing doesn't stop in case of error. Using this option is required because converting the <filename>/etc/services</filename> often generates a few errors that can safely be ignored.
nb_no: Legg også merke til bruken av <literal>-c</literal>-valget til <command>ldapadd</command>-kommandoen; dette alternativet ber om at prosessen ikke stopper i tilfelle feil. Å bruke dette alternativet kreves fordi å konvertere <filename>/etc/services</filename> ofte generer noen få feil som trygt kan ignoreres.
vi_vn: Cũng ghi chú rằng mục đích của lựa chọn <literal>-c</literal> cho lệnh <command>ldapadd</command>; lựa chọn này yêu cầu rằng việc xử lý không bị dừng lại khi gặp lỗi. Sử dụng lựa chọn này là bắt buộc bởi việc chuyển đổi <filename>/etc/services</filename> thường tạo ra nhiều lỗi vốn có thể được bỏ qua mà không gây ảnh hưởng gì.

source: Managing Accounts with LDAP
nb_no: Å håndtere kontoer med LDAP
vi_vn: Quản lý các Tài khoản với LDAP

source: Now the LDAP database contains some useful information, the time has come to make use of this data. This section focuses on how to configure a Linux system so that the various system directories use the LDAP database.
nb_no: Nå når LDAP-databasen inneholder en del nyttig informasjon, er tiden kommet for å gjøre bruk av disse dataene. I denne seksjonen skal vi se på hvordan du konfigurerer et Linux-system, slik at de ulike systemmappene bruker LDAP-databasen.
vi_vn: Bây giờ cơ sở dữ liệu LDAP chứa một thông tin hữu dụng, đã đến thời điểm để tận dụng dữ liệu này. Phần này tập trung vào làm sao để cấu hình một hệ thống Linux để các thư mục hệ thống có thể tận dung cơ sở dữ liệu LDAP.

source: Configuring NSS
nb_no: Å sette opp NSS
vi_vn: Cấu hình NSS

source: The NSS system (Name Service Switch, see sidebar <xref linkend="sidebar.intro-nss" />) is a modular system designed to define or fetch information for system directories. Using LDAP as a source of data for NSS requires installing the <emphasis role="pkg">libnss-ldap</emphasis> package. Its installation asks a few questions; the answers are summarized in <xref linkend="tab-libnss-ldap" xrefstyle="select: label nopage" />.
nb_no: NSS-systemet (Name Service Switch, se sidestolpe <xref linkend="sidebar.intro-nss" />) er et modulært system utformet for å definere eller hente informasjon for systemmapper. Med LDAP som datakilde krever NSS installasjon av <emphasis role="pkg">libnss-ldap</emphasis>-pakken. Installasjonen av den stiller noen få spørsmål; svarene er oppsummert i <xref linkend="tab-libnss-ldap" xrefstyle="select: label nopage" />.
vi_vn: Hệ thống NSS (Chuyển đổi Dịch vụ Tên, xem ở thanh bên cạnh <xref linkend="sidebar.intro-nss" />) là một hệ thống có cấu trúc mô-đun được thiết kế để định nghĩa hoặc truy xuất thông tin về các thư mục hệ thống. Sử dụng LDAP như một nguồn thông tin cho NSS cần cài đặt gói phần mềm <emphasis role="pkg">libnss-ldap</emphasis>. Quá trình cài đặt của nó hỏi một số câu hỏi; các câu hỏi được tóm tắt trong <xref linkend="tab-libnss-ldap" xrefstyle="select: label nopage" />.

source: Configuring the <emphasis role="pkg">libnss-ldap</emphasis> package
nb_no: Å sette opp <emphasis role="pkg">libnss-ldap</emphasis>-pakken
vi_vn: Cấu hình gói phần mềm <emphasis role="pkg">libnss-ldap</emphasis>

source: LDAP server Uniform Resource Identifier
nb_no: LDAP-tjener Uniform Resource Identifier
vi_vn: Định danh thống nhất cho Tài nguyên (Uniform Resource Identifier) máy phục vụ LDAP

source: Distinguished name of the search base
nb_no: Øremerket navn for søkerbasen
vi_vn: Tên đặc biệt của nơi bắt đầu tìm kiếm

source: LDAP version to use
nb_no: LDAP-versjon som skal brukes
vi_vn: Phiên bản LDAP để sử dụng

source: Does the LDAP database require login?
nb_no: Krever LDAP-databasen innlogging?
vi_vn: Cơ sở dữ liệu LDAP có đòi hỏi đăng nhập?

source: Special LDAP privileges for root
nb_no: Spesielle LDAP-rotprivilegier
vi_vn: Các quyền LDAP đặc biệt cho quản trị viên

source: yes
nb_no: ja
vi_vn: đồng ý

source: Make the configuration file readable/writeable by its owner only
nb_no: Gjør konfigurasjonsfilen lesbar/skrivbar bare for sin eier
vi_vn: Tạo một tập tin cấu hình đọc được/ghi được chỉ bởi người chủ của nó

source: LDAP account for root
nb_no: LDAP-konto for rot
vi_vn: Tài khoản LDAP cho quản trị viên

source: LDAP root account password
nb_no: LDAP-passord for rotkonto
vi_vn: Mật mã tài khoản quản trị viên LDAP

source: The <filename>/etc/nsswitch.conf</filename> file then needs to be modified, so as to configure NSS to use the freshly-installed <command>ldap</command> module.
nb_no: Filen <filename>/etc/nsswitch.conf</filename> må deretter endres, for å konfigurere NSS til å bruke den nettopp installerte <command>ldap</command>-modulen.
vi_vn: Tập tin <filename>/etc/nsswitch.conf</filename> sau đó cần phải được chỉnh sửa, để cấu hình NSS để sử dụng mô-đun mới được cài đặt <command>ldap</command>.

source: The <filename>/etc/nsswitch.conf</filename> file
nb_no: Filen <filename>/etc/nsswitch.conf</filename>
vi_vn: Tập tin <filename>/etc/nsswitch.conf</filename>

source: # /etc/nsswitch.conf # # Example configuration of GNU Name Service Switch functionality. # If you have the `glibc-doc' and `info' packages installed, try: # `info libc "Name Service Switch"' for information about this file. passwd: ldap compat group: ldap compat shadow: ldap compat hosts: files dns ldap networks: ldap files protocols: ldap db files services: ldap db files ethers: ldap db files rpc: ldap db files netgroup: ldap files
vi_vn: # /etc/nsswitch.conf # # Ví dụ cấu hình của tính năng Chuyển đổi Dịch vụ Tên của GNU (GNU Name Service Switch). # Nếu bạn có các gói phần mềm `glibc-doc' và `info' được cài đặt, hãy thử: # `info libc "Name Service Switch"' để biết thêm về tập tin này. passwd: ldap compat group: ldap compat shadow: ldap compat hosts: files dns ldap networks: ldap files protocols: ldap db files services: ldap db files ethers: ldap db files rpc: ldap db files netgroup: ldap files

source: The <command>ldap</command> module is usually inserted before others, and it will therefore be queried first. The notable exception is the <literal>hosts</literal> service since contacting the LDAP server requires consulting DNS first (to resolve <literal>ldap.falcot.com</literal>). Without this exception, a hostname query would try to ask the LDAP server; this would trigger a name resolution for the LDAP server, and so on in an infinite loop.
nb_no: Modulen <command>ldap</command> er vanligvis satt inn før de andre, og den vil derfor spørres først. Unntaket å merke seg er <literal>hosts</literal>-tjenesten, siden LDAP-tjeneren krever å kontakte DNS først (for å løse <literal>ldap.falcot.com</literal>). Uten dette unntaket, ville en forespørsel om vertsnavn prøve å spørre LDAP-tjeneren; dette ville utløse et navneoppslag for LDAP-tjeneren, og så videre i en uendelig sløyfe.
vi_vn: Mô-đun <command>ldap</command> thường được chèn trước những mô-đun khác, và vì thế nó sẽ được hỏi trước. Ngoại lệ đáng chú ý là dịch vụ <literal>hosts</literal> bởi liên lạc với máy phục vụ LDAP cần phải hỏi DNS trước (để giải mã tên <literal>ldap.falcot.com</literal>). Không có ngoại lệ, một truy xuất tên máy tính sẽ cố gắng hỏi máy phục vụ LDAP; điều này sẽ kích hoạt giải mã tên miền cho máy phục vụ LDAP, và vâng vâng trong một vòng lặp vô hạn.

source: If the LDAP server should be considered authoritative (and the local files used by the <command>files</command> module disregarded), services can be configured with the following syntax:
nb_no: Hvis LDAP-tjeneren skal vurderes som autoritative (og de lokale filene som brukes av <command>files</command>-modulen ignoreres), kan tjenester konfigureres med følgende syntaks:
vi_vn: Nếu máy phục vụ LDAP nên được xem như nguồn thông tin chính xác (và các tập tin nội bộ được sử dụng bởi mô-đun <command>files</command> bị bỏ qua), các dịch vụ có thể được cấu hình với cú pháp sau:

source: If the requested entry does not exist in the LDAP database, the query will return a “not existing” reply even if the resource does exist in one of the local files; these local files will only be used when the LDAP service is down.
nb_no: Hvis den forespurte oppføringen ikke finnes i LDAP-databasen, vil søket returnere et «ikke eksisterende» svar, selv om ressursen eksisterer i en av de lokale filene. Disse lokale filene vil bare bli brukt når LDAP-tjenesten er nede.
vi_vn: Nếu mục được yêu cầu không tồn tại trong cơ sở dữ liệu LDAP, truy xuất sẽ trả về một câu trả lời “không tồn tại“ thậm chí nếu tài nguyên đó có tồn tại trong một trong các tập tin nội bộ; các tập tin nội bộ này sẽ chỉ được sử dụng nếu dịch vụ LDAP bị sập.

source: Configuring PAM
nb_no: Å sette opp PAM
vi_vn: Cấu hình PAM

source: This section describes a PAM configuration (see sidebar <xref linkend="sidebar.intro-pam" />) that will allow applications to perform the required authentications against the LDAP database.
nb_no: Denne delen beskriver en PAM-konfigurasjon (se sidestolpe <xref linkend="sidebar.intro-pam" />) som vil tillate programmer å utføre de nødvendige godkjenninger mot LDAP-databasen.
vi_vn: Phần này mô tả một cấu hình PAM (xem ở thanh bên cạnh <xref linkend="sidebar.intro-pam" />) vốn sẽ cho phép các ứng dung thực hiện các xác thực cần thiết dựa trên cơ sở dữ liệu LDAP.

source: <emphasis>CAUTION</emphasis> Broken authentication
nb_no: <emphasis>VÆR VARSOM</emphasis> Brutt godkjenning
vi_vn: <emphasis>CẢNH BÁO</emphasis> Xác thực sai

source: Changing the standard PAM configuration used by various programs is a sensitive operation. A mistake can lead to broken authentication, which could prevent logging in. Keeping a root shell open is therefore a good precaution. If configuration errors occur, they can be then fixed and the services restarted with minimal effort.
nb_no: Det er en følsom operasjon å endre den standard PAM-konfigurasjonen som brukes av ulike programmer. En feil kan føre til ødelagt godkjenning, noe som kan hindre innlogging. Å holde et rotskall åpent er derfor en god forholdsregel. Hvis konfigurasjonsfeil oppstår, kan de fikses, og tjenesten startes igjen med minimal innsats.
vi_vn: Thay đổi cấu hình PAM chuẩn vốn được sử dụng bởi nhiều chương trình là một hành động nhạy cảm. Một lỗi có thể dẫn đến xác thực sai, và chặn việc đăng nhập. Giữ một cửa sổ dòng lệnh với quyền quản trị vì thế là một cách phòng chống tốt. Nếu các lỗi cấu hình xảy ra, chúng có thể được sửa và các dịch vụ khởi động lại mà ít tốn công sức.

source: The LDAP module for PAM is provided by the <emphasis role="pkg">libpam-ldap</emphasis> package. Installing this package asks a few questions very similar to those in <emphasis role="pkg">libnss-ldap</emphasis>; some configuration parameters (such as the URI for the LDAP server) are even actually shared with the <emphasis role="pkg">libnss-ldap</emphasis> package. Answers are summarized in <xref linkend="tab-libpam-ldap" xrefstyle="select: label nopage" />.
nb_no: LDAP-modulen for PAM leveres av <emphasis role="pkg">libpam-ldap</emphasis>-pakken. Å installere denne pakken stiller noen spørsmål som er svært lik dem i <emphasis role="pkg">libnss-ldap</emphasis>. Noen konfigurasjonsparametere (for eksempel URI for LDAP-tjeneren) er faktisk delt med <emphasis role="pkg">libnss-ldap</emphasis>-pakken. Svarene er er oppsummert i <xref linkend="tab-libpam-ldap" xrefstyle="select: label nopage" />.
vi_vn: Mô-đun LDAP cho PAM được cung cấp bởi gói phần mềm <emphasis role="pkg">libpam-ldap</emphasis>. Cài đặt gói phần mềm này hỏi một vài câu hỏi tương tự những câu hỏi ở <emphasis role="pkg">libnss-ldap</emphasis>; một vài tham biến cấu hình (như là Đường dẫn Chuẩn đến Tài nguyên (URI) cho máy phục vụ LDAP) thậm chí thực ra được chia sẻ với gói <emphasis role="pkg">libnss-ldap</emphasis>. Các câu trả lời được tóm tắt ở <xref linkend="tab-libpam-ldap" xrefstyle="select: label nopage" />.

source: Configuration of <emphasis>libpam-ldap</emphasis>
nb_no: Å sette opp <emphasis>libpam-ldap</emphasis>
vi_vn: Cấu hình của <emphasis>libpam-ldap</emphasis>

source: Allow LDAP admin account to behave like local root?
nb_no: Tillate LDAP-administrasjonskontoen å oppføre seg som lokal rot?
vi_vn: Cho phép tài khoản quản trị LDAP hành động như một quản trị viên của máy nội bộ

source: Yes. This allows using the usual <command>passwd</command> command for changing passwords stored in the LDAP database.
nb_no: Ja. Dette tilllater å bruke den vanlige <command>passwd</command>-kommandoen for å endre passord lagret i LDAP-databasen.
vi_vn: Đồng ý. Điều này cho phép sử dụng lệnh thông thường <command>passwd</command> để thay đổi mật mã lưu trong cơ sở dữ liệu LDAP

source: Does the LDAP database require logging in?
nb_no: Krever LDAP-databasen innlogging?
vi_vn: LDAP có bắt buộc đăng nhập?

source: the LDAP database administrative password
nb_no: LDAP-databasens administrative passord
vi_vn: mật mã quản trị cơ sở dữ liệu LDAP

source: Local encryption algorithm to use for passwords
nb_no: Å bruke lokal krypteringsalgoritme for passord
vi_vn: Thuật toán mã hóa nội bộ để sử dụng cho các mật mã
