Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: <emphasis>SECURITY</emphasis> Execution under the <literal>www-data</literal> user
nb_no: <emphasis>SIKKERHET</emphasis> Kjøring under <literal>www-data</literal>-brukeren
vi_vn: <emphasis>AN NINH</emphasis> Thực thi dưới người dùng <literal>www-data</literal>

source: By default, Apache handles incoming requests under the identity of the <literal>www-data</literal> user. This means that a security vulnerability in a CGI script executed by Apache (for a dynamic page) won't compromise the whole system, but only the files owned by this particular user.
nb_no: Som standard håndterer Apache innkommende forespørsler under identiteten til <literal>www-data</literal>-brukeren. Dette betyr at en sikkerhetssårbarhet i et CGI-skript, utført av Apache (for en dynamisk side), ikke vil kompromittere hele systemet, men bare de filer som eies av denne bestemte brukeren.
vi_vn: Theo ngầm định, Apache xử lý các yêu cầu đến dưới quyền người dùng của tài khoản <literal>www-data</literal>. Điều này nghĩa là một lỗ hổng bảo mật trong một đoạn mã kịch bản CGI thực thi bởi Apache (cho một trang web động) sẽ không làm lộ cả một hệ thống, nhưng chỉ nhưng tập tin được sở hữu bởi người sử dụng này.

source: Using the <emphasis>suexec</emphasis> modules allows bypassing this rule so that some CGI scripts are executed under the identity of another user. This is configured with a <literal>SuexecUserGroup <replaceable>user</replaceable><replaceable>group</replaceable></literal> directive in the Apache configuration.
nb_no: Ved å bruke <emphasis>suexec</emphasis>-moduler kan en omgå denne regelen slik at noen CGI-skript kjøres med identiteten til en annen bruker. Dette konfigureres med et <literal>SuexecUserGroup <replaceable>bruker</replaceable><replaceable>gruppe</replaceable></literal>-direktiv i Apache-oppsettet.
vi_vn: Sử dụng các mô-đun <emphasis>suexec</emphasis> cho phép vượt qua quy tắc này để một số đoạn mã CGI được thực thi dưới quyền người dùng của một tài khoản khác. Điều này được cấu hình bởi chỉ thị <literal>SuexecUserGroup <replaceable>user</replaceable><replaceable>group</replaceable></literal> trong cấu hình Apache.

source: Another possibility is to use a dedicated MPM, such as the one provided by <emphasis role="pkg">libapache2-mpm-itk</emphasis>. This particular one has a slightly different behavior: it allows “isolating” virtual hosts (actually, sets of pages) so that they each run as a different user. A vulnerability in one website therefore cannot compromise files belonging to the owner of another website.
nb_no: En annen mulighet er å bruke en dedikert MPM, slik som den som tilbys i <emphasis role="pkg">libapache2-mpm-itk</emphasis>. Akkurat denne har en litt annen oppførsel: Den tillater å «isolere» virtuelle verter (faktisk, sett med sider), slik at hver av dem kjører som en ulik bruker. En sårbarhet i en nettside kan derfor ikke kompromittere filer som tilhører eieren av et annet nettsted.
vi_vn: Một khả năng khác là sử dụng một MPM chuyên dụng, như là cái được cung cấp bởi <emphasis role="pkg">libapache2-mpm-itk</emphasis>. Cái này có một hành vi hoàn toàn khác: nó cho phép “cách ly“ các máy ảo(virtual hosts) (thực ra, những tập hợp các trang) để mỗi cái trong số đó chạy dưới một người sử dụng khác nhau. Một lỗ hổng khác trong một trang web vì thế sẽ không thể làm lộ các tập tin thuộc về người sở hữu của trang web khác.

source: <emphasis>QUICK LOOK</emphasis> List of modules
nb_no: <emphasis>HURTIGVISNING</emphasis> Liste over moduler
vi_vn: <emphasis>SƠ LƯỢC</emphasis> Danh sách các mô-đun

source: The full list of Apache standard modules can be found online. <ulink type="block" url="http://httpd.apache.org/docs/2.4/mod/index.html" />
nb_no: Den fullstendige listen med Apache-standardmoduler finnes på nettet. <ulink type="block" url="http://httpd.apache.org/docs/2.4/mod/index.html" />
vi_vn: Danh sách đầy đủ của các mô-đun chuẩn của Apache có thể tìm thấy trên mạng. <ulink type="block" url="http://httpd.apache.org/docs/2.4/mod/index.html" />

source: Apache is a modular server, and many features are implemented by external modules that the main program loads during its initialization. The default configuration only enables the most common modules, but enabling new modules is a simple matter of running <command>a2enmod <replaceable>module</replaceable></command>; to disable a module, the command is <command>a2dismod <replaceable>module</replaceable></command>. These programs actually only create (or delete) symbolic links in <filename>/etc/apache2/mods-enabled/</filename>, pointing at the actual files (stored in <filename>/etc/apache2/mods-available/</filename>).
nb_no: Apache er en modulbasert tjener, og mange funksjoner legges inn av eksterne moduler som hovedprogrammet laster inn under sin initialisering. Standardkonfigurasjonen kan bare aktivere de mest vanlige moduler, men å tillate nye moduler skjer ved ganske enkelt å kjøre <command>a2enmod <replaceable>modul</replaceable></command>; for å koble fra en modul, er kommandoen <command>a2dismod <replaceable>modul</replaceable></command>. Disse programmene oppretter (eller sletter) bare symbolske lenker i <filename>/etc/apache2/mods-enabled/</filename>, som peker på de aktuelle filene (lagret i <filename>/etc/apache2/mods-available/</filename>).
vi_vn: Apache là một máy phục vụ cấu thành bởi nhiều mô-đun, và nhiều tính năng của nó được tạo ra bởi những mô-đun bên ngoài mà chương trình chính sẽ thực thi trong quá trình khởi động. Cấu hình ngầm định chỉ kích hoạt các mô-đun phổ biến nhất, nhưng để kích hoạt các mô-đun mới này chỉ cần đơn giản chạy lệnh <command>a2enmod <replaceable>module</replaceable></command>; để tắt một mô-đun, lệnh là <command>a2dismod <replaceable>module</replaceable></command>. Những chương trình này thực ra chỉ tạo (hoặc xóa) các đường link tượng trưng(symbolic links) trong <filename>/etc/apache2/mods-enabled/</filename>, vốn chỉ đến những tập tin thực sự (lưu trong <filename>/etc/apache2/mods-available/</filename>).

source: With its default configuration, the web server listens on port 80 (as configured in <filename>/etc/apache2/ports.conf</filename>), and serves pages from the <filename>/var/www/html/</filename> directory (as configured in <filename>/etc/apache2/sites-enabled/000-default.conf</filename>).
nb_no: Med sin standardkonfigurasjon, lytter nettjeneren på port 80 (som konfigurert i <filename>/etc/apache2/ports.conf</filename>), og betjener sider fra <filename>/var/www/html/</filename>-mappen (som konfigurert i <filename>/etc/apache2/sites-enabled/000-default.conf</filename>).
vi_vn: Với cấu hình ngầm định của nó, máy phục vụ web lắng nghe trên cổng 80 (như được cấu hình trong tập tin <filename>/etc/apache2/ports.conf</filename>), và phục vụ các trang nằm trong thư mục <filename>/var/www/html/</filename> (như được cấu hình trong tập tin <filename>/etc/apache2/sites-enabled/000-default.conf</filename>).

source: <emphasis>GOING FURTHER</emphasis> Adding support for SSL
nb_no: <emphasis>FOR VIDEREKOMMENDE</emphasis> Å legge til støtte for SSL
vi_vn: <emphasis>TÌM HIỂU THÊM</emphasis> Thêm hỗ trợ cho SSL

source: <primary>HTTP</primary><secondary>secure</secondary>
nb_no: <primary>HTTP</primary><secondary>sikre</secondary>
vi_vn: <primary>HTTP</primary><secondary>an ninh</secondary>

source: Apache 2.4 includes the SSL module required for secure HTTP (HTTPS) out of the box. It just needs to be enabled with <command>a2enmod ssl</command>, then the required directives have to be added to the configuration files. A configuration example is provided in <filename>/etc/apache2/sites-available/default-ssl.conf</filename>. <ulink type="block" url="http://httpd.apache.org/docs/2.4/mod/mod_ssl.html" />
nb_no: Apache 2.4 inkluderer SSL-modulen som kreves for sikker HTTP (HTTPS) ut av boksen. Den må bare være aktivert med <command>a2enmod ssl</command>, deretter må de nødvendige direktiver legges til konfigurasjonsfilene. Et konfigurasjonseksempel er gitt i <filename>/etc/apache2/sites-available/default-ssl.conf</filename>. <ulink type="block" url="http://httpd.apache.org/docs/2.4/mod/mod_ssl.html" />
vi_vn: Apache 2.4 có sẵn một mô-đun SSL buộc phải có để hỗ trợ HTTP an toàn (HTTPS). Nó chỉ cần được kích hoạt với lệnh <command>a2enmod ssl</command>, sau đó các chỉ thị buộc phải có phải được thêm vào các tập tin cấu hình. Một ví dụ cấu hình được cung cấp trong <filename>/etc/apache2/sites-available/default-ssl.conf</filename>. <ulink type="block" url="http://httpd.apache.org/docs/2.4/mod/mod_ssl.html" />

source: Some extra care must be taken if you want to favor SSL connections with <emphasis>Perfect Forward Secrecy</emphasis> (those connections use ephemeral session keys ensuring that a compromission of the server's secret key does not result in the compromission of old encrypted traffic that could have been stored while sniffing on the network). Have a look at Mozilla's recommandations in particular: <ulink type="block" url="https://wiki.mozilla.org/Security/Server_Side_TLS#Apache" />
nb_no: Det kreves noe ekstra forsiktighet hvis du ønsker å favorisere SSL-tilkoblinger med <emphasis>Perfect Forward Secrecy</emphasis> (disse tilkoblingene bruker flyktige øktnøkler som sikrer at kompromittering av tjenerens hemmelige nøkkel ikke resulterer i kompromittering av gammel kryptert trafikk som kan ha blitt lagret under sniffing på nettverket). Se på Mozillas anbefalinger, spesielt: <ulink type="block" url="https://wiki.mozilla.org/Security/Server_Side_TLS#Apache" />
vi_vn: Phải cẩn thận hơn nếu bạn muốn ưu tiên các kết nối SSL với <emphasis>Bí mật Chiều đi Hoàn hảo(Perfect Forward Secrecy)</emphasis> (những kết nối sử dụng các mã phiên làm việc tạm thời để đảm bảo rằng việc lộ mã bí mật của máy phục vụ không dẫn đến việc lộ thông tin cũ đã được mã hóa vốn có thể bị lưu lại trước đây khi có ai nghe lén trên đường truyền). Quan sát các đề xuất của Mozilla, cụ thể là ở <ulink type="block" url="https://wiki.mozilla.org/Security/Server_Side_TLS#Apache" />

source: <primary><emphasis>Perfect Forward Secrecy</emphasis></primary>
vi_vn: <primary><emphasis>Bí mật Chiều đi Hoàn hảo(Perfect Forward Secrecy)</emphasis></primary>

source: Configuring Virtual Hosts
nb_no: Å konfigurere virtuelle verter
vi_vn: Cấu hình các máy ảo

source: A virtual host is an extra identity for the web server.
nb_no: En virtuell vert er en ekstra identitet for nett-tjeneren.
vi_vn: Một máy ảo là một danh xưng thêm cho một máy phục vụ.

source: <primary>virtual host</primary>
nb_no: <primary>virtuell vert</primary>
vi_vn: <primary>máy ảo</primary>

source: Apache considers two different kinds of virtual hosts: those that are based on the IP address (or the port), and those that rely on the domain name of the web server. The first method requires allocating a different IP address (or port) for each site, whereas the second one can work on a single IP address (and port), and the sites are differentiated by the hostname sent by the HTTP client (which only works in version 1.1 of the HTTP protocol — fortunately that version is old enough that all clients use it already).
nb_no: Apache vurderer to forskjellige typer virtuelle verter: De som er basert på IP-adressen (eller porten), og de som er avhengige av domenenavnet til nett-tjeneren. Den første metoden krever tildeling av en annen IP-adresse (eller port) for hvert område, mens den andre kan arbeide på en enkelt IP-adresse (og port), og nettstedene er differensiert etter vertsnavnet sendt av HTTP-klienten (som bare fungerer i versjon 1.1 av HTTP-protokollen - heldigvis at versjonen er gammel nok til at alle kunder bruker den allerede).
vi_vn: Apache có hai loại máy ảo khác nhau: một loại dựa trên địa chỉ IP (hoặc cổng), và một loại dựa trên tên miền của máy phục vụ web. Phương thức đầu tiên cần tạo một địa chỉ IP khác nhau (hay cổng) cho mỗi trang, trong khi phương thức số hai có thể hoạt động với một địa chỉ IP (và cổng) duy nhất, và những trang phân biệt bởi tên máy gửi bởi chương trình khách HTTP (vốn chỉ hoạt động tốt với phiên bản 1.1 của nghi thức HTTP - may mắn rằng phiên bản này đủ lâu để tất cả các chương trình khách đã sử dụng nó lâu rồi).

source: The (increasing) scarcity of IPv4 addresses usually favors the second method; however, it is made more complex if the virtual hosts need to provide HTTPS too, since the SSL protocol hasn't always provided for name-based virtual hosting; the SNI extension (<emphasis>Server Name Indication</emphasis>) that allows such a combination is not handled by all browsers. When several HTTPS sites need to run on the same server, they will usually be differentiated either by running on a different port or on a different IP address (IPv6 can help there).
nb_no: Den (økende) knapphet på IPv4-adresser favoriserer vanligvis den andre metoden; imidlertid er det gjort mer komplisert om de virtuelle verter må levere HTTPS også, ettersom SSL-protokollen ikke alltid har levert navn-baserte virtuelle verter; Ikke alle nettlesere håndterer SNI-forlengelsen (<emphasis>Server Name Indication</emphasis>). Når flere HTTPS-nettsteder må kjøre på samme tjener, vil de vanligvis bli differensiert enten ved å kjøre på en annen port, eller på en annen IP-adresse (IPv6 kan hjelpe til der).
vi_vn: Sự khan hiếm ngày càng tăng của các địa chỉ IPv4 dẫn đến sự ưu tiên của phương thức số hai; tuy nhiên, nó được làm cho phức tạp hơn nếu các máy ảo cần cung cung cấp HTTPS, bởi vì giao thức SSL không luôn luôn cung cấp lưu trữ ảo dựa trên tên; phần mở rộng SNI (<emphasis>Tín hiệu chọn tên (Server Name Indication)</emphasis>) vốn cho phép một sự kết hợp như vậy không được xử lý bởi tất cả trình duyệt. Khi vào trang HTTPS cần chạy trên cùng một máy phục vụ, chúng sẽ được phân biệt bằng việc chạy trên một cổng riêng biệt hoặc chạy trên một địa chỉ IP riêng biệt (IPv6 có thể giúp ích ở đây).

source: The default configuration for Apache 2 enables name-based virtual hosts. In addition, a default virtual host is defined in the <literal>/etc/apache2/sites-enabled/000-default.conf</literal> file; this virtual host will be used if no host matching the request sent by the client is found.
nb_no: Standardkonfigurasjonen for Apache 2 gir navn-baserte virtuelle verter. I tillegg er en standard virtuell vert definert i <literal>/etc/apache2/sites-enabled/000-default.conf</literal>-filen; Denne virtuelle verten vil bli brukt hvis det ikke finnes en vert som matcher anmodningen fra klienten.
vi_vn: Cấu hình ngầm định của Apache 2 cho phép các máy ảo dựa trên tên. Hơn nữa, một máy phục vụ ngầm định được định nghĩa trong tập tin <literal>/etc/apache2/sites-enabled/000-default.conf</literal>; máy ảo này sẽ được sử dụng nếu không máy được tìm thấy nào hợp với yêu cầu gửi bởi khách.

source: <emphasis>CAUTION</emphasis> First virtual host
nb_no: <emphasis>VÆR VARSOM</emphasis> Første virtuelle vert
vi_vn: <emphasis>CẢNH BÁO</emphasis> Máy ảo đầu tiên

source: Requests concerning unknown virtual hosts will always be served by the first defined virtual host, which is why we defined <literal>www.falcot.com</literal> first here.
nb_no: Forespørsler om ukjente virtuelle verter vil alltid bli betjent med den først definerte virtuelle verten. Det er derfor vi her har definert <literal>www.falcot.com</literal> først.
vi_vn: Những yêu cầu liên quan tới những máy ảo sẽ luôn được phục vụ bởi máy ảo ngầm định đầu tiên. Đó là lý do chúng ta định nghĩa <literal>www.falcot.com</literal> đầu tiên ở đây.

source: <emphasis>QUICK LOOK</emphasis> Apache supports SNI
nb_no: <emphasis>HURTIGVISNING</emphasis> Apache støtter SNI
vi_vn: <emphasis>SƠ LƯỢC</emphasis> Apache hỗ trợ SNI

source: <primary>Server Name Indication</primary>
vi_vn: <primary>Tín hiệu chọn tên (Server Name Indication)</primary>

source: The Apache server supports an SSL protocol extension called <emphasis>Server Name Indication</emphasis> (SNI). This extension allows the browser to send the hostname of the web server during the establishment of the SSL connection, much earlier than the HTTP request itself, which was previously used to identify the requested virtual host among those hosted on the same server (with the same IP address and port). This allows Apache to select the most appropriate SSL certificate for the transaction to proceed.
nb_no: Apache-tjeneren støtter en SSL-protokollforlengelse kalt <emphasis>Server Name Indication</emphasis> (SNI). Denne utvidelsen lar nettleseren sende vertsnavnet til nett-tjeneren, ved etableringen av SSL-tilkoblingen, mye tidligere enn HTTP-forespørselen selv, som tidligere ble brukt til å identifisere den forespurte virtuelle verten blant dem som ligger på samme tjener (med samme IP-adresse og port). Dette gjør Apache ved å velge det mest passende SSL-sertifikatet slik at transaksjonen kan fortsette.
vi_vn: Máy phục vụ Apache hỗ trợ một phần mở rộng của nghi thức SSL được gọi là <emphasis>Tín hiệu chọn tên(Server Name Indication)</emphasis> (SNI). Phần mở rộng cho phép trình duyệt gửi tên máy của một máy phục vụ trong quá trình thiết lập kết nối SSL, sớm hơn nhiều so với chính yêu cầu HTTP, vốn được sử dụng trước đó để nhận dạng máy ảo được yêu cầu trong những máy được lưu trữ trên cùng một máy phục vụ (với cùng một địa chỉ IP và cổng). Điều này cho phép Apache chọn chứng chỉ SSL phù hợp nhất để tiếp tục giao dịch.

source: Before SNI, Apache would always use the certificate defined in the default virtual host. Clients trying to access another virtual host would then display warnings, since the certificate they received didn't match the website they were trying to access. Fortunately, most browsers now work with SNI; this includes Microsoft Internet Explorer starting with version 7.0 (starting on Vista), Mozilla Firefox starting with version 2.0, Apple Safari since version 3.2.1, and all versions of Google Chrome.
nb_no: Før SNI, ville Apache alltid bruke sertifikatet i den virtuelle standard verten. Klienter som prøver å få tilgang til en annen virtuell vert vil da vise advarsler, siden sertifikatet de mottok ikke samsvarte med nettstedet de prøvde å få tilgang til. Heldigvis jobber de fleste nettlesere sammen med SNI. Dette inkluderer Microsoft Internet Explorer fra og med versjon 7.0 (som starter med Vista), Mozilla Firefox fra og med versjon 2.0, Apple Safari fra versjon 3.2.1, og alle versjoner av Google Chrome.
vi_vn: Trước SNI, Apache sẽ luôn sử dụng chứng chỉ được định nghĩa trong máy ảo ngầm định. Các máy khách cố gắng truy cập một máy ảo khác sẽ hiển thị các cảnh báo, bởi chứng chỉ chúng nhận được không hợp với trang web họ đang cố gắng truy cập. May mắn thay, đa số trình duyệt bây giờ làm việc với SNI; chúng bao gồm Microsoft Internet Explorer bắt đầu với phiên bản 7.0 (trên Vista), Mozilla Firefox bắt đầu với phiên bản 2.0, Apple Safari từ phiên bản 3.2.1, và tất cả các phiên bản của Google Chrome.

source: The Apache package provided in Debian is built with support for SNI; no particular configuration is therefore needed.
nb_no: Apache-pakken, levert med Debian, er bygget med støtte for SNI. Ingen spesiell konfigurasjon er derfor nødvendig.
vi_vn: Gói phần mềm Apache cung cấp bởi Debian được xây dựng với hỗ trợ cho SNI; vì thế không cấu hình cụ thể nào là cần thiết.

source: Care should also be taken to ensure that the configuration for the first virtual host (the one used by default) does enable TLSv1, since Apache uses the parameters of this first virtual host to establish secure connections, and they had better allow them!
nb_no: En bør også utvise forsiktighet for å sikre at konfigurasjonen for den første virtuelle verten (den som brukes som standard) aktiverer TLSv1, ettersom Apache bruker parametrene fra denne første virtuelle verten til å etablere sikre forbindelser, og de hadde bare å tillate dem!
vi_vn: Phải cẩn thận hơn trong việc đảm bảo rằng cấu hình cho máy ảo đầu tiên (cái được sử dụng ngầm định) kích hoạt TLSv1, bởi Apache dùng các tham số của máy ảo ngầm định đầu tiên để thiết lập các kết nối an toàn, và các kết nối này tốt hơn là nên cho phép chúng.

source: Each extra virtual host is then described by a file stored in <filename>/etc/apache2/sites-available/</filename>. Setting up a website for the <literal>falcot.org</literal> domain is therefore a simple matter of creating the following file, then enabling the virtual host with <command>a2ensite www.falcot.org</command>.
nb_no: Hver ekstra virtuelle vert er deretter beskrevet av en fil lagret i <filename>/etc/apache2/sites-available/</filename>. Å sette opp et nettsted for <literal>falcot.org</literal>-domenet blir derfor en enkel sak ved å lage den følgende filen, og så aktivere den virtuelle verten med <command>a2ensite www.falcot.org</command>.
vi_vn: Mỗi máy ảo thêm được mô tả bởi một tập tin được lưu trong <filename>/etc/apache2/sites-available/</filename>. Vì thế, cài đặt một trang web cho miền <literal>falcot.org</literal> đơn giản chỉ là tạo một tập tin sau, sau đó kích hoạt máy ảo với lệnh <command>a2ensite www.falcot.org</command>.

source: The <filename>/etc/apache2/sites-available/www.falcot.org.conf</filename> file
nb_no: <filename>/etc/apache2/sites-available/www.falcot.org.conf</filename>-filen
vi_vn: Tập tin <filename>/etc/apache2/sites-available/www.falcot.org.conf</filename>
