Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: Installing <emphasis role="pkg">libpam-ldap</emphasis> automatically adapts the default PAM configuration defined in the <filename>/etc/pam.d/common-auth</filename>, <filename>/etc/pam.d/common-password</filename> and <filename>/etc/pam.d/common-account</filename> files. This mechanism uses the dedicated <command>pam-auth-update</command> tool (provided by the <emphasis role="pkg">libpam-runtime</emphasis> package). This tool can also be run by the administrator should they wish to enable or disable PAM modules.
nb_no: Installering av <emphasis role="pkg">libpam-ldap</emphasis> tilpasser automatisk standard PAM-konfigurasjonen som er definert i <filename>/etc/pam.d/common-auth</filename>, <filename>/etc/pam.d/common-password</filename> og <filename>/etc/pam.d/common-account</filename>-filene. Denne mekanisme bruker det øremerkede <command>pam-auth-update</command>-verktøyet (levert av <emphasis role="pkg">libpam-runtime</emphasis>-pakken). Dette verktøyet kan også kjøres av administratoren dersom de ønsker å aktivere eller deaktivere PAM-moduler.
vi_vn: Việc cài đặt <emphasis role="pkg">libpam-ldap</emphasis> sẽ tự động thay đổi cấu hình định nghĩa trong các tập tin <filename>/etc/pam.d/common-auth</filename>, <filename>/etc/pam.d/common-password</filename> và <filename>/etc/pam.d/common-account</filename>. Cơ chế này sử dụng công cụ chuyên dụng <command>pam-auth-update</command> (cung cấp bởi gói phần mềm <emphasis role="pkg">libpam-runtime</emphasis>). Công cụ này cũng có thể được chạy bởi quản trị viên nếu họ muốn kích hoạt hay bỏ kích hoạt các mô-đun PAM.

source: Securing LDAP Data Exchanges
nb_no: Å sikre LDAP-datautveksling
vi_vn: Bảo vệ các Giao dịch Dữ liệu LDAP

source: By default, the LDAP protocol transits on the network as cleartext; this includes the (encrypted) passwords. Since the encrypted passwords can be extracted from the network, they can be vulnerable to dictionary-type attacks. This can be avoided by using an extra encryption layer; enabling this layer is the topic of this section.
nb_no: Som standard transporterer LDAP-protokollen på nettverket i klartekst. Dette inkluderer (krypterte) passord. Ettersom de krypterte passordene kan være hentet fra nettverket, kan de være sårbare for type ordbokangrep. Dette kan unngås ved hjelp av et ekstra krypteringslag; å aktivere dette laget er tema for denne seksjonen.
vi_vn: Theo ngầm định, giao thức LDAP di chuyển trên mạng không có mã hóa; điều này bao gồm các mật mã (đã mã hóa). Bởi các mật mã đã mã hóa có thể được trích xuất từ trên mạng, chúng có thể bị tấn công bởi các loại hình tấn công dựa trên từ điển. Điều này có thể tránh được bằng việc sử dụng một lớp mã hóa thêm; kích hoạt lớp này là chủ đề của phần này.

source: Configuring the Server
nb_no: Å sette opp tjeneren
vi_vn: Cấu hình máy phục vụ

source: The first step is to create a key pair (comprising a public key and a private key) for the LDAP server. The Falcot administrators reuse <emphasis>easy-rsa</emphasis> to generate it (see <xref linkend="sect.easy-rsa" />). Running <command>./build-key-server ldap.falcot.com</command> asks a few mundane questions (location, organization name and so on). The answer to the “common name” question <emphasis>must</emphasis> be the fully-qualified hostname for the LDAP server; in our case, <literal>ldap.falcot.com</literal>.
nb_no: Det første trinnet er å opprette et nøkkelpar (bestående av en offentlig nøkkel og en privat nøkkel) for LDAP-serveren. Falcot-administratorene gjenbruker <emphasis>easy-rsa</emphasis> for å genere det (se <xref linkend="sect.easy-rsa" />). Kjøring av <command>./build-key-server ldap.falcot.com</command> medfører noen dagligdagse spørsmål (plassering, organisasjonsnavn og så videre). Svaret på spørsmålet «common name» («vanlig navn»-spørsmålet )<emphasis>må</emphasis> være det fullstendige vertsnavnet for LDAP-tjeneren; i vårt tilfelle, <literal>ldap.falcot.com</literal>.
vi_vn: Bước đầu tiên là tạo một cặp chìa khóa (bao gồm chìa khóa công cộng và chìa khóa riêng tư) cho máy phục vụ LDAP. Các quản trị viên của Falcot sử dụng lại <emphasis>easy-rsa</emphasis> để tạo ra nó (xem <xref linkend="sect.easy-rsa" />). Chạy <command>./build-key-server ldap.falcot.com</command> sẽ hỏi một vài câu hỏi có vẻ thừa (vị trí, tên tổ chức và vâng vâng). Câu trả lời cho câu hỏi “tên thông thường(common name)“ <emphasis>phải</emphasis> là một tên máy tính đầy đủ cho máy phục vụ LDAP; trong trường hợp của chúng ta, <literal>ldap.falcot.com</literal>.

source: This command creates a certificate in the <filename>keys/ldap.falcot.com.crt</filename> file; the corresponding private key is stored in <filename>keys/ldap.falcot.com.key</filename>.
nb_no: Denne kommandoen oppretter et sertifikat i <filename>keys/ldap.falcot.com.crt</filename>-filen; den samsvarende private nøkkelen er lagret i <filename>keys/ldap.falcot.com.key</filename>.
vi_vn: Lệnh này tạo ra một chứng chỉ trong tập tin <filename>keys/ldap.falcot.com.crt</filename>; chìa khóa riêng tư tương ứng này được lưu trong <filename>keys/ldap.falcot.com.key</filename>.

source: Now these keys have to be installed in their standard location, and we must make sure that the private file is readable by the LDAP server which runs under the <literal>openldap</literal> user identity:
nb_no: Nå må disse nøklene være installert med sin standard plassering, og vi må sørge for at den private filen er lesbar av LDAP-tjeneren, som kjører med <literal>openldap</literal>-brukerindentiteten:
vi_vn: Bây giờ các chìa khóa phải được cài đặt vào vị trí chuẩn của chúng, và chúng ta phải đảm bảo rằng tập tin riêng tư có thể đọc được bởi máy phục vụ LDAP vốn chạy dưới danh tính của tài khoản <literal>openldap</literal>:

source: The <command>slapd</command> daemon also needs to be told to use these keys for encryption. The LDAP server configuration is managed dynamically: the configuration can be updated with normal LDAP operations on the <literal>cn=config</literal> object hierarchy, and the server updates <filename>/etc/ldap/slapd.d</filename> in real time to make the configuration persistent. <command>ldapmodify</command> is thus the right tool to update the configuration:
nb_no: Nissen <command>slapd</command> må også få beskjed om å bruke disse nøklene/tastene til kryptering. LDAP-tjenerkonfigurasjon styres dynamisk: konfigurasjonen kan oppdateres med normale LDAP-operasjoner på <literal>cn=config</literal>-objekthierarki, og tjeneroppdateringer på <filename>/etc/ldap/slapd.d</filename> i sann tid for å gjøre konfigurasjonen persistent. <command>ldapmodify</command> er dermed det riktige verktøyet for å oppdatere konfigurasjonen:
vi_vn: Dịch vụ chạy nền <command>slapd</command> cũng cần phải được báo cho biết để sử dụng các chìa khóa này cho việc mã hóa. Cấu hình máy phục vụ LDAP được quản lý động: cấu hình có thể được cập nhật với các tác vụ LDAP bình thường trên cây đối tượng <literal>cn=config</literal>, và máy phục vụ sẽ cập nhật <filename>/etc/ldap/slapd.d</filename> trong thời gian thực để giữ cho cấu hình luôn luôn mới nhất.

source: Configuring <command>slapd</command> for encryption
nb_no: Konfigurering <command>slapd</command> for kryptifisering
vi_vn: Cấu hình <command>slapd</command> cho mã hóa

source: <emphasis>TOOL</emphasis> <command>ldapvi</command> to edit an LDAP directory
nb_no: <emphasis>VERKTØY</emphasis> <command>ldapvi</command> for å redigere en LDAP-mappe
vi_vn: <emphasis>CÔNG CỤ</emphasis> <command>ldapvi</command> để chỉnh sửa một danh bạ LDAP

source: With <command>ldapvi</command>, you can display an LDIF output of any part of the LDAP directory, make some changes in the text editor, and let the tool do the corresponding LDAP operations for you.
nb_no: Med <command>ldapvi</command> kan du vise en LDIF-utskrift for enhver del av LDAP-katalogen, gjøre endringer i tekstredigereren, og la verktøyet gjøre de overensstemmende LDAP-operasjoner for deg.
vi_vn: Với <command>ldapvi</command>, bạn có thể hiển thị kết xuất LDIF của bất cứ phần nào của danh bạ LDAP, tạo ra một số thay đổi trong trình chỉnh sửa văn bản, và để công cụ này thực hiện các tác vụ LDAP tương ứng cho bạn.

source: It is thus a convenient way to update the configuration of the LDAP server, simply by editing the <literal>cn=config</literal> hierarchy.
nb_no: Dette er derfor en praktisk måte å oppdatere LDAP-tjenerens oppsett, ganske enkelt ved å redigere <literal>cn=config</literal>-hierarkiet.
vi_vn: Vì vậy đó là một cách thuận tiện để cập nhật cấu hình máy phục vụ LDAP, đơn giản bằng việc chỉnh sửa cây <literal>cn=config</literal>

source: The last step for enabling encryption involves changing the <varname>SLAPD_SERVICES</varname> variable in the <filename>/etc/default/slapd</filename> file. We'll play it safe and disable unsecured LDAP altogether.
nb_no: Det siste trinnet for å aktivere kryptering innebærer å endre <varname>SLAPD_SERVICES</varname>-variabelen i <filename>/etc/default/slapd</filename>-filen. Vi skal gjøre det trygt, og helt deaktivere usikret LDAP.
vi_vn: Bước cuối cùng để kích hoạt mã hóa liên quan tới thay đổi tham biến <varname>SLAPD_SERVICES</varname> trong tập tin <filename>/etc/default/slapd</filename>. Chúng ta sẽ theo cách an toàn và tắt hết LDAP không được đảm bảo an ninh.

source: The <filename>/etc/default/slapd</filename> file
nb_no: Filen <filename>/etc/default/slapd</filename>
vi_vn: Tập tin <filename>/etc/default/slapd</filename>

source: # Default location of the slapd.conf file or slapd.d cn=config directory. If # empty, use the compiled-in default (/etc/ldap/slapd.d with a fallback to # /etc/ldap/slapd.conf). SLAPD_CONF= # System account to run the slapd server under. If empty the server # will run as root. SLAPD_USER="openldap" # System group to run the slapd server under. If empty the server will # run in the primary group of its user. SLAPD_GROUP="openldap" # Path to the pid file of the slapd server. If not set the init.d script # will try to figure it out from $SLAPD_CONF (/etc/ldap/slapd.conf by # default) SLAPD_PIDFILE= # slapd normally serves ldap only on all TCP-ports 389. slapd can also # service requests on TCP-port 636 (ldaps) and requests via unix # sockets. # Example usage: # SLAPD_SERVICES="ldap://127.0.0.1:389/ ldaps:/// ldapi:///" SLAPD_SERVICES="ldaps:/// ldapi:///" # If SLAPD_NO_START is set, the init script will not start or restart # slapd (but stop will still work). Uncomment this if you are # starting slapd via some other means or if you don't want slapd normally # started at boot. #SLAPD_NO_START=1 # If SLAPD_SENTINEL_FILE is set to path to a file and that file exists, # the init script will not start or restart slapd (but stop will still # work). Use this for temporarily disabling startup of slapd (when doing # maintenance, for example, or through a configuration management system) # when you don't want to edit a configuration file. SLAPD_SENTINEL_FILE=/etc/ldap/noslapd # For Kerberos authentication (via SASL), slapd by default uses the system # keytab file (/etc/krb5.keytab). To use a different keytab file, # uncomment this line and change the path. #export KRB5_KTNAME=/etc/krb5.keytab # Additional options to pass to slapd SLAPD_OPTIONS=""
vi_vn: # Địa chỉ ngầm định của tập tin slapd.conf hoặc danh bạ slapd.d cn=config. Nếu # trống rỗng, sử dụng giá trị ngầm định được biên dịch sẵn (/etc/ldap/slapd.d với phương án dự phòng # /etc/ldap/slapd.conf). SLAPD_CONF= # Tài khoản quyền hệ thống để chạy máy phục vụ slapd. Nếu bỏ trống, máy phục vụ # sẽ được chạy dưới quyền quản trị viên. SLAPD_USER="openldap" # Nhóm người sử dụng có quyền hệ thống để chạy máy phục vụ slapd. Nếu bỏ trống máy phục vụ sẽ # chạy dưới nhóm chính của người sử dụng của nó. SLAPD_GROUP="openldap" # Đường dẫn đến tập tin pid của máy phục vụ slapd. Nếu bỏ trống kịch bản init.d # sẽ cố gắng tự suy ra dựa trên $SLAPD_CONF (/etc/ldap/slapd.conf theo ngầm # định) SLAPD_PIDFILE= # slapd thông thường chỉ phục vụ ldap trên tất cả các cổng TCP 389. slapd cũng có thể # phục vụ các yêu cầu trên cổng TCP 636 (ldaps) và các yêu cầu thông qua các unix # socket. # Ví dụ cách sử dụng: # SLAPD_SERVICES="ldap://127.0.0.1:389/ ldaps:/// ldapi:///" SLAPD_SERVICES="ldaps:/// ldapi:///" # Nếu SLAPD_NO_START được bật, kịch bản khởi động sẽ không kích hoạt hoặc khởi động lại # slapd (nhưng lệnh dừng lại vẫn hoạt động tốt). Bỏ ghi chú dòng sau nếu bạn sẽ # khởi động slapd thông qua các phương pháp khác hoặc nếu bạn không muốn slapd thông thường # được kích hoạt khi máy khởi động. #SLAPD_NO_START=1 # Nếu SLAPD_SENTINEL_FILE được gán giá trị là một đường dẫn đến một tập tin và tập tin đó có tồn tại, # kịch bản khởi động sẽ không kích hoạt hoặc khởi động lại slapd (nhưng lệnh dừng hoạt động vẫn # hoạt động). Dùng dòng sau để tắt tạm thời việc khởi động slapd (ví dụ như khi thực hiện # bảo trì hoặc thông qua một hệ thống quản lý các cấu hình) # khi bạn không muốn chỉnh sửa một tập tin cấu hình. SLAPD_SENTINEL_FILE=/etc/ldap/noslapd # Đối với xác thực Kerberos (thông qua SASL), slapd theo ngầm định sử dụng tập tin # keytab của hệ thống (/etc/krb5.keytab). Để sử dụng một tập tin keytab khác, # bỏ ghi chú dòng sau và thay đổi đường dẫn. #export KRB5_KTNAME=/etc/krb5.keytab # Các lựa chọn thêm để chuyển tới slapd SLAPD_OPTIONS=""

source: Configuring the Client
nb_no: Å sette opp klienten
vi_vn: Cấu hình Chương trình khách

source: On the client side, the configuration for the <emphasis>libpam-ldap</emphasis> and <emphasis>libnss-ldap</emphasis> modules needs to be modified to use an <literal>ldaps://</literal> URI.
nb_no: På klientsiden trenger oppsettet for <emphasis>libpam-ldap</emphasis> og <emphasis>libnss-ldap</emphasis>-modulene å bli modifisert til å bruke en <literal>ldaps://</literal>-URI.
vi_vn: Bên chương trình khách, cấu hình cho các mô-đun <emphasis>libpam-ldap</emphasis> và <emphasis>libnss-ldap</emphasis> cần phải được điều chỉnh để dùng URI <literal>ldaps://</literal>.

source: LDAP clients also need to be able to authenticate the server. In a X.509 public key infrastructure, public certificates are signed by the key of a certificate authority (CA). With <emphasis>easy-rsa</emphasis>, the Falcot administrators have created their own CA and they now need to configure the system to trust the signatures of Falcot's CA. This can be done by putting the CA certificate in <filename>/usr/local/share/ca-certificates</filename> and running <command>update-ca-certificates</command>.
nb_no: LDAP-klienter må også kunne godkjenne serveren. I en X.509 offentlig nøkkelinfrastruktur er offentlige sertifikater signert av nøkkelen til en sertifiseringsinstans (CA). Med <emphasis>easy-rsa</emphasis> har Falcot-administratorene laget sin egen CA, og nå trenger de å konfigurere systemet til å stole på underskriftene til Falcots CA. Dette kan gjøres ved å sette CA-sertifikatet inn i <filename>/usr/local/share/ca-certificates</filename>, og kjøre <command>update-ca-certificates</command>.
vi_vn: Các chương trình khách LDAP cũng cần có thể xác thực được với máy phục vụ. Trong hạ tầng chìa khóa công cộng X.509, các chứng chỉ công cộng được ký bằng chìa khóa của một đại diện chứng chỉ (CA). Với <emphasis>easy-rsa</emphasis>, các quản trị viên của Falcot đã tạo một đại diện chứng chỉ (CA) riêng cho ho và họ bây giờ cần cấu hình hệ thống để có thể tin tưởng các chữ ký của đại diện chứng chỉ (CA) của Falcot. Điều này có thể được thực hiện bằng việc đặt chứng chỉ của CA vào trong <filename>/usr/local/share/ca-certificates</filename> và chạy lệnh <command>update-ca-certificates</command>.

source: Last but not least, the default LDAP URI and default base DN used by the various command line tools can be modified in <filename>/etc/ldap/ldap.conf</filename>. This will save quite some typing.
nb_no: Sist men ikke minst kan standard LDAP URI og standard base DN, brukt av de ulike kommandolinjeverktøyene, endres i <filename>/etc/ldap/ldap.conf</filename>. Dette vil spare ganske mye skriving.
vi_vn: Cuối cùng, URI LDAP ngầm định và Tên Đặc trưng gốc (base Distinguished Name hoặc base DN) ngầm định được sử dụng bởi các công cụ dòng lệnh có thể được chỉnh sửa trong <filename>/etc/ldap/ldap.conf</filename>. Điều này sẽ giúp giảm bớt một ít việc đánh máy.

source: The <filename>/etc/ldap/ldap.conf</filename> file
nb_no: Filen <filename>/etc/ldap/ldap.conf</filename>
vi_vn: Tập tin <filename>/etc/ldap/ldap.conf</filename>

source: # # LDAP Defaults # # See ldap.conf(5) for details # This file should be world readable but not world writable. BASE dc=falcot,dc=com URI ldaps://ldap.falcot.com #SIZELIMIT 12 #TIMELIMIT 15 #DEREF never # TLS certificates (needed for GnuTLS) TLS_CACERT /etc/ssl/certs/ca-certificates.crt
vi_vn: # # Các thiết lập LDAP ngầm định # # Xem thêm ldap.conf(5) để biết thêm chi tiết # Tập tin này nên cho phép bất cứ ai cũng có thể đọc nhưng không phải ai cũng có thể ghi. BASE dc=falcot,dc=com URI ldaps://ldap.falcot.com #SIZELIMIT 12 #TIMELIMIT 15 #DEREF never # Các chứng chỉ TLS (cần có cho GnuTLS) TLS_CACERT /etc/ssl/certs/ca-certificates.crt

source: Real-Time Communication Services
nb_no: Sanntids kommunikasjonstjenester
vi_vn: Các dịch vụ Liên lạc Thời gian thực

source: Real-Time Communication (RTC) services include voice, video/webcam, instant messaging (IM) and desktop sharing. This chapter gives a brief introduction to three of the services required to operate RTC, including a TURN server, SIP server and XMPP server. Comprehensive details of how to plan, install and manage these services are available in the Real-Time Communications Quick Start Guide which includes examples specific to Debian. <ulink type="block" url="http://rtcquickstart.org" />
nb_no: Real-Time Communication (RTC)-tjenester (sanntids kommunikasjonstjenester) inkluderer tale, video/nettkamera, lynmelding (IM) og skrivebordsdeling. Dette kapitlet gir en kort innføring i tre av de tjenester som kreves for å drive RTC, omfattende en TURN-tjener, SIP-tjener og XMPP-tjener. Omfattende detaljinformasjon om hvordan planlegge, installere og administrere disse tjenestene er tilgjengelige i Real-Time Communications Quick Start Guide (Hurtigstartveiledning) som inneholder eksempler som er spesifikke for Debian. <ulink type="block" url="http://rtcquickstart.org" />
vi_vn: Các dịch vụ liên lạc Thời gian thực (Real-Time Communication - RTC) bao gồm dịch vụ thoại, truyền hình/webcam, nhắn tin trực tuyến (instant messaging - IM) và chia sẻ màn hình. Chương này giới thiệu ngắn gọn về ba trong số những dịch vụ buộc phải có để chạy RTC, bao gồm một máy phục vụ TURN, máy phục vụ SIP và máy phục vụ XMPP. Chi tiết đầy đủ về làm sao để lên kế hoạch, cài đặt và quản lý các dịch vụ này có sẵn trong Hướng dẫn Bắt đầu Nhanh với Liên lạc Thời gian thực vốn bao gồm các ví dụ cụ thể với Debian. <ulink type="block" url="http://rtcquickstart.org" />

source: <primary>VoIP</primary><secondary>server</secondary>
vi_vn: <primary>VoIP</primary><secondary>máy phục vụ</secondary>

source: <primary>RTC</primary><secondary>server</secondary>
vi_vn: <primary>RTC</primary><secondary>máy phục vụ</secondary>

source: <primary>Instant Messaging</primary><secondary>server</secondary>
nb_no: <primary>Instant Messaging (umiddelbare meldinger)</primary><secondary>server</secondary>
vi_vn: <primary>Nhắn tin Trực tuyến</primary><secondary>máy phục vụ</secondary>

source: <primary>Chat</primary><secondary>server</secondary>
nb_no: <primary>Chat (chatte)</primary><secondary>server</secondary>
vi_vn: <primary>Chat</primary><secondary>máy phục vụ</secondary>

source: Both SIP and XMPP can provide the same functionality. SIP is slightly more well known for voice and video while XMPP is traditionally regarded as an IM protocol. In fact, they can both be used for any of these purposes. To maximize connectivity options, it is recommended to run both in parallel.
nb_no: Både SIP og XMPP kan gi den samme funksjonaliteten. SIP er litt mer kjent for tale og video, mens XMPP er tradisjonelt ansett som en IM-protokoll. Faktisk kan begge anvendes for hvilke som helst av disse formålene. For å maksimere tilkoblingsmuligheter anbefales det å kjøre begge parallelt.
vi_vn: Cả hai SIP và XMPP đều có thể cung cấp các tính năng tương đương. SIP thì được biết đến nhiều hơn một chút cho các dịch vụ thoại và truyền hình trong khi XMPP được xem như một giao thức nhắn tin tức thời. Thực ra, cả hai đều có thể sử dụng cho bất kỳ mục đích nào. Để tối đa hóa các lựa chọn kết nối, chạy cả hai song song được khuyến cáo.

source: These services rely on X.509 certificates both for authentication and confidentiality purposes. See <xref linkend="sect.easy-rsa" /> for details on how to create them. Alternatively the <emphasis>Real-Time Communications Quick Start Guide</emphasis> also has some useful explanations: <ulink type="block" url="http://rtcquickstart.org/guide/multi/tls.html" />
nb_no: Disse tjenestene er avhengige av X.509-sertifikater både for autentiserings- og konfidensialitetsformål. Se <xref linkend="sect.easy-rsa" /> for mer informasjon om hvordan du oppretter dem. Alternativt har også <emphasis>Real-Time Communications Quick Start Guide (Sanntids kommunikasjonstjenesters Hurtigstartveiledning)</emphasis> noen nyttige forklaringer: <ulink type="block" url="http://rtcquickstart.org/guide/multi/tls.html" />
vi_vn: Các dịch vụ này dựa trên các chứng chỉ X.509 cho mục đích xác thực và bảo mật. Xem <xref linkend="sect.easy-rsa" /> để biết thêm chi tiết về cách để tạo ra chúng. Ngoài ra <emphasis>Hướng dẫn Bắt đầu Nhanh với Liên lạc Thời gian thực</emphasis> cũng có một vài cách giải thích hữu dụng: <ulink type="block" url="http://rtcquickstart.org/guide/multi/tls.html" />

source: DNS settings for RTC services
nb_no: DNS-innstillinger for RTC-tjenester
vi_vn: Các cài đặt DNS cho các dịch vụ RTC

source: RTC services require DNS SRV and NAPTR records. A sample configuration that can be placed in the zone file for <literal>falcot.com</literal>:
nb_no: RTC-tjenester krever DNS SRV- og NAPTR-registrering. Ett eksempel på oppsett som kan plasseres i sonefilen for <literal>falcot.com</literal>:
vi_vn: Các dịch vụ RTC buộc yêu cầu phải có các mẩu tin(records) DNS SRV và NAPTR. Một ví dụ về cấu hình như sau có thể được đặt vào tập tin zone cho <literal>falcot.com</literal>:

source: <primary>DNS</primary><secondary>SRV record</secondary>
nb_no: <primary>DNS</primary><secondary>SRV-post</secondary>
vi_vn: <primary>DNS</primary><secondary>mẩu tin SRV</secondary>

source: <primary>DNS</primary><secondary>NAPTR record</secondary>
vi_vn: <primary>DNS</primary><secondary>mẩu tin NAPTR</secondary>
