Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: Running services on port 443
nb_no: Å kjøre tjenester på port 443
vi_vn: Chạy các dịch vụ trên cổng 443

source: Some administrators prefer to run all of their RTC services on port 443. This helps users to connect from remote locations such as hotels and airports where other ports may be blocked or Internet traffic is routed through HTTP proxy servers.
nb_no: Noen administratorer foretrekker å kjøre alle sine RTC-tjenester på port 443. Dette hjelper brukere å koble til fra eksterne steder, som hoteller og flyplasser, der andre porter kan være blokkert, eller Internett-trafikken rutet gjennom HTTP-mellomtjenere.
vi_vn: Một vài quản trị viên thích sử dụng tất cả các dịch vụ RTC trên cổng 443. Điều này có thể giúp người sử dụng kết nối từ những địa điểm xa xôi như các khách sạn và sân bay nơi mà các cổng khác bị khóa hay đường truyền Internet bị điều hướng xuyên qua các máy phục vụ chuyển hướng HTTP.

source: To use this strategy, each service (SIP, XMPP and TURN) needs a different IP address. All the services can still be on the same host as Linux supports multiple IP addresses on a single host. The port number, 443, must be specified in the configuration files for each process and also in the DNS SRV records.
nb_no: For å bruke denne strategien trenger hver tjeneste (SIP, XMPP og TURN) en ulik IP-adresse. Alle tjenestene kan fortsatt være på samme vert ettersom Linux støtter flere IP-adresser på en enkelt vert. Portnummeret 443 må spesifiseres i konfigurasjonsfilene for hver prosess, og også i DNS SRV-registreringene.
vi_vn: Để xử dụng chiến thuật này, mỗi dịch vụ (SIP, XMPP và TURN) cần một địa chỉ IP riêng biệt. Tất cả các dịch vụ này có thể nằm trên cùng một máy bởi Linux hỗ trợ nhiều địa chỉ IP cho một máy tính duy nhất. Cổng số 443 phải được chỉ định trong các tập tin cấu hình cho mỗi tiến trình và cũng như trong các mẩu tin DNS SRV.

source: <primary>email</primary><secondary>filtering</secondary>
nb_no: <primary>e-post</primary><secondary>filtrering</secondary>

source: <primary>filtering email</primary>
nb_no: <primary>filtrering e-post</primary>

source: smtpd_restriction_classes = greylisting, aggressive, permissive greylisting = check_policy_service inet:127.0.0.1:10023 aggressive = reject_rbl_client sbl-xbl.spamhaus.org, check_policy_service inet:127.0.0.1:10023 permissive = permit smtpd_recipient_restrictions = permit_mynetworks, reject_unauth_destination, check_recipient_access hash:/etc/postfix/recipient_access
nb_no: smtpd_restriction_classes = greylisting, aggressive, permissive greylisting = check_policy_service inet:127.0.0.1:10023 aggressive = reject_rbl_client sbl-xbl.spamhaus.org, check_policy_service inet:127.0.0.1:10023 permissive = permit smtpd_recipient_restrictions = permit_mynetworks, reject_unauth_destination,Defining restriction classes in check_recipient_access hash:/etc/postfix/recipient_access

source: <primary>directives, Apache</primary>
nb_no: <primary>direktiver, Apache</primary>

source: <primary>client</primary><secondary>NFS</secondary>
nb_no: <primary>klient</primary><secondary>NFS</secondary>

source: <primary>printing</primary><secondary>network</secondary>
nb_no: <primary>skrive ut</primary><secondary>nettverk</secondary>

source: <literal>smb://<replaceable>user</replaceable>:<replaceable>password</replaceable>@<replaceable>server</replaceable>/<replaceable>printer</replaceable></literal>.
nb_no: <literal>smb://<replaceable>bruker</replaceable>:<replaceable>passord</replaceable>@<replaceable>server</replaceable>/<replaceable>skriver</replaceable></literal>.

source: Bind credentials
nb_no: Tilknytningsreferanser

source: <literal><replaceable>service</replaceable>: ldap [NOTFOUND=return] files</literal>.
nb_no: <literal><replaceable>tjeneste</replaceable>: ldap [NOTFOUND=return] files</literal>.

source: crypt
nb_no: krypten

source: <primary>LDAP</primary><secondary>secure</secondary>
nb_no: <primary>LDAP</primary><secondary>sikre</secondary>

source: <primary><foreignphrase>OpenSSL</foreignphrase></primary><secondary>creating keys</secondary>
nb_no: <primary><foreignphrase>OpenSSL</foreignphrase></primary><secondary>lage nøkler</secondary>

source: <primary>key pair</primary>
nb_no: <primary>nøkkelpar</primary>

source: <primary>repro</primary>
nb_no: <primary>repro (mellomtjener)</primary>

source: Adding WebRTC
nb_no: Å legge til WebRTC

source: Falcot wants to let customers make phone calls directly from the web site. The Falcot administrators also want to use WebRTC as part of their disaster recovery plan, so staff can use web browsers at home to log in to the company phone system and work normally in an emergency.
nb_no: Falcot ønsker å la kundene ringe direkte fra nettstedet. Falcot-administratorene ønsker også å bruke WebRTC som en del av sin gjenopprettingsplan etter uhell, slik at ansatte kan bruke nettlesere hjemme til å logge inn på selskapets telefonsystem, og fungere normalt i en nødsituasjon.

source: <emphasis>IN PRACTICE</emphasis> Try WebRTC
nb_no: <emphasis>I PRAKSIS</emphasis> Prøv WebRTC

source: <primary>WebRTC</primary><secondary>demonstration</secondary>
nb_no: <primary>WebRTC</primary><secondary>demonstrasjon</secondary>

source: If you have not tried WebRTC before, there are various sites that give an online demonstration and test facilities. <ulink type="block" url="http://www.sip5060.net/test-calls" />
nb_no: Hvis du ikke har prøvd WebRTC før, gir ulike nettsteder en tilkoblet demonstrasjon og testmuligheter. <ulink type="block" url="http://www.sip5060.net/test-calls" />

source: WebRTC is a rapidly evolving technology and it is essential to use packages from the <emphasis role="distribution">jessie-backports</emphasis> or <emphasis role="distribution">Testing</emphasis> distributions.
nb_no: WebRTC er en teknologi i raskt utvikling, og det er viktig å bruke pakker fra <emphasis role="distribution">jessie-backports</emphasis>, eller <emphasis role="distribution">Testing</emphasis>-distribusjonene.

source: JSCommunicator is a generic, unbranded WebRTC phone that does not require any server-side scripting such as PHP. It is built exclusively with HTML, CSS and JavaScript. It is the basis for many other WebRTC services and modules for more advanced web publishing frameworks. <ulink type="block" url="http://jscommunicator.org" />
nb_no: JSCommunicator er en generisk, ikke-varemerket WebRTC-telefon som ikke krever noen tjener-side skripting som PHP. Den er bygget utelukkende med HTML, CSS og Javascript. Den er grunnlaget for mange andre WebRTC-tjenester og moduler til mer avanserte nettpubliseringsrammeprogrammer.<ulink type="block" url="http://jscommunicator.org" />

source: The package <emphasis role="pkg">jscommunicator-web-phone</emphasis> is the quickest way to install a WebRTC phone into a web site. It requires a SIP proxy with a WebSocket transport. The instructions in <xref linkend="sect.sip-server-install" /> include the necessary details to enable the WebSocket transport in the <emphasis role="pkg">repro</emphasis> SIP proxy.
nb_no: Pakken <emphasis role="pkg">jscommunicator-web-phone</emphasis> er den raskeste måten å installere en WebRTC-telefon på i et nettsted. Den krever en SIP-mellomtjener med WebSocket-transport. Instruksjonene i <xref linkend="sect.sip-server-install" /> inkluderer de nødvendige opplysninger for å aktivere WebSocket-transport i <emphasis role="pkg">repro</emphasis> SIP-mellomtjeneren.

source: After installing <emphasis role="pkg">jscommunicator-web-phone</emphasis>, there are various ways to use it. A simple strategy is to include or copy the configuration from <filename>/etc/jscommunicator-web-phone/apache.conf</filename> into an Apache virtual host configuration.
nb_no: Etter å ha installert <emphasis role="pkg">jscommunicator-web-phone</emphasis>, er det ulike måter å bruke den på. En enkel strategi er å inkludere eller kopiere konfigurasjonsfilene fra <filename>/etc/jscommunicator-web-phone/apache.conf</filename> i en Apache virtuell vertskonfigurasjon.

source: Once the web-phone files are available in the web server, customize the <filename>/etc/jscommunicator-web-phone/config.js</filename> to point at the TURN server and SIP proxy. For example:
nb_no: Når web-telefonfiler er tilgjengelig i nett-tjeneren, tilpass <filename>/etc/jscommunicator-web-phone/config.js</filename> til å peke på TURN-tjeneren og SIP-mellomtjeneren. For eksempel:

source: More advanced click-to-call web sites typically use server-side scripting to generate the <literal>config.js</literal> file dynamically. The <ulink url="http://drucall.org">DruCall</ulink> source code demonstrates how to do this with PHP.
nb_no: Mer avanserte «klikk for å ringe»-nettsider bruker vanligvis tjenerside skripting for å generere <literal>config.js</literal>-filen dynamisk. <ulink url="http://drucall.org">DruCall</ulink>-kildekoden demonstrerer hvordan det kan gjøres med PHP.

source: This chapter sampled only a fraction of the available server software; however, most of the common network services were described. Now it is time for an even more technical chapter: we'll go into deeper detail for some concepts, describe massive deployments and virtualization.
nb_no: Dette kapittelet har valgt ut bare en brøkdel av den tilgjengelige tjenerprogramvaren; men de fleste av de vanlige nett-tjenestene er beskrevet. Nå er tiden inne for et enda mer teknisk kapittel: Vi vil gå dypere inn i detaljene for noen begreper, beskrive massive utplasseringer og virtualisering.
