Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: Network Services: Postfix, Apache, NFS, Samba, Squid, LDAP, SIP, XMPP, TURN
nb_no: Nettverkstjenester: Postfix, Apache, NFS, Samba, Squid, LDAP, SIP, XMPP, TURN
vi_vn: Những dịch vụ mạng: Postfix, Apache, NFS, Samba, Squid, LDAP, SIP, XMPP, TURN

source: Network services are the programs that users interact with directly in their daily work. They are the tip of the information system iceberg, and this chapter focuses on them; the hidden parts they rely on are the infrastructure we already described.
nb_no: Nettjenester er de programmene som brukerne direkte samhandler med i sitt daglige arbeid. De er toppen av informasjonssystemets isfjell, og dette kapittelet fokuserer på dem - de skjulte delene de er avhengige av er den infrastrukturen vi allerede har beskrevet.
vi_vn: Những dịch vụ mạng là các chương trình mà người sử dụng tương tác trực tiếp trong công việc hằng ngày. Chúng được ví như phần đỉnh của tảng băng thông tin, và trong chương này, chúng ta sẽ tập trung tìm hiểu về phần đỉnh này; các thành phần ẩn của tảng băng mà các dịch vụ này đang dựa trên chính là cơ sở hạ tầng mạng mà chúng ta đã tìm hiểu trong những phần trước.

source: Many modern network services require encryption technology to operate reliably and securely, especially when used on the public Internet. X.509 Certificates (which may also be referred to as SSL Certificates or TLS Certificates) are frequently used for this purpose. A certificate for a specific domain can often be shared between more than one of the services discussed in this chapter.
nb_no: Mange moderne nettverkstjenester krever krypteringsteknologi for å fungere på en pålitelig og sikker måte, spesielt når de brukes på det offentlige Internettet. X.509-sertifikater (som også kan refereres til som SSL-sertifikater) eller TLS-sertifikater) brukes ofte til dette formålet. Et sertifikat for et bestemt domene kan ofte deles mellom mer enn en av tjenestene som er omtalt i dette kapittelet.
vi_vn: Các dịch vụ mạng hiện nay thường yêu cầu cơ chế mã hóa để đảm bảo độ tin cậy và an toàn trong quá trình vận hành, đặc biệt khi chúng được sử dụng trên mạng Internet công cộng. Chứng chỉ X.509 (cũng được biết tới là chứng chỉ SSL hay chứng chỉ TLS) thường được sử dụng cho mục đích này. Một chứng chỉ cho một tên miền cụ thể thường được chia sẻ bởi ít nhất hai dịch vụ mạng được thảo luận trong chương này.

source: <primary>Certificates</primary>
nb_no: <primary>sertifikater</primary>
vi_vn: <primary>các giấy tờ chứng thực</primary>

source: Mail Server
nb_no: Posttjener
vi_vn: Máy phục vụ thư điện tử

source: The Falcot Corp administrators selected Postfix for the electronic mail server, due to its reliability and its ease of configuration. Indeed, its design enforces that each task is implemented in a process with the minimum set of required permissions, which is a great mitigation measure against security problems.
nb_no: Administratorer i Falcot Corp valgte ut Postfix som elektronisk posttjener, på grunn av påliteligheten og en enkel konfigurasjon. Designet sikrer fakstisk at hver oppgave blir gjennomført i en prosess med et minimum sett av nødvendige tillatelser, et godt forebyggende tiltak mot sikkerhetsproblemer.
vi_vn: Các quản trị viên của công ty Falcot đã chọn Postfix để làm máy chủ thư điện tử của họ vì tính tin cậy của nó và sự đơn giản trong việc cấu hình. Thực vậy, thiết kế của nó đảm bảo mỗi một tác vụ (task) được thực hiện trong một tiến trình (process) với rất ít quyền được cho phép, điều này rất tốt khi nó hạn chế rất nhiều vấn đề rủi ro.

source: <primary>email</primary><secondary>server</secondary>
nb_no: <primary>e-post</primary><secondary>tjener (server)</secondary>
vi_vn: <primary>thư điện tử</primary><secondary>máy phục vụ</secondary>

source: <primary>mail server</primary>
nb_no: <primary>e-posttjener</primary>
vi_vn: <primary>máy phục vụ thư điện tử (mail server)</primary>

source: <emphasis>ALTERNATIVE</emphasis> The Exim4 server
nb_no: <emphasis>ALTERNATIV</emphasis> Exim4-tjeneren
vi_vn: <emphasis>LỰA CHỌN THAY THẾ</emphasis> Máy phục vụ Exim4

source: Debian uses Exim4 as the default email server (which is why the initial installation includes Exim4). The configuration is provided by a separate package, <emphasis role="pkg">exim4-config</emphasis>, and automatically customized based on the answers to a set of Debconf questions very similar to the questions asked by the <emphasis role="pkg">postfix</emphasis> package.
nb_no: Debian bruker Exim4 som standard e-posttjener (som er grunnen til at den første installasjonen inkluderer Exim4). Konfigurasjonen er levert av en egen pakke, <emphasis role="pkg">exim4-config</emphasis>, og automatisk tilpasset basert på svar på et sett med Debconf-spørsmål svært lik spørsmålene fra <emphasis role="pkg">postfix</emphasis>-pakken.
vi_vn: Debian sử dụng Exim4 làm máy chủ thư điện tử (đó là lý do tại sao các thiết lặp cài đặt bao gồm cả Exim4). Cấu hình của Exim4 được cung cấp bởi một gói riêng, <emphasis role="pkg">exim4-config</emphasis>, và được tùy chỉnh một cách tự động bằng cách trả lời những cấu hỏi của Debconf, chúng cũng tương tự như nhưng câu hỏi cấu hình của <emphasis role="pkg">postfix</emphasis>.

source: The configuration can be either in one single file (<filename>/etc/exim4/exim4.conf.template</filename>) or split across a number of configuration snippets stored under <filename>/etc/exim4/conf.d/</filename>. In both cases, the files are used by <command>update-exim4.conf</command> as templates to generate <filename>/var/lib/exim4/config.autogenerated</filename>. The latter is the file used by Exim4. Thanks to this mechanism, values obtained through Exim's debconf configuration — which are stored in <filename>/etc/exim4/update-exim4.conf.conf</filename> — can be injected in Exim's configuration file, even when the administrator or another package has altered the default Exim configuration.
nb_no: Konfigurasjonen kan enten være i en enkelt fil (<filename>/etc/exim4/exim4.conf.template</filename>), eller delt på tvers av en rekke konfigurasjonssnutter lagret under <filename>/etc/exim4/conf.d/</filename>. I begge tilfeller brukes filene av <command>update-exim4.conf</command> som maler for å generere <filename>/var/lib/exim4/config.autogenerated</filename>. Den sistnevnte er filen som brukes av Exim4. Takket være denne mekanismen kan verdier som fås gjennom Exims debconf-konfigurasjon - som er lagret i <filename>/etc/exim4/update-exim4.conf.conf</filename> - legges inn i Exims konfigurasjonsfil, selv når administratoren eller en annen pakke har endret Exims standardoppsett.
vi_vn: Cấu hình có thể hnằm trong từng tập tin (<filename>/etc/exim4/exim4.conf.template</filename>) hoặc được chia thành các đoạn cấu hình và được lưu ở <filename>/etc/exim4/conf.d</filename>. Trong cả hai trường hợp, các tập tin sẽ được dùng bởi lệnh <command>update-exim4.conf</command> như là các mẫu để sinh ra tập tin <filename>/var/lib/exim4/config.autogenerated</filename>. Đây là tập tin sẽ được Exim4 sử dụng. Nhờ vào cơ chế này, các giá trị lấy được trong quá trình cấu hình Exim's debconf - được lưu trong <filename>/etc/exim4/update-exim4.conf.conf</filename> - có thể được chèn vào tập tin cấu hình của Exim, ngay cả khi quản trị viên hay các gói khác vừa thay đổi giá trị mặc định trong cấu hình Exim.

source: The Exim4 configuration file syntax has its peculiarities and its learning curve; however, once these peculiarities are understood, Exim4 is a very complete and powerful email server, as evidenced by the tens of pages of documentation. <ulink type="block" url="http://www.exim.org/docs.html" />
nb_no: Syntaksen til Exim4s konfigurasjonsfil har sine særegenheter og sin læringskurve; men når disse særegenheter blir forstått, er Exim4 en svært komplett og kraftig e-posttjener, noe som gjenspeiles av de titalls sidene med dokumentasjon. <ulink type="block" url="http://www.exim.org/docs.html" />
vi_vn: Cú pháp của tập tin cấu hình khá phức tạp; tuy nhiên, khi đã hiểu, Exim4 là một máy phục vụ thư điện tử mạnh và hoàn thiện, như đã được chứng minh bởi hàng chục trang tài liệu hướng dẫn. <ulink type="block" url="http://www.exim.org/docs.html" />

source: Installing Postfix
nb_no: Å installere Postfix
vi_vn: Cài đặt Postfix

source: The <emphasis role="pkg">postfix</emphasis> package includes the main SMTP daemon. Other packages (such as <emphasis role="pkg">postfix-ldap</emphasis> and <emphasis role="pkg">postfix-pgsql</emphasis>) add extra functionality to Postfix, including access to mapping databases. You should only install them if you know that you need them.
nb_no: Pakken <emphasis role="pkg">postfix</emphasis> omfatter den viktigste SMTP-nissen. Andre pakker (slik som <emphasis role="pkg">postfix-ldap</emphasis> og <emphasis role="pkg">postfix-pgsql</emphasis>) legger til ekstra funksjonalitet til Postfix, medregnet tilgang til kartdatabaser. Du bør bare installere dem hvis du vet at du trenger dem.
vi_vn: Gói phần mềm <emphasis role="pkg">postfix</emphasis> bao gồm một dịch vụ chạy nền chủ lực SMTP. Các gói phần mềm khác (như <emphasis role="pkg">postfix-ldap</emphasis> và <emphasis role="pkg">postfix-pgsql</emphasis>) mang lại thêm các tính năng cho Postfix, bao gồm truy cập tới các cơ sở dữ liệu ánh xạ (mapping databases). Bạn chỉ nên cài đặt chúng khi bạn thực sự biết là bạn cần chúng.

source: <emphasis>BACK TO BASICS</emphasis> SMTP
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> SMTP
vi_vn: <emphasis>TRỞ VỀ CĂN BẢN</emphasis> SMTP

source: <primary>server</primary><secondary>SMTP</secondary>
nb_no: <primary>tjener</primary><secondary>SMTP</secondary>
vi_vn: <primary>máy phục vụ</primary><secondary>SMTP</secondary>

source: SMTP (<emphasis>Simple Mail Transfer Protocol</emphasis>) is the protocol used by mail servers to exchange and route emails.
nb_no: SMTP (<emphasis>Simple Mail Transfer Protocol</emphasis>) er protokollen som brukes av e-posttjenere for å utveksle og rute e-poster.
vi_vn: SMTP (<emphasis>Simple Mail Transfer Protocol</emphasis>) là một chuẩn giao tiếp giữa các máy phục vụ thư điện tử để trao đổi và chỉ đường cho các thư điện tử.

source: Several Debconf questions are asked during the installation of the package. The answers allow generating a first version of the <filename>/etc/postfix/main.cf</filename> configuration file.
nb_no: Flere Debconf-spørsmål stilles under installasjonen av pakken. Svarene tillater å generere en første versjon av <filename>/etc/postfix/main.cf</filename>-konfigureringsfil.
vi_vn: Một số câu hỏi Debconf được đưa ra trong quá trình cài đặt gói phần mềm. Các câu trả lời cho phép tạo ra phiên bản đầu tiên tập tin cấu hình <filename>/etc/postfix/main.cf</filename>.

source: The first question deals with the type of setup. Only two of the proposed answers are relevant in case of an Internet-connected server, “Internet site” and “Internet with smarthost”. The former is appropriate for a server that receives incoming email and sends outgoing email directly to its recipients, and is therefore well-adapted to the Falcot Corp case. The latter is appropriate for a server receiving incoming email normally, but that sends outgoing email through an intermediate SMTP server — the “smarthost” — rather than directly to the recipient's server. This is mostly useful for individuals with a dynamic IP address, since many email servers reject messages coming straight from such an IP address. In this case, the smarthost will usually be the ISP's SMTP server, which is always configured to accept email coming from the ISP's customers and forward it appropriately. This setup (with a smarthost) is also relevant for servers that are not permanently connected to the internet, since it avoids having to manage a queue of undeliverable messages that need to be retried later.
nb_no: Det første spørsmålet håndterer typen oppsett. Bare to av de foreslåtte svarene passer for en Internett-tilkoblet tjener, «Internet site» (Internett-nettsted) og «Internet with smarthost» (Internett med smartvert). Førstnevnte passer for en tjener som mottar innkommende e-post, og sender utgående e-post direkte til sine mottakere, og er derfor godt tilpasset i Falcot Corps tilfelle. Sistnevnte passer for en tjener som mottar innkommende e-post som normalt, men som sender utgående e-post via en mellomliggende SMTP-tjener - en «smartvert» - i stedet for direkte til mottakerens tjener. Dette er mest nyttig for personer med en dynamisk IP-adresse, siden mange e-posttjenere avviser meldinger som kommer rett fra en slik IP-adresse. I dette tilfellet vil en smartvert vanligvis være ISPs SMTP-tjener, som alltid er konfigurert til å godta e-post som kommer fra ISPs brukere, og videresende den på riktig måte. Dette oppsettet (med smartvert) passer også for tjenere som ikke er permanent koblet til Internett, da det unngår å måtte håndtere en kø med ikke-leverbare meldinger som ikke kan leveres, og som må prøves igjen senere.
vi_vn: Câu hỏi đầu tiên là về loại cấu hình. Chỉ có hai trong các câu trả lời được đề xuất là hữu dụng cho trường hợp một máy phục vụ có kết nối Internet, "Internet site" và "Internet with smarthost". Lựa chọn đầu tiên dành cho một máy phục vụ được sắp đặt để nhận thư điện tử đến và gửi trực tiếp thư điện tử đi tới các người nhận. Lựa chọn này phù hợp cho trường hợp của công ty Falcot. Lựa chọn thứ hai dành cho một máy phục vụ nhận thư điện tử đến như bình thường, nhưng gửi thư điện tử đi thông qua một máy phục vụ SMTP trung gian - "máy smarthost" - thay vì đi thẳng tới máy phục vụ của người nhận. Đây là trường hợp tốt nhất cho các cá nhân với một địa chỉ IP động, bởi các máy phục vụ thư điện thử từ chối các tin nhắn đến thẳng từ một địa chỉ IP như thế. Trong trường hợp này, máy tính thông minh (smarthost) sẽ là máy phục vụ SMTP của ISP, vốn luôn được cấu hình để nhận các thư điện tử đến từ các ISP và chuyển hướng nó sao cho phù hợp. Cách sắp đặt (với một máy chủ thông minh (smarthost)) cũng liên quan tới các máy phục vụ vốn không được kết nối Internet thường xuyên, vì cách này tránh được việc phải quản lý một chồng tin nhắn không thể gửi đi và cần phải được thử gửi lại sau đó.

source: <emphasis>VOCABULARY</emphasis> ISP
nb_no: <emphasis>ORDFORRÅD</emphasis> ISP
vi_vn: <emphasis>TỪ VỰNG</emphasis> ISP

source: <primary>ISP, Internet Service Provider</primary>
nb_no: <primary>ISP, Internet Service Provider (Internett-leverandør)</primary>
vi_vn: <primary>ISP, nhà cung cấp dịch vụ Internet</primary>

source: ISP is the acronym for “Internet Service Provider”. It covers an entity, often a commercial company, that provides Internet connections and the associated basic services (email, news and so on).
nb_no: ISP er en forkortelse for «Internet Service Provider». Den dekker en enhet, ofte et kommersielt selskap, som leverer Internett-tilkoblinger og tilhørende basistjenester (e-post, nyheter og så videre).
vi_vn: ISP là tên viết tắt của "Internet Service Provider". Nó bao phủ một tập thể, thông thường là một công ty, cung cấp các kết nối Internet và các dịch vụ cơ bản đi kèm khác (thư điện tử, tin tức và vâng vâng).

source: The second question deals with the full name of the machine, used to generate email addresses from a local user name; the full name of the machine ends up as the part after the at-sign (“@”). In the case of Falcot, the answer should be <literal>mail.falcot.com</literal>. This is the only question asked by default, but the configuration it leads to is not complete enough for the needs of Falcot, which is why the administrators run <command>dpkg-reconfigure postfix</command> so as to be able to customize more parameters.
nb_no: Det andre spørsmålet omfatter det fulle navnet på maskinen, som brukes til å generere e-postadresser fra et lokalt brukernavn; hele navnet på maskinen kommer opp som en del etter at-skiltet/krøllalfa («@»). For Falcots del bør svaret være <literal>mail.falcot.com</literal>. Dette er det eneste spørsmålet ved oppstart, men oppsettet den fører til er ikke komplett nok for behovene til Falcot, noe som er grunnen til at administratorene kjører <command>dpkg-reconfigure postfix</command>, slik at man er i stand til å tilpasse flere parametre.
vi_vn: Câu hỏi thứ hai liên quan tới tên đầy đủ của máy tính, thường được dùng để tạo ra địa chỉ thư điện tử từ tên người dùng nội bộ; tên đầy đủ của máy tính thường nằm sau dấu @. Trong tình huống của Falcot, câu trả lời nên là <literal>mail.falcot.com</literal>. Đây là câu hỏi duy nhất được hỏi theo ngầm định, nhưng cấu hình có được từ câu hỏi này không đáp ứng hết các nhu cầu của Falcot, đó là lý do các nhà quản trị hệ thống chạy <command>dpkg-reconfigure postfix</command> để có thể tùy chỉnh thêm nhiều tham số.

source: One of the extra questions asks for all the domain names related to this machine. The default list includes its full name as well as a few synonyms for <literal>localhost</literal>, but the main <literal>falcot.com</literal> domain needs to be added by hand. More generally, this question should usually be answered with all the domain names for which this machine should serve as an MX server; in other words, all the domain names for which the DNS says that this machine will accept email. This information ends up in the <literal>mydestination</literal> variable of the main Postfix configuration file — <filename>/etc/postfix/main.cf</filename>.
nb_no: Ett av de ekstra spørsmålene gjelder å få alle domenenavn knyttet til denne maskinen. Standardlisten inneholder dets fulle navn, samt noen få synonymer for <literal>localhost</literal>, men hoveddomenet <literal>falcot.com</literal> må legges for hånd. Mer generelt bør dette spørsmålet vanligvis besvares med alle domenenavnene som denne maskinen skal tjene som MX-tjener for; med andre ord, alle domenenavnene for hvem DNS sier at denne maskinen vil akseptere e-post. Denne informasjonen ender opp i <literal>mydestination</literal>-variabelen i Postfixs hovedoppsettsfil - <filename>/etc/postfix/main.cf</filename>.
vi_vn: Một trong các câu hỏi thêm hỏi về các tên miền liên quan đến chiếc máy tính này. Danh sách ngầm định bao gồm tên đầy đủ của nó và các từ đồng nghĩa cho <literal>localhost</literal>, nhưng tên miền chính thức <literal>falcot.com</literal> cần phải được thêm vào bằng tay. Tổng quát hơn, câu hỏi này nên thường được trả lời với các tên miền chiếc máy tính này đang phục vụ như là một máy phục vụ MX; nói cách khác, tất cả các tên miền mà DNS cho rằng chiếc máy tính này sẽ nhận thư điện tử cho. Thông tin này nằm trong tham biến <literal>mydestination</literal> của tập tin cấu hình chính của Postfix - <filename>/etc/postfix/main.cf</filename>.

source: <primary>server</primary><secondary>MX</secondary>
nb_no: <primary>tjener</primary><secondary>MX</secondary>
vi_vn: <primary>máy phục vụ</primary><secondary>MX</secondary>

source: <primary>MX</primary><secondary>server</secondary>
nb_no: <primary>MX</primary><secondary>tjener</secondary>
vi_vn: <primary>MX</primary><secondary>máy phục vụ</secondary>

source: Role of the DNS <emphasis>MX</emphasis> record while sending a mail
nb_no: Rollen til DNS <emphasis>MX</emphasis>-registrering ved sending av en e-post
vi_vn: Vai trò của mẩu tin DNS <emphasis>MX</emphasis> khi gửi thư

source: <emphasis>EXTRA</emphasis> Querying the MX records
nb_no: <emphasis>EKSTRA</emphasis> Å spørre MX-registreringene
vi_vn: <emphasis>THÊM</emphasis> Tra cứu các mẩu tin MX

source: When the DNS does not have an MX record for a domain, the email server will try sending the messages to the host itself, by using the matching A record (or AAAA in IPv6).
nb_no: Når DNS ikke har en MX-registrering for et domene, vil e-posttjeneren prøve å sende meldingene til verten selv ved hjelp av den matchende A-posten (eller AAAA i IPv6).
vi_vn: Khi DNS không có mẩu tin MX cho một tên miền, máy phục vụ thư điện tử sẽ thử tự gửi các tin nhắn tới máy đích, bắng việc sử dụng mẩu tin A tương ứng (A record) (hoặc AAAA trong IPv6).

source: In some cases, the installation can also ask what networks should be allowed to send email via the machine. In its default configuration, Postfix only accepts emails coming from the machine itself; the local network will usually be added. The Falcot Corp administrators added <literal>192.168.0.0/16</literal> to the default answer. If the question is not asked, the relevant variable in the configuration file is <literal>mynetworks</literal>, as seen in the example below.
nb_no: I noen tilfeller kan installasjonen også spørre hvilke nettverk som skal få lov til å sende e-post via maskinen. I standardkonfigurasjonen aksepterer Postfix kun e-postmeldinger som kommer fra selve maskinen; det lokale nettverket vil vanligvis bli lagt til. Falcot Corp-administratorene la til <literal>192.168.0.0/16</literal> til standardsvaret. Hvis spørsmålet ikke er spurt, er den relevante variabel i konfigurasjonsfilen <literal>mynetworks</literal>, slik som i eksemplet nedenfor.
vi_vn: Trong một vài tình huống, quá trình cài đặt cũng có thể hỏi những mạng máy tính nào nên được cho phép để nhận thư điện tử thông qua máy tính này. Trong cấu hình ngầm định của nó, Postfix chỉ chấp nhận các thư điện tử đến từ máy tính này mà thôi; mạng máy tính nội bộ thường sẽ được thêm vào. Các nhà quản trị hệ thống của Falcot Corp đã thêm <literal>192.168.0.0/16</literal> vào câu trả lời ngầm định. Nếu câu hỏi không được đưa ra, một tham biến có liên quan đến điều này trong tập tin cấu hình là <literal>mynetworks</literal>, như được trình bày trong ví dụ dưới đây.

source: Local email can also be delivered through <command>procmail</command>. This tool allows users to sort their incoming email according to rules stored in their <filename>~/.procmailrc</filename> file.
nb_no: Lokal e-post kan også leveres via <command>procmail</command>. Dette verktøyet tillater brukere å sortere sin innkommende e-post etter regler som er lagret i deres <filename>~/.procmailrc</filename>-fil.
vi_vn: Thư điện tử nội bộ có thể được chuyển phát thông qua <command>procmail</command>. Công cụ này cho phép những người sử dụng sắp xếp thư điện tử dựa trên các nguyên tắc lưu trong tập tin <filename>~/.procmailrc</filename>.

source: After this first step, the administrators got the following configuration file; it will be used as a starting point for adding some extra functionality in the next sections.
nb_no: Etter dette første trinnet, fikk administratorene den etterfølgende konfigurasjonsfil; den vil bli brukt som et utgangspunkt for å legge til noe ekstra funksjonalitet i de neste seksjonene.
vi_vn: Sau bước đầu tiên này, những nhà quản trị hệ thống đã có được tập tin cấu hình sau đây; tập tin này sẽ được sử dụng như một điểm bắt đầu để thêm các tính năng phụ thêm trong các phần tiếp theo.

source: Initial <filename>/etc/postfix/main.cf</filename> file
nb_no: Innledende <filename>/etc/postfix/main.cf</filename>-fil
vi_vn: Tập tin <filename>/etc/postfix/main.cf</filename> ban đầu
