Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: Each time Postfix reaches this rule in the ruleset, it will connect to the <command>postgrey</command> daemon and send it information concerning the relevant message. On its side, Postgrey considers the IP address/sender/recipient triplet and checks in its database whether that same triplet has been seen recently. If so, Postgrey replies that the message should be accepted; if not, the reply indicates that the message should be temporarily rejected, and the triplet gets recorded in the database.
nb_no: Hver gang Postfix treffer denne regelen i regelsettet, vil den koble til <command>postgrey</command>-nissen, og sende den informasjon om den aktuelle meldingen. På sin side, vurderer Postgrey trillingen/trippelen IP-«adresse/avsende/mottaker», og sjekker i sin database om det samme trillingen er sett i det siste. Hvis ja, svarer Postgrey at meldingen skal godtas; hvis ikke, indikerer svaret at meldingen skal avvises midlertidig, og trillingen blir registrert i databasen.
vi_vn: Mỗi lần Postfix nhảy đến quy tắc này trong tập hợp các quy tắc, nó sẽ kết nối tới tiến trình nền <command>postgrey</command> và gửi ra thông tin liên quan đến thông điệp cần sự chú ý. Bên phần của nó, Postgrey xem xét bộ ba địa chỉ IP/người gửi/người nhận và kiểm tra trong cơ sở dữ liệu của nó xem có một bộ ba y hệt như vậy được nhìn thấy trước đây chưa. Nếu đúng là như vậy, Postgrey trả lời lại rằng thông điệp này nên được nhận; nếu không, câu trả lời cho rằng thông điệp nên bị tạm thời từ chối, và bộ ba này sẽ được ghi lại vào trong cơ sở dữ liệu.

source: The main disadvantage of greylisting is that legitimate messages get delayed, which is not always acceptable. It also increases the burden on servers that send many legitimate emails.
nb_no: Den største ulempen med grålisting er at legitime meldinger bli forsinket, noe som ikke alltid er akseptabelt. Det øker også belastningen på tjenerne som sender mange legitime e-poster.
vi_vn: Bất lợi chính của đánh dấu xám là những thông điệp hợp lệ sẽ bị trễ, vốn không phải lúc nào cũng chấp nhận được. Nó cũng tăng lượng công việc cho các máy phục vụ vốn gửi ra các thư điện tử hợp lệ.

source: <emphasis>IN PRACTICE</emphasis> Shortcomings of greylisting
nb_no: <emphasis>I PRAKSIS</emphasis> Svakhetene i grålisting
vi_vn: <emphasis>TRÊN THỰC TẾ</emphasis> Những điểm yếu của đánh dấu xám

source: Theoretically, greylisting should only delay the first mail from a given sender to a given recipient, and the typical delay is in the order of minutes. Reality, however, can differ slightly. Some large ISPs use clusters of SMTP servers, and when a message is initially rejected, the server that retries the transmission may not be the same as the initial one. When that happens, the second server gets a temporary error message due to greylisting too, and so on; it may take several hours until transmission is attempted by a server that has already been involved, since SMTP servers usually increase the delay between retries at each failure.
nb_no: Teoretisk bør grålisting bare forsinke den første posten fra en gitt sender til en gitt mottaker, og den typiske forsinkelsen er i størrelsesorden minutter. Virkeligheten kan, imidlertid, avvike noe. Noen store ISP-er bruker klynger av SMTP-tjenere, og når en melding innledningsvis er avslått, er kanskje den tjeneren som prøver å gjenoppta overføringen, ikke den samme som den opprinnelige. Når det skjer, får den andre tjeneren også en midlertidig feilmelding på grunn av grålisting, og så videre. Det kan ta flere timer før overføringen er forsøkt av en tjener som allerede har vært involvert, ettersom SMTP-tjenere ved hver feil vanligvis øke forsinkelsen.
vi_vn: Về lý thuyết, việc đánh dấu xảm chỉ nền làm trễ thư điện tử đầu tiên từ một người gửi nào đó đến một người nhận nào đó, và sự trễ đặc trưng này thường trong tầm vài phút. Tuy nhiên, thực tế có thể khác biệt đôi chút. Một vài ISP lớn sử dụng nhiều cụm máy phục vụ SMTP, và khi một thông điện được từ chối lần đầu tiên, máy phục vụ nhận nhiệm vụ thử gửi lại sẽ không phải là máy phục vụ gửi thư đi lần đầu tiên. Khi điều đó xảy ra, máy phục vụ thứ hai sẽ nhận một thông điệp lỗi tạm thời cũng do đánh dấu xám, và vâng vâng; nó có thể mất vài giờ cho đến khi việc gửi được thử lại bởi một máy phục vụ đã tham gia vào trước đó, bởi các máy phục vụ SMTP thường tăng thời gian chờ giữa những lần thử lại khi gặp sự cố.

source: As a consequence, the incoming IP address may vary in time even for a single sender. But it goes further: even the sender address can change. For instance, many mailing-list servers encode extra information in the sender address so as to be able to handle error messages (known as <emphasis>bounces</emphasis>). Each new message sent to a mailing-list may then need to go through greylisting, which means it has to be stored (temporarily) on the sender's server. For very large mailing-lists (with tens of thousands of subscribers), this can soon become a problem.
nb_no: Som en konsekvens kan den innkommende IP-adressen variere i tid, selv for en enkelt sender. Men det går videre; selv avsenderadressen kan endres. For eksempel; mange postlistetjenere koder inn ekstra informasjon i avsenderadressen, for å være i stand til å håndtere feilmeldinger (kjent som <emphasis>bounces</emphasis>). Hver ny melding sendt til en adresseliste kan så trenge å gå gjennom grålisting, noe som betyr at den må lagres (midlertidig) på senderens tjener. For svært store e-postlister (med titusenvis av abonnenter), kan dette fort bli et problem.
vi_vn: Chính vì vậy, địa chỉ IP đến có thể thay đổi theo thời gian thậm chí chỉ với một người gửi duy nhất. Nó còn có thể đi xa hơn thế: thậm chí địa chỉ người gửi cũng có thể thay đổi. Ví dụ, nhiều máy phục vụ bó thư điện tử(mailing list) mã hóa thông tin trong địa chỉ người gửi để có thể xử lý thông điệp lỗi (được biết đến như là <emphasis>những lần dội lại(bounces)</emphasis>). Mỗi thông điệp mới được gửi tới một bó thư điện tử có thể phải đi qua việc đánh dấu xám, vốn có nghĩa là nó phải được lưu lại (tạm thời) trên máy phục vụ của người gửi. Với những bó thư điện tử cực lớn (với hàng chục ngàn người đăng ký), điều này có thể trở thành một vấn đề.

source: To mitigate these drawbacks, Postgrey manages a whitelist of such sites, and messages emanating from them are immediately accepted without going through greylisting. This list can easily be adapted to local needs, since it is stored in the <filename>/etc/postgrey/whitelist_clients</filename> file.
nb_no: For å redusere disse ulempene administrerer Postgrey en hviteliste med slike steder, og meldinger som kommer fra dem, blir umiddelbart akseptert uten å gå gjennom grålisting. Denne listen kan lett tilpasses de lokale behov, ettersom det er lagret i <filename>/etc/postgrey/whitelist_clients</filename>-filen.
vi_vn: Để chống lại những yếu điểm này, Postgrey quản lý một danh sách trắng với những trang sạch như vậy, và những thông điệp xuất phát từ chúng được nhận ngay lập tức mà không phải đi qua đánh dấu xám. Danh sách này có thể được điều chỉnh dễ dành để đáp ứng những nhu cầu nội bộ, bởi vì nó được lưu trong tập tin <filename>/etc/postgrey/whitelist_clients</filename>.

source: <emphasis>GOING FURTHER</emphasis> Selective greylisting with <emphasis role="pkg">milter-greylist</emphasis>
nb_no: <emphasis>FOR VIDEREKOMMENDE</emphasis> Selektiv grålisting med <emphasis role="pkg">milter-greylist</emphasis>
vi_vn: <emphasis>TIẾN XA HƠN</emphasis> Đánh dấu xám có chọn lọc với <emphasis role="pkg">milter-greylist</emphasis>

source: The drawbacks of greylisting can be mitigated by only using greylisting on the subset of clients that are already considered as probable sources of spam (because they are listed in a DNS blacklist). This is not possible with <emphasis role="pkg">postgrey</emphasis> but <emphasis role="pkg">milter-greylist</emphasis> can be used in such a way.
nb_no: Ulempene med grålisting kan reduseres ved å bruke grålisting bare på undergruppen av klienter som allerede regnes som sannsynlige kilder til spam (fordi de er oppført i en DNS-svarteliste). Dette er ikke mulig med <emphasis role="pkg">postgrey</emphasis> men <emphasis role="pkg">milter-greylist</emphasis> kan anvendes på en slik måte.
vi_vn: Những yếu điểm của đánh dấu xám có thể được chặn bởi việc sử dụng đánh dấu xám trên một tập hợp con những máy khách được cho là gốc của các thư rác (bởi chúng được liệt kê trong danh sách đen DNS). Điều này là không khả thi với <emphasis role="pkg">postgrey</emphasis> nhưng <emphasis role="pkg">milter-greylist</emphasis> có thể được sử dụng theo cách này.

source: In that scenario, since DNS blacklists never triggers a definitive rejection, it becomes reasonable to use aggressive blacklists, including those listing all dynamic IP addresses from ISP clients (such as <literal>pbl.spamhaus.org</literal> or <literal>dul.dnsbl.sorbs.net</literal>).
nb_no: I dette scenariet, ettersom DNS-svartelister aldri utløser en endelig avvisning, blir det naturlig å bruke aggressive svartelister, medregnet de som viser alle dynamiske IP-adresser fra ISP-klienter (for eksempel<literal>pbl.spamhaus.org</literal>, eller <literal>dul.dnsbl.sorbs.net</literal>).
vi_vn: Trong tình huống đó, bởi các danh sách đen DNS không bao giờ kích hoạt một sự từ chối tức thời, sẽ là có lý nếu sử dụng các danh sách đen mạnh hơn, bao gồm đưa vào danh sách những địa chỉ IP động của những khách hàng ISP (như là <literal>pbl.spamhaus.org</literal> hay <literal>dul.dnsbl.sorbs.net</literal>).

source: Since milter-greylist uses Sendmail's milter interface, the postfix side of its configuration is limited to “<literal>smtpd_milters = unix:/var/run/milter-greylist/milter-greylist.sock</literal>”. The <citerefentry><refentrytitle>greylist.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page documents <filename>/etc/milter-greylist/greylist.conf</filename> and the numerous ways to configure milter-greylist. You will also have to edit <filename>/etc/default/milter-greylist</filename> to actually enable the service.
nb_no: Siden milter-grålisting bruker Sendmails milter-grensesnitt, er postfix-siden av konfigurasjonen begrenset til «<literal>smtpd_milters = unix:/var/run/milter-greylist/milter-greylist.sock</literal>». Manualsiden <citerefentry><refentrytitle>greylist.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> dokumenterer <filename>/etc/milter-greylist/greylist.conf</filename>, og de utallige måter å konfigurere milter-grålisting på. Du vil også måtte redigere <filename>/etc/default/milter-greylist</filename> for faktisk å aktivere tjenesten.
vi_vn: Bởi milter-greylist sử dụng giao diện milter của Sendmail, phần postfix của nó bị giới hạn xuống “<literal>smtpd_milters = unix:/var/run/milter-greylist/milter-greylist.sock</literal>”. Trang hướng dẫn sử dụng <citerefentry><refentrytitle>greylist.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> hướng dẫn về <filename>/etc/milter-greylist/greylist.conf</filename> và nhiều cách khác nhau để cấu hình milter-greylist. Bạn cũng sẽ phải chỉnh sửa <filename>/etc/default/milter-greylist</filename> để kích hoạt nó lên.

source: Customizing Filters Based On the Recipient
nb_no: Å tilpasse filtre basert på mottakeren
vi_vn: Tùy chỉnh các bộ lọc dựa trên người nhận

source: <xref linkend="sect.restrictions-for-receiving-and-sending" /> and <xref linkend="sect.setting-up-greylisting" /> reviewed many of the possible restrictions. They all have their use in limiting the amount of received spam, but they also all have their drawbacks. It is therefore more and more common to customize the set of filters depending on the recipient. At Falcot Corp, greylisting is interesting for most users, but it hinders the work of some users who need low latency in their emails (such as the technical support service). Similarly, the commercial service sometimes has problems receiving emails from some Asian providers who may be listed in blacklists; this service asked for a non-filtered address so as to be able to correspond.
nb_no: <xref linkend="sect.restrictions-for-receiving-and-sending" /> og <xref linkend="sect.setting-up-greylisting" /> gjennomgikk mange av de mulige restriksjonene. De har alle sin nytte ved å begrense mengden mottatt spam, men har alle også sine ulemper. Det er derfor mer og mer vanlig å tilpasse filtrene til mottakeren. På Falcot Corp er grålisting interessant for de fleste brukere, men det hindrer arbeidet til noen brukere som har behov for korte forsinkelser på sine e-poster (som for eksempel teknisk supporttjeneste). Tilsvarende, den kommersielle tjenesten har noen ganger problemer med å motta e-post fra noen asiatiske leverandører som kan være oppført i svartelister; trenger denne tjenesten en ikke-filtrert adresse for å kunne utveksle e-poster.
vi_vn: <xref linkend="sect.restrictions-for-receiving-and-sending" /> và <xref linkend="sect.setting-up-greylisting" /> lướt qua khá nhiều trong số tất cả những giới hạn có thể có. Chúng đều có ứng dụng trong việc giới hạn lượng thư rác nhận được, nhưng chúng cũng có những điểm yếu. Vì thế việc tùy chỉnh các bộ lọc dựa trên người nhận ngày càng trở nên phổ biến. Tại công ty Falcot, đánh dấu xám hoạt động hiệu quả cho đa số người sử dụng, nhưng nó làm chậm công việc của một số người sử dụng đòi hỏi không có sự chậm trễ trong những thư điện tử của họ (như là dịch vụ hỗ trợ kỹ thuật). Tương tự, dịch vụ thương mại thỉnh thoảng nhận các thư điện tử từ một số nhà cung cấp Châu Á vốn có thể được liệt kê vào các danh sách đen; dịch vụ này yêu cầu một địa chỉ chưa được lọc để có thể trả lời.

source: Postfix provides such a customization of filters with a “restriction class” concept. The classes are declared in the <literal>smtpd_restriction_classes</literal> parameter, and defined the same way as <literal>smtpd_recipient_restrictions</literal>. The <literal>check_recipient_access</literal> directive then defines a table mapping a given recipient to the appropriate set of restrictions.
nb_no: Postfix gir en slik filtertilpasning med «restriction class»-konseptet. Klassene er deklarert i <literal>smtpd_restriction_classes</literal>-parameteret, og definert på den samme måten som <literal>smtpd_recipient_restrictions</literal>. Direktivet <literal>check_recipient_access</literal> definerer deretter en tabell som legger en gitt mottaker til det riktige settet med restriksjoner.
vi_vn: Postfix cung cấp sự tùy chỉnh những bộ lọc với khái niệm “hạng bị giới hạn“. Những hạng được khai báo trong tham biến <literal>smtpd_restriction_classes</literal>, và được định nghĩa y hệt như <literal>smtpd_recipient_restrictions</literal>. Chỉ thị <literal>check_recipient_access</literal> sau đó định nghĩa một bảng ánh xạ một người nhận với một tập hợp những giới hạn.

source: Defining restriction classes in <filename>main.cf</filename>
nb_no: Definere begrensningsklasser i <filename>main.cf</filename>
vi_vn: Định nghĩa những hạng bị giới hạn trong tập tin <filename>main.cf</filename>

source: The <filename>/etc/postfix/recipient_access</filename> file
nb_no: Filen <filename>/etc/postfix/recipient_access</filename>
vi_vn: Tập tin <filename>/etc/postfix/recipient_access</filename>

source: # Unfiltered addresses postmaster@falcot.com permissive support@falcot.com permissive sales-asia@falcot.com permissive # Aggressive filtering for some privileged users joe@falcot.com aggressive # Special rule for the mailing-list manager sympa@falcot.com reject_unverified_sender # Greylisting by default falcot.com greylisting
vi_vn: # Những địa chỉ chưa được lọc postmaster@falcot.com permissive support@falcot.com permissive sales-asia@falcot.com permissive # Lọc chặt chẽ hơn cho một vài người sử dụng có quyền đặc biệt joe@falcot.com aggressive # Quy tắc đặc biệt cho người quản lý bó thư điện tử sympa@falcot.com reject_unverified_sender # Ngầm định sẽ đánh dấu xám falcot.com greylisting

source: Integrating an Antivirus
nb_no: Å integrere en antivirus
vi_vn: Tích hợp một trình diệt vi-rút

source: The many viruses circulating as attachments to emails make it important to set up an antivirus at the entry point of the company network, since despite an awareness campaign, some users will still open attachments from obviously shady messages.
nb_no: Med mange virus som sirkulerer som e-postvedlegg, blir det viktig å sette opp et antivirus på inngangspunktet til bedriftens nettverk, da, til tross for en holdningskampanje, vil noen brukere fortsatt åpne vedlegg i åpenbart frynsete meldinger.
vi_vn: Rất nhiều vi-rút di chuyển dưới dạng tài liệu đính kèm trong những thư điện tử khiến cho việc cài đặt một trình diệt vi-rút ở cổng vào của mạng công ty rất quan trọng, bởi dù có một chiến dịch tăng cường sự hiểu biết, một số người sử dụng sẽ vẫn mở các tài liệu đính kèm từ những thông điệp này dù thoạt nhìn rất đáng nghi.

source: The Falcot administrators selected <command>clamav</command> for their free antivirus. The main package is <emphasis role="pkg">clamav</emphasis>, but they also installed a few extra packages such as <emphasis role="pkg">arj</emphasis>, <emphasis role="pkg">unzoo</emphasis>, <emphasis role="pkg">unrar</emphasis> and <emphasis role="pkg">lha</emphasis>, since they are required for the antivirus to analyze attachments archived in one of these formats.
nb_no: Falcot administrators valgte <command>clamav</command> som sin frie antivirus. Hovedpakken er <emphasis role="pkg">clamav</emphasis>, men de installerte også noen få ekstra pakker, som <emphasis role="pkg">arj</emphasis>, <emphasis role="pkg">unzoo</emphasis>, <emphasis role="pkg">unrar</emphasis> og <emphasis role="pkg">lha</emphasis>, siden de er nødvendige for at antiviruset skal analysere vedlegg arkivert i ett av disse formatene.
vi_vn: Các nhà quản trị hệ thống Falcot đã lựa chọn <command>clamav</command> làm trình duyệt vi-rút miễn phí của họ. Gói phần mềm chủ lực là <emphasis role="pkg">clamav</emphasis>, nhưng họ cũng đã cài một vài gói phần mềm thêm như <emphasis role="pkg">arj</emphasis>, <emphasis role="pkg">unzoo</emphasis>, <emphasis role="pkg">unrar</emphasis> và <emphasis role="pkg">lha</emphasis>, bởi chúng được cần tới bởi trình duyệt vi-rút để rà soát các tài liệu đính kèm lưu dưới một trong các định dạng này.

source: The task of interfacing between antivirus and the email server goes to <command>clamav-milter</command>. A <emphasis>milter</emphasis> (short for <emphasis>mail filter</emphasis>) is a filtering program specially designed to interface with email servers. A milter uses a standard application programming interface (API) that provides much better performance than filters external to the email servers. Milters were initially introduced by <emphasis>Sendmail</emphasis>, but <emphasis>Postfix</emphasis> soon followed suit.
nb_no: Oppgaven med å koble sammen antivirus og e-postserveren legges til <command>clamav-milter</command>. Et <emphasis>milter</emphasis> (kort for <emphasis>postfilter (mail filter)</emphasis>) er et filterprogram spesielt utviklet for å kommunisere med e-posttjenere. Et milter bruker et standard programmeringsgrensesnitt (API) som gir mye bedre ytelse enn eksterne e-posttjenerfiltre. Milters ble først introdusert av <emphasis>Sendmail</emphasis>, men <emphasis>Postfix</emphasis> kom snart etter.
vi_vn: Công việc kết nối trình diệt vi-rút và máy phục vụ thư điện tử thuộc về <command>clamav-milter</command>. Một <emphasis>milter</emphasis> (viết tắt của <emphasis>mail filter(bộ lọc thư)</emphasis>) là một chương trình lọc được thiết kế riêng để giao tiếp với các máy phục vụ thư điện tử. Một milter(bộ lọc thư) sử dụng một chuẩn kết nối lập trình ứng dụng(API) vốn cung cấp hiệu suất cao hơn các bộ lọc nằm bên ngoài các máy phục vụ thư điện tử. Các bộ lọc thư này đầu tiên được giới thiệu bởi <emphasis>Sendmail</emphasis>, nhưng <emphasis>Postfix</emphasis> sớm đuổi theo xu hướng.

source: <emphasis>QUICK LOOK</emphasis> A milter for Spamassassin
nb_no: <emphasis>HURTIGVISNING</emphasis> Et milter for Spamassassin
vi_vn: <emphasis>SƠ LƯỢC</emphasis> Một bộ lọc thư(milter) cho Spamassasin

source: The <emphasis role="pkg">spamass-milter</emphasis> package provides a milter based on <emphasis>SpamAssassin</emphasis>, the famous unsolicited email detector. It can be used to flag messages as probable spams (by adding an extra header) and/or to reject the messages altogether if their “spamminess” score goes beyond a given threshold.
nb_no: Pakken <emphasis role="pkg">spamass-milter</emphasis> gir et milter basert på <emphasis>SpamAssassin</emphasis>, den berømte detektoren for uønsket e-post. Den kan brukes til å flagge meldinger som er mulige spam (ved å legge til en ekstra topptekst) og/eller for helt å avvise meldinger hvis spam-poengene («spaminess» score) går utover en gitt terskel.
vi_vn: Gói phần mềm <emphasis role="pkg">spamass-milter</emphasis> cung cấp một bộ lọc thư dựa trên <emphasis>SpamAssassin</emphasis>, một chương trình nổi tiếng phát hiện thư điện tử được gửi không ai yêu cầu. Nó có thể được sử dụng để đánh dấu các thông điệp có thể là thư rác (bằng cách thêm một tiêu đề thêm) và/hoặc từ chối hết những thư điện tử nếu điểm “thư rác“ của chúng vượt qua một mức điểm cho trước.

source: Once the <emphasis role="pkg">clamav-milter</emphasis> package is installed, the milter should be reconfigured to run on a TCP port rather than on the default named socket. This can be achieved with <command>dpkg-reconfigure clamav-milter</command>. When prompted for the “Communication interface with Sendmail”, answer “<literal>inet:10002@127.0.0.1</literal>”.
nb_no: Så snart pakken <emphasis role="pkg">clamav-milter</emphasis> er installert, skal milter konfigureres til å kjøre på en TCP-port i stedet for på standarden som heter socket. Dette kan oppnås med <command>dpkg-reconfigure clamav-milter</command>. Når du blir bedt om «Communication interface with Sendmail», svar «<literal>inet:10002@127.0.0.1</literal>».
vi_vn: Khi gói phần mềm <emphasis role="pkg">clamav-milter</emphasis> được cài đặt, bộ lọc thư đó nên được cấu hình lại để chạy trên cổng TCP hơn là trên một socket chuẩn. Điều này có thể đạt được bằng <command>dpkg-reconfigure clamav-milter</command>. Khi được hỏi về “Cách kết nối giao tiếp với Sendmail (Communication interface with Sendmail)”, trả lời “<literal>inet:10002@127.0.0.1</literal>”.

source: <emphasis>NOTE</emphasis> Real TCP port vs named socket
nb_no: <emphasis>NOTE</emphasis> Ekte TCP port vs heter socket
vi_vn: <emphasis>GHI CHÚ</emphasis> Cổng TCP thật và socket có tên
