Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: NFS is a very useful tool but, historically, it has suffered from many limitations, most of which have been addressed with version 4 of the protocol. The downside is that the latest version of NFS is harder to configure when you want to make use of basic security features such as authentication and encryption since it relies on Kerberos for those parts. And without those, the NFS protocol must be restricted to a trusted local network since data goes over the network unencrypted (a <emphasis>sniffer</emphasis> can intercept it) and access rights are granted based on the client's IP address (which can be spoofed).
nb_no: NFS er et svært nyttig verktøy, men har tidligere lidd av mange begrensninger, som det er tatt hensyn til i versjon 4 av protokollen. Ulempen er at den nyeste versjonen av NFS er vanskeligere å sette opp når du ønsker å bruke grunnleggende sikkerhetsfunksjoner som autentisering og kryptering, da den trenger Kerberos for dette. Og uten disse må NFS-protokollen begrenses til et klarert lokalt nettverk når data ukryptert går over nettverket (en <emphasis>sniffer</emphasis> kan fange den opp), og adgangsrettighetene er gitt med utgangspunkt i klientens IP-adresse (som kan etterlignes).
vi_vn: NFS là một công cụ hữu dụng nhưng, theo lịch sử, nó đã hứng chịu nhiều giới hạn, đa số được giải quyết với phiên bản số 4 của giao thức này. Ngược lại, phiên bản mới nhất của NFS khó cấu hình hơn khi bạn muốn sử dụng các tính năng an ninh đơn giản ví dụ như xác thực và mã hóa bởi nó dựa trên Kerberos cho những thành phần đó. Và nếu không có những thứ trên, giao thức NFS phải được giới hạn lại trong một mạng lưới nội bộ đáng tin cậy bởi dữ liệu di chuyển trên mạng nội bộ mà không được mã hóa (một <emphasis>kẻ nghe lén(sniffer)</emphasis> có thể can thiệp nó) và quyền truy cập được cung cấp dựa trên địa chỉ IP của khách (vốn có thể được làm giả).

source: <emphasis>DOCUMENTATION</emphasis> NFS HOWTO
nb_no: <emphasis>DOKUMENTASJON</emphasis> NFS HOWTO
vi_vn: <emphasis>TÀI LIỆU HƯỚNG DẪN</emphasis> HƯỚNG DẪN NFS

source: Good documentation to deploy NFSv4 is rather scarce. Here are some pointers with content of varying quality but that should at least give some hints on what should be done. <ulink type="block" url="https://help.ubuntu.com/community/NFSv4Howto" /> <ulink type="block" url="http://wiki.linux-nfs.org/wiki/index.php/Nfsv4_configuration" />
nb_no: Det er ganske knapt med god dokumentasjon om å distribuere NFSv4. Her er noen tips med innhold av varierende kvalitet, men det bør i det minste gi noen hint om hva som bør gjøres. <ulink type="block" url="https://help.ubuntu.com/community/NFSv4Howto" /> <ulink type="block" url="http://wiki.linux-nfs.org/wiki/index.php/Nfsv4_configuration" />
vi_vn: Tài liệu hướng dẫn có chất lượng để chạy NFSv4 thì khá khan hiếm. Đây là một vài nguồn với những nội dung có mức độ chi tiết khác nhau nhưng đó ít nhất sẽ cho bạn một số thông tin về những gì cần phải làm. <ulink type="block" url="https://help.ubuntu.com/community/NFSv4Howto" /> <ulink type="block" url="http://wiki.linux-nfs.org/wiki/index.php/Nfsv4_configuration" />

source: Securing NFS
nb_no: Å sikre NFS
vi_vn: Đảm bảo an ninh cho NFS

source: <primary>NFS</primary><secondary>security</secondary>
nb_no: <primary>NFS</primary><secondary>sikkerhet</secondary>
vi_vn: <primary>NFS</primary><secondary>an ninh</secondary>

source: If you don't use the Kerberos-based security features, it is vital to ensure that only the machines allowed to use NFS can connect to the various required RPC servers, because the basic protocol trusts the data received from the network. The firewall must also block <emphasis>IP spoofing</emphasis> so as to prevent an outside machine from acting as an inside one, and access to the appropriate ports must be restricted to the machines meant to access the NFS shares.
nb_no: Hvis du ikke bruker Kerberos-baserte sikkerhetsfunksjoner, er det viktig å sikre at bare de maskinene som har lov til å bruke NFS kan koble til de ulike nødvendige RPC-tjenerne, fordi den grunnleggende protokollen har tillit til data som mottas fra nettverket. Brannmuren må også blokkere <emphasis>IP spoofing</emphasis> for å hindre at en utenforstående maskin opptrer som en på innsiden, og at tilgangen til de riktige portene blir begrenset til maskinene som er ment å skulle ha tilgang til NFS-delinger.
vi_vn: Nếu bạn không sử dụng các tính năng an ninh dựa trên Kerberos, sẽ rất quan trọng để đảm bảo rằng chỉ những máy được cho phép sử dụng NFS mới có thể kết nối tới các máy phục vụ RPC cần thiết, bởi giao thức NFS về cơ bản luôn tin tưởng dữ liệu nhận được từ mạng. Tường lửa cũng chặn <emphasis>việc làm giả IP</emphasis> để phòng ngừa việc một máy bên ngoài hành động như một máy bên trong, và truy cập tới các cổng tương ứng phải được giới hạn lại những máy chỉ dùng để truy cập các chia sẻ NFS.

source: <emphasis>BACK TO BASICS</emphasis> RPC
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> RPC
vi_vn: <emphasis>TRỞ VỀ CƠ BẢN</emphasis> RPC

source: RPC (<emphasis>Remote Procedure Call</emphasis>) is a Unix standard for remote services. NFS is one such service.
nb_no: RPC (<emphasis>Remote Procedure Call</emphasis>) er en Unix-standard for eksterne tjenester. NFS er en slik tjeneste.
vi_vn: RPC (<emphasis>Remote Procedure Call(Thực thi Hàm Từ xa)</emphasis>) là một chuẩn Unix cho các dịch vụ chạy từ xa. NFS là một dịch vụ như vậy.

source: <primary><emphasis>Remote Procedure Call</emphasis></primary>
vi_vn: <primary><emphasis>Thực thi Hàm Từ xa (Remote Procedure Call)</emphasis></primary>

source: RPC services register to a directory known as the <emphasis>portmapper</emphasis>. A client wishing to perform an NFS query first addresses the <emphasis>portmapper</emphasis> (on port 111, either TCP or UDP), and asks for the NFS server; the reply usually mentions port 2049 (the default for NFS). Not all RPC services necessarily use a fixed port.
nb_no: RPC-tjenester registrerer til en katalog kjent som <emphasis>portmapper</emphasis>. En klient som ønsker NFS-forespørsel, adresserer først til <emphasis>portmapper</emphasis> (på port 111, enten TCP eller UDP), og ber om NFS-tjeneren; svaret nevner vanligvis port 2049 (standard for NFS). Ikke alle RPC-tjenester bruker nødvendigvis en fast port.
vi_vn: Các dịch vụ RPC đăng ký với một danh bạ được biết đến như là <emphasis>danh bạ cổng (portmapper)</emphasis>. Một máy khách có ý muốn thực hiện một yêu cầu liên quan tới NFS trước tiên tìm đến <emphasis>danh bạ cổng (portmapper)</emphasis> (ở cổng 111, hoặc TCP hoặc UDP), và hỏi tìm máy phục vụ NFS; câu trả lời thường đề cập cổng 2049 (ngầm định cho NFS). Không phải tất cả các dịch vụ RPC cần sử dụng một cổng cố định.

source: Older versions of the protocol required other RPC services which used dynamically assigned ports. Fortunately, with NFS version 4, only port 2049 (for NFS) and 111 (for the portmapper) are needed and they are thus easy to firewall.
nb_no: Eldre versjoner av protokollen krevde andre RPC-tjenester som brukte dynamisk tildelte porter. Heldigvis, med NFS versjon 4, er bare port 2049 (for NFS) og 111 (for portmapper) nødvendig, og de er dermed lette å sikre med brannmur.
vi_vn: Các phiên phản cũ hơn của giao thức buộc sự hiện diện của các dịch vụ RPC khác vốn dùng các cổng được gán linh động. May mắn thay, với phiên bản NFS 4, chỉ cổng 2049 (cho NFS) và 111 (cho danh bạ cổng) là cần thiết và tường lửa dễ dàng được cài đặt hơn.

source: <primary><command>portmapper</command></primary>
vi_vn: <primary><command>danh bạ cổng (portmapper)</command></primary>

source: NFS Server
nb_no: NFS-tjener
vi_vn: Máy phục vụ NFS

source: The NFS server is part of the Linux kernel; in kernels provided by Debian it is built as a kernel module. If the NFS server is to be run automatically on boot, the <emphasis role="pkg">nfs-kernel-server</emphasis> package should be installed; it contains the relevant start-up scripts.
nb_no: NFS er en del av Linux-kjernen; i kjerner som leveres av Debian er den med som en kjernemodul. Hvis NFS-tjeneren skal kjøres automatisk ved oppstart, skal <emphasis role="pkg">nfs-kernel-server</emphasis>-pakken installeres; Den inneholder de relevante oppstartsskriptene.
vi_vn: Máy phục vụ NFS là một phần của nhân(kernel) Linux; trong những nhân(kernel) được cung cấp bởi Debian nó được xây dựng như một mô-đun của nhân. Nếu máy phục vụ NFS được chạy tự động khi khởi động máy, gói phần mềm <emphasis role="pkg">nfs-kernel-server</emphasis> nên được cài đặt; nó chứa các đoạn mã kịch bản khởi động có liên quan.

source: The NFS server configuration file, <filename>/etc/exports</filename>, lists the directories that are made available over the network (<emphasis>exported</emphasis>). For each NFS share, only the given list of machines is granted access. More fine-grained access control can be obtained with a few options. The syntax for this file is quite simple:
nb_no: NFS-tjenerens konfigurasjonsfil, <filename>/etc/exports</filename>, viser kataloger som er gjort tilgjengelig via nettverket (<emphasis>eksportert</emphasis>). For hver NFS-deling, er det bare den gitte listen over maskiner som får tilgang. Mer finkornet adgangskontroll kan oppnås med et par alternativer. Syntaksen for denne filen er ganske enkel:
vi_vn: Tập tin cấu hình máy phục vụ NFS, <filename>/etc/exports</filename>, liệt kê những thư mục được tạo sẵn trên mạng (<emphasis>được xuất khẩu (exported)</emphasis>). Với mỗi chia sẻ NFS, chỉ có một danh sách các máy cho trước là được cung cấp truy cập. Kiểm soát truy cập chi tiết hơn có thể được đạt được với một vài lựa chọn. Cú pháp của tập tin này thì khá đơn giản:

source: /directory/to/share machine1(option1,option2,...) machine2(...) ...
vi_vn: /đường_dẫn/tới/thư_mục_được_chia_sẻ máy-số_1(lựa_chọn_1,lựa_chọn_2,...) máy_số_2(...) ...

source: Note that with NFSv4, all exported directories must be part of a single hierarchy and that the root directory of that hierarchy must be exported and identified with the option <literal>fsid=0</literal> or <literal>fsid=root</literal>.
nb_no: Merk at med NFSv4 må alle eksporterte kataloger være del av et enkelt hierarki, og at rotkatalogen i dette hierarkiet må eksporteres og identifiseres med alternativet <literal>fsid=0</literal>, eller <literal>fsid=root</literal>.
vi_vn: Ghi chú rằng với NFSv4, tất cả các thư mục được xuất khẩu phải là một phần của một cây duy nhất và thư mục gốc của cây đó phải được xuất ra và nhận dạng với lựa chọn <literal>fsid=0</literal> hoặc <literal>fsid=root</literal>.

source: Each machine can be identified either by its DNS name or its IP address. Whole sets of machines can also be specified using either a syntax such as <literal>*.falcot.com</literal> or an IP address range such as <literal>192.168.0.0/255.255.255.0</literal> or <literal>192.168.0.0/24</literal>.
nb_no: Hver maskin kan identifiseres enten ved sitt DNS-navn eller sin IP-adresse. Hele sett med maskiner kan også angis ved hjelp av enten en syntaks som <literal>*.falcot.com</literal>, eller et IP-adresseområde som <literal>192.168.0.0/255.255.255.0</literal>, eller <literal>192.168.0.0/24</literal>.
vi_vn: Mỗi máy có thể được nhận dạng bởi tên miền DNS của nó hoặc địa chỉ IP của nó. Các tập hợp đầy đủ các máy tính cũng có thể được chỉ định bằng cú pháp như <literal>*.falcot.com</literal> hoặc một vùng các địa chỉ IP như <literal>192.168.0.0/255.255.255.0</literal> hoặc <literal>192.168.0.0/24</literal>.

source: Directories are made available as read-only by default (or with the <literal>ro</literal> option). The <literal>rw</literal> option allows read-write access. NFS clients typically connect from a port restricted to root (in other words, below 1024); this restriction can be lifted by the <literal>insecure</literal> option (the <literal>secure</literal> option is implicit, but it can be made explicit if needed for clarity).
nb_no: Kataloger er som standard gjort tilgjengelig som skrivebeskyttet (eller med <literal>ro</literal>-valget). Valget <literal>rw</literal> tillater lese- og skriveadgang. NFS-klienten kobler vanligvis til fra en port forbeholdt rot (med andre ord, under 1024). Denne begrensningen kan oppheves av <literal>insecure</literal>-valget, (<literal>secure</literal>-alternativet er implisitt, men kan gjøres eksplisitt hvis det er nødvendig for klarhetens skyld).
vi_vn: Các thư mục được tạo sẵn chỉ để đọc theo ngầm định (hoặc với lựa chọn <literal>ro</literal>). Lựa chọn <literal>rw</literal> cho phép truy cập đọc-viết. Những chương trình khách NFS thường kết nối từ một cổng giới hạn dành cho quản trị viên (root) (nói cách khác, dưới 1024); giới hạn này có thể được xóa bỏ bởi lựa chọn <literal>insecure</literal> (lựa chọn <literal>insecure</literal> luôn được ám chỉ, nhưng có thể được công khai nếu cần phải làm rõ)

source: <primary>NFS</primary><secondary>options</secondary>
nb_no: <primary>NFS</primary><secondary>opsjoner</secondary>
vi_vn: <primary>NFS</primary><secondary>Các lựa chọn</secondary>

source: By default, the server only answers an NFS query when the current disk operation is complete (<literal>sync</literal> option); this can be disabled with the <literal>async</literal> option. Asynchronous writes increase performance a bit, but they decrease reliability since there is a data loss risk in case of the server crashing between the acknowledgment of the write and the actual write on disk. Since the default value changed recently (as compared to the historical value of NFS), an explicit setting is recommended.
nb_no: Som standard svarer tjeneren bare på en NFS-spørring når den igangværende diskoperasjonen er fullført (<literal>sync</literal>-valget); dette kan oppheves med <literal>async</literal>-valget. Asynkron innskriving øker ytelsen litt, men de reduserer påliteligheten siden det er en risiko for tap av data i tilfelle tjeneren krasjer mellom godkjenningen av innskrivingen, og den faktiske innskrivingen på disken. Siden standardverdien nettopp ble endret (i forhold til den historiske verdien av NFS), er en eksplisitt innstilling å anbefale.
vi_vn: Theo ngầm định, máy phục vụ chỉ trả lời một yêu cầu NFS khi một tác vụ hiện thời trên đĩa là hoàn tất (lựa chọn <literal>sync</literal>); điều này có thể được tắt bằng lựa chọn <literal>async</literal>. Các lần ghi không đồng bộ giúp tăng hiệu suất một chút, nhưng chúng giảm độ tin cậy bởi có nguy cơ mất dữ liệu trong trường hợp máy phục vụ gặp sự cố giữa lúc xác nhận việc ghi dữ liệu và hành động ghi dữ liệu thật sự lên đĩa cứng. Bởi giá trị ngầm định thay đổi trong thời gian gần đây (so với giá trị trước đây của NFS), một cài đặt công khai rõ ràng luôn được khuyến khích.

source: In order to not give root access to the filesystem to any NFS client, all queries appearing to come from a root user are considered by the server as coming from the <literal>nobody</literal> user. This behavior corresponds to the <literal>root_squash</literal> option, and is enabled by default. The <literal>no_root_squash</literal> option, which disables this behavior, is risky and should only be used in controlled environments. The <literal>anonuid=<replaceable>uid</replaceable></literal> and <literal>anongid=<replaceable>gid</replaceable></literal> options allow specifying another fake user to be used instead of UID/GID 65534 (which corresponds to user <literal>nobody</literal> and group <literal>nogroup</literal>).
nb_no: For å ikke gi rot-tilgang til filsystemet til noen NFS-klient er alle spørsmål som tilsynelatende kommer fra en rotbruker vurdert av tjeneren som å komme fra <literal>nobody</literal>-brukeren. Dette samsvarer med <literal>root_squash</literal>-alternativet, og er aktivert som standard. Alternativet <literal>no_root_squash</literal>, som deaktiverer denne atferden, er risikabel, og bør bare brukes i kontrollerte omgivelser. <literal>anonuid=<replaceable>uid</replaceable></literal> og <literal>anongid=<replaceable>gid</replaceable></literal>-alternativene tillater å spesifisere en annen falsk bruker til å bli brukt i stedet for UID/GID 65534 (som tilsvarer bruker <literal>nobody</literal> og gruppe <literal>nogroup</literal>).
vi_vn: Để tránh cho phép bất cứ chương trình khách NFS nào truy cập dưới quyền quản trị viên vào hệ thống tập tin, tất cả các truy cập trông như đến từ một tài khoản quyền quản trị viên được xem bởi máy phục vụ như là đến từ một tài khoản <literal>nobody</literal>. Hành vi này tương ứng với lựa chọn <literal>root_squash</literal>, và được kích hoạt theo ngầm định. Lựa chọn <literal>no_root_squash</literal>, vốn tắt hành vi này, là mạo hiểm và chỉ nên được sử dụng trong môi trường được kiểm soát. Lựa chọn <literal>anonuid=<replaceable>uid</replaceable></literal> và <literal>anongid=<replaceable>gid</replaceable></literal> cho phép việc chỉ định một tài khoản người dùng giả khác để được sử dụng thay cho UID/GID 65534 (vốn tương ứng với tài khoản <literal>nobody</literal> và nhóm <literal>nogroup</literal>).

source: With NFSv4, you can add a <literal>sec</literal> option to indicate the security level that you want: <literal>sec=sys</literal> is the default with no special security features, <literal>sec=krb5</literal> enables authentication only, <literal>sec=krb5i</literal> adds integrity protection, and <literal>sec=krb5p</literal> is the most complete level which includes privacy protection (with data encryption). For this to work you need a working Kerberos setup (that service is not covered by this book).
nb_no: Med NFSv4 kan du legge til et <literal>sec</literal>-valg for å indikere det sikkerhetsnivået du ønsker: <literal>sec=sys</literal> er som standard uten noen sikkerhetsegenskaper, <literal>sec=krb5</literal> aktiverer bare autentisering, <literal>sec=krb5i</literal> legger til integritetsbeskyttelse, og <literal>sec=krb5p</literal> er det mest komplette nivået, og inkluderer personvern (med datakryptering). For at dette skal virke, trenger du et Kerberos oppsett som virker (den tjenesten er ikke dekket i denne boken).
vi_vn: Với NFSv4, bạn có thể thêm lựa chọn <literal>sec</literal> để chỉ định mức an ninh mà bạn muốn: <literal>sec=sys</literal> là mức ngầm định mà không có tính năng an ninh đặc biệt nào cả, <literal>sec=krb5</literal> chỉ kích hoạt xác thực, <literal>sec=krb5i</literal> thêm sự bảo vệ tính chặt chẽ, và <literal>sec=krb5p</literal> là mức hoàn thiện nhất vốn kèm cả sự bảo vệ tính riêng tư (với mã hóa dữ liệu). Để điều này hoạt động tốt bạn cần có một bản cài đặt Kerberos chạy tốt(dịch vụ đó không được giải thích bởi cuốn sách này).

source: Other options are available; they are documented in the <citerefentry><refentrytitle>exports</refentrytitle> <manvolnum>5</manvolnum></citerefentry> manual page.
nb_no: Det er også andre valgmuligheter. De er dokumentert i manualsiden <citerefentry><refentrytitle>exports</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.
vi_vn: Các lựa chọn khác cũng có sẵn; chúng được ghi lại trong trang <citerefentry><refentrytitle>exports</refentrytitle> <manvolnum>5</manvolnum></citerefentry> của tài liệu hướng dẫn.

source: <emphasis>CAUTION</emphasis> First installation
nb_no: <emphasis>VÆR VARSOM</emphasis> Første innstallasjon
vi_vn: <emphasis>CẢNH BÁO</emphasis> Lần cài đặt đầu tiên

source: The <filename>/etc/init.d/nfs-kernel-server</filename> boot script only starts the server if the <filename>/etc/exports</filename> lists one or more valid NFS shares. On initial configuration, once this file has been edited to contain valid entries, the NFS server must therefore be started with the following command:
nb_no: Oppstartsskriptet <filename>/etc/init.d/nfs-kernel-server</filename> starter bare tjeneren hvis <filename>/etc/exports</filename> lister en eller flere gyldige NFS-deler. Ved første gangs konfigurering, når denne filen er redigert for å inneholde gyldige oppføringer, må NFS-tjeneren derfor startes med følgende kommando:
vi_vn: Kịch bản khởi động <filename>/etc/init.d/nfs-kernel-server</filename> chỉ khởi động máy phục vụ nếu <filename>/etc/exports</filename> liệt kê một hoặc nhiều chia sẻ NFS hợp lệ. Với cấu hình ban đầu, một khi tập tin này được chỉnh sửa để chứa các chỉ mục hợp lệ, khi đó máy phục vụ NFS phải được khởi động với lệnh sau:

source: NFS Client
nb_no: NFS-klient
vi_vn: Chương trình khách NFS

source: <primary>NFS</primary><secondary>client</secondary>
nb_no: <primary>NFS</primary><secondary>klient</secondary>
vi_vn: <primary>NFS</primary><secondary>chương trình khách</secondary>

source: As with other filesystems, integrating an NFS share into the system hierarchy requires mounting. Since this filesystem has its peculiarities, a few adjustments were required in the syntaxes of the <command>mount</command> command and the <filename>/etc/fstab</filename> file.
nb_no: Som med andre filsystemer, å integrere en NFS-del inn i systemhierarkiet krever montering. Siden dette filsystemet har sine særegenheter, kreves noen justeringer i syntaksen til <command>mount</command>-kommandoen, og i <filename>/etc/fstab</filename>-filen.
vi_vn: Giống như các hệ thống tập tin khác, việc tích hợp một chuẩn NFS vào cây hệ thống đòi hỏi phải có kết nối. Bởi hệ thống tập tin này khá khác biệt, một vài tùy chỉnh là cần thiết đối với cú pháp của lệnh <command>mount</command> và tập tin <filename>/etc/fstab</filename>.

source: Manually mounting with the <command>mount</command> command
nb_no: Å montere manuelt med <command>mount</command>-kommandoen
vi_vn: Kết nối thủ công với lệnh <command>mount</command>

source: NFS entry in the <filename>/etc/fstab</filename> file
nb_no: NFS-inngang i <filename>/etc/fstab</filename>-filen
vi_vn: Mục NFS trong tập tin <filename>/etc/fstab</filename>
