Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: The reason why we use a real TCP port rather than the named socket is that the postfix daemons often run chrooted and do not have access to the directory hosting the named socket. You could also decide to keep using a named socket and pick a location within the chroot (<filename>/var/spool/postfix/</filename>).
nb_no: Grunnen til at vi bruker en ekte TCP-port i stedet for den navngitte socketen, er at postfix-nisser ofte kjører chroot, og ikke har tilgang til katalogen som er vertskap for den navngitte socketen. Du kan også velge å fortsette å bruke en navngitt socket, og velge et sted i chroot (<filename>/var/spool/postfix/</filename>).
vi_vn: Lý do chúng tôi sử dụng cổng TCP thật thì vì một socket có tên là vì các tiến trình nền postfix thường chạy với thư mục gốc được đổi và không có truy cập tới thư mục chứa socket có tên. Bạn có thể quyết sử dụng một socket có tên và chọn một vị trí trong môi trường đã thay đổi thư mục gốc (<filename>/var/spool/postfix/</filename>).

source: The standard ClamAV configuration fits most situations, but some important parameters can still be customized with <command>dpkg-reconfigure clamav-base</command>.
nb_no: Standard ClamAV-konfigurasjon passer til de fleste situasjoner, men noen viktige parametere kan fortsatt tilpasses med <command>dpkg-reconfigure clamav-base</command>.
vi_vn: Cấu hình ClamAV chuẩn phù hợp cho đa số các trường hợp, nhưng một số tham số quan trọng có thể được tùy chỉnh với lệnh <command>dpkg-reconfigure clamav-base</command>.

source: The last step involves telling Postfix to use the recently-configured filter. This is a simple matter of adding the following directive to <filename>/etc/postfix/main.cf</filename>:
nb_no: Det siste trinnet er å be Postfix å bruke det nettopp konfigurerte filteret. Det er en enkel sak å legge følgende direktiv til <filename>/etc/postfix/main.cf</filename>:
vi_vn: Bước cuối cùng liên quan tới việc bảo Postfix sử dụng bộ lọc được cấu hình gần đây nhất. Đây đơn giản được thực hiện bằng cách thêm chỉ thị sau vào tập tin <filename>/etc/postfix/main.cf</filename>:

source: If the antivirus causes problems, this line can be commented out, and <command>service postfix reload</command> should be run so that this change is taken into account.
nb_no: Hvis antivirus skaper problemer, kan denne linjen kommenteres ut, og <command>service postfix reload</command> skal kjøres slik at denne endringen er tatt hensyn til.
vi_vn: Nếu chương trình diệt vi-rút gây ra vấn đề, dòng sau có thể được chuyển thành ghi chú, và lệnh <command>service postfix reload</command> nên được chạy để thay đổi này được áp dụng.

source: <emphasis>IN PRACTICE</emphasis> Testing the antivirus
nb_no: <emphasis>I PRAKSIS</emphasis> Testing av antivirus
vi_vn: <emphasis>TRÊN THỰC TẾ</emphasis> Kiểm tra chương trình diệt vi-rút

source: Once the antivirus is set up, its correct behavior should be tested. The simplest way to do that is to send a test email with an attachment containing the <filename>eicar.com</filename> (or <filename>eicar.com.zip</filename>) file, which can be downloaded online: <ulink type="block" url="http://www.eicar.org/86-0-Intended-use.html" />
nb_no: Når antivirus er satt opp, skal det testes om oppførselen er korrekt. Den enkleste måten å gjøre det på, er å sende en test-e-post med et vedlegg som inneholder <filename>eicar.com</filename> (eller <filename>eicar.com.zip</filename>)-filen, som kan lastes ned fra nettet: <ulink type="block" url="http://www.eicar.org/86-0-Intended-use.html" />
vi_vn: Một khi trình diệt vi-rút được cài đặt, hành vi đúng của nó nên được thử nghiệm. Cách đơn giản nhất để làm điều đó là gửi một thư điện tử kiểm tra với một tài liệu đính kèm chứa tập tin <filename>eicar.com</filename> (hay <filename>eicar.com.zip</filename>) vốn có thể được tải về từ mạng: <ulink type="block" url="http://www.eicar.org/86-0-Intended-use.html" />

source: This file is not a true virus, but a test file that all antivirus software on the market diagnose as a virus to allow checking installations.
nb_no: Denne filen er ikke en ekte virus, men en test-fil som all antivirusprogramvare på markedet diagnostiserer som et virus, for å tillate sjekking av installasjoner.
vi_vn: Tập tin này không phải là một vi-rút thật sự, nhưng là một tập tin thử nghiệm mà tất cả chương trình diệt vi-rút trên thị trường chẩn đoán là một vi-rút để cho phép kiểm tra các bản cài đặt chương trình diệt vi-rút.

source: All messages handled by Postfix now go through the antivirus filter.
nb_no: Alle meldinger som Postfix håndterer, går nå igjennom antivirusfilteret.
vi_vn: Tất cả các thông điệp được xử lý bởi Postfix sẽ đi qua bộ lọc diệt vi-rút.

source: Authenticated SMTP
nb_no: Godkjent SMTP
vi_vn: SMTP có chứng thực

source: Being able to send emails requires an SMTP server to be reachable; it also requires said SMTP server to send emails through it. For roaming users, this may need regularly changing the configuration of the SMTP client, since Falcot's SMTP server rejects messages coming from IP addresses apparently not belonging to the company. Two solutions exist: either the roaming user installs an SMTP server on their computer, or they still use the company server with some means of authenticating as an employee. The former solution is not recommended since the computer won't be permanently connected, and it won't be able to retry sending messages in case of problems; we will focus on the latter solution.
nb_no: Å kunne sende e-poster krever tilgang på en SMTP-tjener; det krever også nevnte SMTP-tjener for å sende e-post igjennom den. For flyttbare enheter kan det trenges jevnlig endring av konfigurasjonen til SMTP-klienten, ettersom Falcots SMTP-tjener avviser meldinger som kommer fra IP-adresser som tilsynelatende ikke tilhører selskapet. To løsninger finnes: Enten installerer brukeren en SMTP-tjener på datamaskinen sin, eller de fortsetter å bruke selskapets tjener med noen metoder for å autentisere seg som en ansatt. Den første løsningen er ikke anbefalt siden maskinen ikke vil være permanent tilkoblet, og ikke være i stand til igjen å prøve å sende meldinger i tilfelle problemer. Vi vil fokusere på sistnevnte løsning.
vi_vn: Việc có thể gửi thư điện tử buộc phải kết nối được tới máy phục vụ SMTP; nó cũng cần một máy phục vụ SMTP như vậy để gửi thư điện tử xuyên qua nó. Đối với những người sử dụng hay chuyển vùng, điều này cần phải thay đổi thường xuyên cấu hình của chương trình khách SMTP(SMTP client), bởi máy phục vụ SMTP của Falcot từ chối những thông điệp đến từ những địa chỉ IP rõ ràng không thuộc về công ty. Có hai giải pháp: hoặc người sử dụng chuyển vùng cài đặt một máy phục vụ SMTP trên máy của họ, hoặc họ vẫn sử dụng máy phục vụ của công ty với một cách nào đó để đăng nhập như một nhân viên công ty. Giải pháp đầu điên không được khuyến cáo bởi máy tính của họ không được kết nối liên tục, và nó sẽ không thể thử lại việc gửi các thông điệp trong trường hợp sự cố; chúng ta sẽ tập trung vào giải pháp tiếp theo.

source: SMTP authentication in Postfix relies on SASL (<emphasis>Simple Authentication and Security Layer</emphasis>). It requires installing the <emphasis role="pkg">libsasl2-modules</emphasis> and <emphasis role="pkg">sasl2-bin</emphasis> packages, then registering a password in the SASL database for each user that needs authenticating on the SMTP server. This is done with the <command>saslpasswd2</command> command, which takes several parameters. The <literal>-u</literal> option defines the authentication domain, which must match the <literal>smtpd_sasl_local_domain</literal> parameter in the Postfix configuration. The <literal>-c</literal> option allows creating a user, and <literal>-f</literal> allows specifying the file to use if the SASL database needs to be stored at a different location than the default (<filename>/etc/sasldb2</filename>).
nb_no: SMTP-autentisering i Postfix hviler på SASL (<emphasis>Simple Authentication and Security Layer</emphasis>). Det krever installasjon av <emphasis role="pkg">libsasl2-modules</emphasis> og <emphasis role="pkg">sasl2-bin</emphasis>-pakker, deretter å registrere et passord i SASL-databasen for hver bruker som trenger autentisering på SMTP-tjeneren. Dette gjøres med <command>saslpasswd2</command>-kommandoen, som krever flere parametre. Valget <literal>-u</literal> definerer godkjenningsdomenet, som må samsvare med <literal>smtpd_sasl_local_domain</literal>-parameteret i Postfix-oppsettet. Valget <literal>-c</literal> tillater å lage en bruker, og <literal>-f</literal> kan spesifisere filen som skal brukes hvis SASL-databasen må lagres på et annet sted enn opprinnelig (<filename>/etc/sasldb2</filename>).
vi_vn: Chứng thực SMTP trong Postfix dựa trên SASL ("<emphasis>Lớp Chứng thực và An ninh - Simple Authentication and Security Layer</emphasis>). Nó đòi hỏi việc cài đặt các gói <emphasis role="pkg">libsasl2-modules</emphasis> và <emphasis role="pkg">sasl2-bin</emphasis>, sau đó phải đăng ký một mật mã trên cơ sở dữ liệu SASL cho mỗi người sử dụng cần đăng nhập trên máy phục vụ SMTP. Điều này được thực hiện bằng lệnh <command>saslpasswd2</command>, vốn cần một vài tham số. Lựa chọn <literal>-u</literal> định nghĩa một miền đăng nhập (authentication domain), vốn phải hợp với tham biến <literal>smtpd_sasl_local_domain</literal> của cấu hình Postfix. Lựa chọn <literal>-c</literal> cho phép tạo một người dùng, và <literal>-f</literal> cho phép chỉ định một tập tin để sử dụng nếu cơ sở dữ liệu SASL cần được lưu ở một địa chỉ không phải là địa chỉ ngầm định (<filename>/etc/sasldb2</filename>).

source: Note that the SASL database was created in Postfix's directory. In order to ensure consistency, we also turn <filename>/etc/sasldb2</filename> into a symbolic link pointing at the database used by Postfix, with the <command>ln -sf /var/spool/postfix/etc/sasldb2 /etc/sasldb2</command> command.
nb_no: Merk at SASL-databasen ble opprettet i Postfix-katalogen. For å sikre sammenhengen, omgjør vi også <filename>/etc/sasldb2</filename> til en symbolsk lenke som peker på databasen som brukes av Postfix, med <command>ln -sf /var/spool/postfix/etc/sasldb2 /etc/sasldb2</command>-kommandoen.
vi_vn: Ghi chú một điều rằng cơ sở dữ liệu SASL được tạo ra trước đó trong thư mục của Postfix. Để đảm bảo sự thống nhất, chúng ta cũng chuyển <filename>/etc/sasldb2</filename> thành một đường link tượng trưng (symbolic link) dẫn đến cơ sở dữ liệu sử dụng bởi Postfix, bằng lệnh <command>ln -sf /var/spool/postfix/etc/sasldb2 /etc/sasldb2</command>

source: Now we need to configure Postfix to use SASL. First the <literal>postfix</literal> user needs to be added to the <literal>sasl</literal> group, so that it can access the SASL account database. A few new parameters are also needed to enable SASL, and the <literal>smtpd_recipient_restrictions</literal> parameter needs to be configured to allow SASL-authenticated clients to send emails freely.
nb_no: Nå trenger vi å sette opp Postfix til å bruke SASL. Først må <literal>postfix</literal>-brukeren legges til <literal>sasl</literal>-gruppen, slik at den kan få tilgang til SASL-kontoens database. Et par nye parametere må også til for å aktivere SASL, og <literal>smtpd_recipient_restrictions</literal>-parameteret må konfigureres til å tillate at SASL-godkjente klienter fritt kan sende e-post.
vi_vn: Bây giờ chúng ta cần cấu hình Postfix để sử dụng SASL. Trước tiên, người dùng <literal>postfix</literal> cần được thêm vào nhóm <literal>sasl</literal>, để người dùng này có thể truy cập cơ sở dữ liệu tài khoản SASL. Một vài tham số mới cũng cần để kích hoạt SASL, và tham biến <literal>smtpd_recipient_restrictions</literal> cần phải được cấu hình để cho phép các vị khách đã được chứng thực thông qua SASL gửi thư điện tử một cách thoải mái.

source: Enabling SASL in <filename>/etc/postfix/main.cf</filename>
nb_no: Å sette opp SASL i <filename>/etc/postfix/main.cf</filename>
vi_vn: Kích hoạt SASL trong <filename>/etc/postfix/main.cf</filename>"

source: # Enable SASL authentication smtpd_sasl_auth_enable = yes # Define the SASL authentication domain to use smtpd_sasl_local_domain = $myhostname [...] # Adding permit_sasl_authenticated before reject_unauth_destination # allows relaying mail sent by SASL-authenticated users smtpd_recipient_restrictions = permit_mynetworks, permit_sasl_authenticated, reject_unauth_destination, [...]
vi_vn: # Kích hoạt chứng thực SASL smtpd_sasl_auth_enable = yes # Xác định miền chứng thực SASL để sử dụng (SASL authentication domain) smtpd_sasl_local_domain = $myhostname [...] # Thêm permit_sasl_authenticated vào trước reject_unauth_destination # cho phép chuyển phát thư gửi bởi những người dùng đã được chứng thực qua SASL smtpd_recipient_restrictions = permit_mynetworks, permit_sasl_authenticated, reject_unauth_destination, [...]

source: <emphasis>EXTRA</emphasis> Authenticated SMTP client
nb_no: <emphasis>EKSTRA</emphasis> Autentisert SMTP-klient
vi_vn: <emphasis>THÔNG TIN THÊM</emphasis> Chương trình khách SMTP đã được chứng thực

source: Most email clients are able to authenticate to an SMTP server before sending outgoing messages, and using that feature is a simple matter of configuring the appropriate parameters. If the client in use does not provide that feature, the workaround is to use a local Postfix server and configure it to relay email via the remote SMTP server. In this case, the local Postfix itself will be the client that authenticates with SASL. Here are the required parameters:
nb_no: De fleste e-postklienter er i stand til å autentisere til en SMTP-tjener før den sender utgående meldinger, og ved hjelp av denne funksjonen er det en enkel sak å konfigurere de riktige parameterne. Dersom klienten som brukes ikke leverer den funksjonen, er den midlertidige løsningen å bruke en lokal Postfix-tjener, og konfigurere den til å videresende e-post via den eksterne SMTP-tjeneren. I dette tilfellet vil den lokale Postfixen selv være klienten som autentiserer med SASL. Her er de nødvendige parameterne:
vi_vn: Đa số những chương trình khách thư điện tử có thể chứng thực với một máy phục vụ SMTP trước khi gửi các thông điệp ra ngoài, và sử dụng tính năng này đơn giản chỉ cần cấu hình những tham số phù hợp. Nếu chương trình khách đang được sử dụng đó không cung cấp tính năng đó, cách khác là sử dụng một máy phục vụ Postfix nội bộ và cấu hình nó để chuyển phát thư điện tử thông qua máy phục vụ SMTP. Trong trường hợp này, chính máy Postfix nội bộ sẽ là chương trình khách chứng thực thông qua SASL. Sau đây là những thông số bắt buộc:

source: The <filename>/etc/postfix/sasl_passwd</filename> file needs to contain the username and password to use for authenticating on the <literal>mail.falcot.com</literal> server. Here is an example:
nb_no: Filen <filename>/etc/postfix/sasl_passwd</filename> må inneholde brukernavnet og passordet for å autentisere på <literal>mail.falcot.com</literal>-tjeneren. Her er et eksempel:
vi_vn: Tập tin <filename>/etc/postfix/sasl_passwd</filename> cần phải chứa một tên tài khoản và mật mã để sử dụng tính năng chứng thực trên máy phục vụ <literal>mail.falcot.com</literal>. Sau đây là một ví dụ:

source: As for all Postfix maps, this file must be turned into <filename>/etc/postfix/sasl_passwd.db</filename> with the <command>postmap</command> command.
nb_no: Som for alle Postfix-funksjoner, må denne filen bli omgjort til <filename>/etc/postfix/sasl_passwd.db</filename> med <command>postmap</command>-kommandoen.
vi_vn: Giống như tất cả các ánh xạ Postfix(Postfix maps), tập tin này phải được chuyển thành <filename>/etc/postfix/sasl_passwd.db</filename> với lệnh <command>postmap</command>.

source: Web Server (HTTP)
nb_no: Nett-tjener (HTTP)
vi_vn: Máy phục vụ Web (HTTP)

source: The Falcot Corp administrators decided to use the Apache HTTP server, included in Debian <emphasis role="distribution">Jessie</emphasis> at version 2.4.10.
nb_no: Falcot Corp-administrtatorene besluttet å bruke Apache HTTP-tjeneren, inkludert i Debian <emphasis role="distribution">Jessie</emphasis> med versjon 2.4.10.
vi_vn: Những nhà quản trị của công ty Falcot quyết định sử dụng máy phục vụ HTTP Apache, có sẵn trong Debian <emphasis role="distribution">Jessie</emphasis> tại phiên bản 2.4.10.

source: <primary>server</primary><secondary>web</secondary>
nb_no: <primary>tjener</primary><secondary>web</secondary>
vi_vn: <primary>máy phục vụ</primary><secondary>web</secondary>

source: <primary>web server</primary>
nb_no: <primary>web server (webserver/nettjener))</primary>
vi_vn: <primary>máy phục vụ web</primary>

source: <primary>server</primary><secondary>HTTP</secondary>
nb_no: <primary>tjener</primary><secondary>HTTP</secondary>
vi_vn: <primary>máy phục vụ</primary><secondary>HTTP</secondary>

source: <primary>HTTP</primary><secondary>server</secondary>
nb_no: <primary>HTTP</primary><secondary>tjener</secondary>
vi_vn: <primary>HTTP</primary><secondary>máy phục vụ</secondary>

source: <emphasis>ALTERNATIVE</emphasis> Other web servers
nb_no: <emphasis>ALTERNATIV</emphasis> Andre nett-tjenere
vi_vn: <emphasis>LỰA CHỌN THAY THẾ</emphasis> Những máy phục vụ web khác

source: Apache is merely the most widely-known (and widely-used) web server, but there are others; they can offer better performance under certain workloads, but this has its counterpart in the smaller number of available features and modules. However, when the prospective web server is built to serve static files or to act as a proxy, the alternatives, such as <emphasis role="pkg">nginx</emphasis> and <emphasis role="pkg">lighttpd</emphasis>, are worth investigating.
nb_no: Apache er rett og slett den mest kjente (og mye brukt) nett-tjeneren, men det finnes andre. De kan tilby bedre ytelse under visse arbeidsbelastninger, men dette har sitt motstykke i færre, tilgjengelige funksjoner og moduler. Men når den potensielle nett-tjeneren bygges for å betjene statiske filer, eller å fungere som mellomtjener, er alternativene, for eksempel <emphasis role="pkg">nginx</emphasis> og <emphasis role="pkg">lighttpd</emphasis>, verdt å se nærmere på.
vi_vn: Apache chỉ là một máy phục vụ web được biết đến khá nhiều (và được sử dụng rộng rãi), nhưng có những nhà cung cấp khác; họ có thể cung cấp hiệu suất cao dưới một lượng tải nhất định nào đó, nhưng lựa chọn này bị cân bằng lại bởi ít tính năng và mô-đun hơn. Tuy nhiên, khi máy phục vụ web sẽ được lựa chọn để cung cấp các tập tin tĩnh hay để hoạt động như một trạm chuyển hướng, những lựa chọn khác, như là <emphasis role="pkg">nginx</emphasis> và <emphasis role="pkg">lighttpd</emphasis>, rất đáng để xem xét.

source: Installing Apache
nb_no: Å installere Apache
vi_vn: Cài đặt Apache

source: Installing the <emphasis role="pkg">apache2</emphasis> package is all that is needed. It contains all the modules, including the <emphasis>Multi-Processing Modules</emphasis> (MPMs) that affect how Apache handles parallel processing of many requests (those used to be provided in separate <emphasis role="pkg">apache2-mpm-*</emphasis> packages). It will also pull <emphasis role="pkg">apache2-utils</emphasis> containing the command line utilities that we will discover later.
nb_no: Å installere <emphasis role="pkg">apache2</emphasis>-pakken er alt som trenges. Den inneholder alle modulene, inkludert <emphasis>Multi-Processing Modules</emphasis> (MPM-er) som påvirker hvordan Apache håndterer parallell behandling av mange forespørsler (de som bruker å bli levert i separate <emphasis role="pkg">apache2-mpm-*</emphasis>-pakker). Den vil også trekke på <emphasis role="pkg">apache2-utils</emphasis> som inneholder kommandolinjeverktøy som vi vil oppdage senere.
vi_vn: Cài đặt gói phần mềm <emphasis role="pkg">apache2</emphasis> là tất cả những gì cần thiết. Nó chứa tất cả các mô-đun, bao gồm <emphasis>Những Mô-đun đa xử lý(Multi-Processing Modules)</emphasis> (MPMs) kiểm soát việc Apache thực hiện việc xử lý song song những yêu cầu (những mô-đun trước đây được cung cấp dưới hình thức các gói phần mềm <emphasis role="pkg">apache2-mpm-*</emphasis> rời rạc). Nó sẽ kéo về gói phần mềm <emphasis role="pkg">apache2-utils</emphasis> vốn chứa những tiện ích dòng lệnh mà chúng ta sẽ khám phá sau.

source: The MPM in use affects significantly the way Apache will handle concurrent requests. With the <emphasis>worker</emphasis> MPM, it uses <emphasis>threads</emphasis> (lightweight processes), whereas with the <emphasis>prefork</emphasis> MPM it uses a pool of processes created in advance. With the <emphasis>event</emphasis> MPM it also uses threads, but the inactive connections (notably those kept open by the HTTP <emphasis>keep-alive</emphasis> feature) are handed back to a dedicated management thread.
nb_no: Når MPM brukes, påvirkes måten Apache vil håndtere samtidige forespørsler på betydelig. Med <emphasis>worker</emphasis>-MPM, bruker den <emphasis>threads</emphasis> (lettvektprosesser), mens med <emphasis>prefork</emphasis>-MPM bruker den en samling prosesser som er laget på forhånd. Med <emphasis>event</emphasis>-MPM vil den også bruke tråder, men de inaktive tilkoblingene (spesielt de som holdes åpne av HTTP <emphasis>keep-alive</emphasis>-funksjonen) blir levert tilbake til en øremerket management-tråd (ledelsestråd).
vi_vn: MPM khi đang hoạt động ảnh hưởng lớn đến cách Apache xử lý các yêu cầu cùng lúc. Với MPM <emphasis>worker</emphasis>, nó sử dụng các <emphasis>thread</emphasis> (các tiến trình nhỏ và nhẹ), trong khi MPM <emphasis>prefork</emphasis> sử dụng một kho tiến trình được tạo sẵn từ trước. Với MPM <emphasis>event</emphasis>, nó cũng sử dụng các thread, nhưng các kết nối không có tín hiệu gì (đặc biệt những cái được giữ chạy bởi tính năng HTTP <emphasis>keep-alive</emphasis>) được gửi lại cho một thread riêng quản lý.

source: The Falcot administrators also install <emphasis role="pkg">libapache2-mod-php5</emphasis> so as to include the PHP support in Apache. This causes the default <emphasis>event</emphasis> MPM to be disabled, and <emphasis>prefork</emphasis> to be used instead, since PHP only works under that particular MPM.
nb_no: Falcot administratorene installerer også <emphasis role="pkg">libapache2-mod-php5</emphasis> for å inkludere PHP-støtte i Apache. Dette fører til at standard <emphasis>event</emphasis>-MPM-en blir deaktivert, og at <emphasis>prefork</emphasis> blir brukt i stedet, ettersom PHP bare virker under denne bestemte MPM-en.
vi_vn: Các nhà quản trị hệ thống Falcot cũng cài <emphasis role="pkg">libapache2-mod-php5</emphasis> để đưa hỗ trợ PHP vào trong Apache. Điều này làm cho MPM <emphasis>event</emphasis> ngầm định bị tắt đi, và <emphasis>prefork</emphasis> được đưa vào sử dụng thay thế, bởi PHP chỉ hoạt động với MPM đó mà thôi.
