Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: The entry described above mounts, at system startup, the <filename>/shared/</filename> NFS directory from the <literal>arrakis</literal> server into the local <filename>/srv/shared/</filename> directory. Read-write access is requested (hence the <literal>rw</literal> parameter). The <literal>nosuid</literal> option is a protection measure that wipes any <literal>setuid</literal> or <literal>setgid</literal> bit from programs stored on the share. If the NFS share is only meant to store documents, another recommended option is <literal>noexec</literal>, which prevents executing programs stored on the share. Note that on the server, the <filename>shared</filename> directory is below the NFSv4 root export (for example <filename>/export/shared</filename>), it is not a top-level directory.
nb_no: Inngangen ovenfor monterer, ved systemoppstart, <filename>/shared/</filename> NFS-mappen fra <literal>arrakis</literal>-tjeneren til den lokale <filename>/srv/shared/</filename>-mappen. Lese- og skriveadgang kreves (derav <literal>rw</literal>-parameteret). Valget <literal>nosuid</literal> er et beskyttelsestiltak som sletter alle <literal>setuid</literal>, eller <literal>setgid</literal>-bit fra programmer lagret i delingen. Hvis NFS-delingen kun er ment til å lagre dokumenter, er et annet anbefalt alternativ <literal>noexec</literal>, som hindrer kjøring av programmer som er lagret i delingen. Legg merke til at på tjeneren er ikke <filename>shared</filename>-mappen under NFSv4 root export (for eksempel <filename>/export/shared</filename>), en toppnivåmappe.
vi_vn: Mục được mô tả phía trên kết nối, khi hệ thống khởi động, thư mục NFS <filename>/shared/</filename> từ máy phục vụ <literal>arrakis</literal> vào thư mục nội bộ <filename>/srv/shared/</filename>. Truy cập đọc-ghi được yêu cầu (và vì thế có tham số <literal>rw</literal>). Lựa chọn <literal>nosuid</literal> là một biện pháp bảo vệ vốn dọn sạch các bit <literal>setuid</literal> or <literal>setgid</literal> khỏi những chương trình được lưu trong chia sẻ. Nếu chia sẻ NFS chỉ dành cho lưu trữ các tài liệu, một lựa chọn được đề xuất khác là <literal>noexec</literal>, vốn chặn các chương trình đang chạy lưu lên chia sẻ. Ghi chú rằng trên máy phục vụ, thư mục <filename>shared</filename> nằm dưới mục xuất khẩu gốc NFSv4 (ví dụ <filename>/export/shared</filename>), nó không phải là một thư mục gốc.

source: The <citerefentry><refentrytitle>nfs</refentrytitle> <manvolnum>5</manvolnum></citerefentry> manual page describes all the options in some detail.
nb_no: Manualsiden <citerefentry><refentrytitle>nfs</refentrytitle> <manvolnum>5</manvolnum></citerefentry> beskriver alle valgmulighetene noe mer detaljert.
vi_vn: Trang hướng dẫn sử dụng <citerefentry><refentrytitle>nfs</refentrytitle> <manvolnum>5</manvolnum></citerefentry> mô tả các lựa chọn chi tiết hơn.

source: Setting Up Windows Shares with Samba
vi_vn: Cài đặt các chia sẻ Windows với Samba

source: Samba is a suite of tools handling the SMB protocol (also known as “CIFS”) on Linux. This protocol is used by Windows for network shares and shared printers.
nb_no: Samba er en pakke med verktøy som håndterer SMB-protokollen (også kjent som «CIFS») på Linux. Denne protokollen brukes av Windows for nettverksressurser og delte skrivere.
vi_vn: Samba là một tập hợp các công cụ làm việc với giao thức SMB (cũng được biết đến như là “CIFS”) trên Linux. Giao thức này được sử dụng bởi Windows cho các chia sẻ qua mạng và chia sẻ máy in.

source: <primary>Windows share</primary>
vi_vn: <primary>Chia sẻ Windows</primary>

source: Samba can also act as an Windows domain controller. This is an outstanding tool for ensuring seamless integration of Linux servers and the office desktop machines still running Windows.
nb_no: Samba kan også virke som en Windows domenekontrollør. Denne er et enestående verktøy for å sikre sømløs integrasjon av Linux-tjenere og stasjonære kontormaskiner som fortsatt kjører Windows.
vi_vn: Samba cũng có thể hoạt động như một trạm điều khiển miền máy tính (domain controller) của Windows. Nó là một công cụ tuyệt vời để đảm bảo tích hợp xuyên suốt với các máy phục vụ Linux và các máy tính bàn trong văn phòng vốn vẫn sử dụng Windows.

source: Samba Server
nb_no: Samba-tjener
vi_vn: Máy phục vụ Samba

source: The <emphasis role="pkg">samba</emphasis> package contains the main two servers of Samba 4, <command>smbd</command> and <command>nmbd</command>.
nb_no: Pakken <emphasis role="pkg">samba</emphasis> inneholder Samba 4s to hovedtjenere, <command>smbd</command> og <command>nmbd</command>.
vi_vn: Gói phần mềm <emphasis role="pkg">samba</emphasis> chứa hai máy phục vụ của Samba 4, <command>smbd</command> and <command>nmbd</command>.

source: <emphasis>DOCUMENTATION</emphasis> Going further
nb_no: <emphasis>DOKUMENTASJON</emphasis> For viderekomne
vi_vn: <emphasis>TÀI LIỆU HƯỚNG DẪN</emphasis> Đi sâu hơn

source: The Samba server is extremely configurable and versatile, and can address a great many different use cases matching very different requirements and network architectures. This book only focuses on the use case where Samba is used as a standalone server, but it can also be a NT4 Domain Controller or a full Active Directory Domain Controller, or a simple member of an existing domain (which could be a managed by a Windows server).
vi_vn: Máy phục vụ Samba rất dễ cấu hình và đa dụng, và có thể hoạt động trong nhiều trường hợp với các yêu cầu và hạ tầng mạng ít có điểm chung. Cuốn sách này chỉ tập trung vào trường hợp Samba được sử dụng như một máy phục vụ đứng một mình, nhưng nó cũng có thể là một trạm điều khiển máy tính NT4(NT4 Domain Controller) hoặc một trạm điều khiển Active Directory(Active Directory Domain Controller), hoặc một thành viên đơn giản của một miền máy tính đã có (vốn có thể là một máy phục vụ Windows).

source: <primary>domain controller</primary>
nb_no: <primary>domenekontroller</primary>
vi_vn: <primary>trạm điều khiển miền máy tính (domain controller)</primary>

source: <primary>Windows domain</primary>
nb_no: <primary>Windows-domene</primary>
vi_vn: <primary>Miền máy tính Windows(Windows domain)</primary>

source: The <emphasis role="pkg">samba-doc</emphasis> package contains a wealth of commented example files in <filename>/usr/share/doc/samba-doc/examples/</filename>.
nb_no: Pakken <emphasis role="pkg">samba-doc</emphasis> inneholder et stort utvalg av kommenterte eksempelfiler i <filename>/usr/share/doc/samba-doc/examples/</filename>.
vi_vn: Gói phần mềm <emphasis role="pkg">samba-doc</emphasis> chứa rất nhiều tập tin ví dụ được ghi chú trong <filename>/usr/share/doc/samba-doc/examples/</filename>.

source: <emphasis>TOOL</emphasis> Authenticating with a Windows Server
nb_no: <emphasis>VERKTØY</emphasis> Autentisering med en Windows-tjener
vi_vn: <emphasis>CÔNG CỤ</emphasis> Xác thực với một máy phục vụ Windows

source: Winbind gives system administrators the option of using a Windows server as an authentication server. Winbind also integrates cleanly with PAM and NSS. This allows setting up Linux machines where all users of a Windows domain automatically get an account.
nb_no: Winbind gir systemadministratorer muligheten til å bruke en Windows-server som en godkjenningstjener. Winbind integrerer også rent med PAM og NSS. Dette gjør det mulig å sette opp Linux-maskiner der alle brukere av et Windows-domene automatisk får en konto.
vi_vn: Winbind cho các nhà quản trị hệ thống một lựa chọn sử dụng máy phục vụ Windows làm máy phục vụ việc xác thực. Winbind cũng tích hợp chặt với PAM và NSS. Điều này cho phép cài đặt các máy Linux mà tất cả những người sử dụng của một miền máy tính Windows tự động nhận được một tài khoản.

source: More information can be found in the <filename>/usr/share/doc/samba-doc/examples/pam_winbind/</filename> directory.
nb_no: Mer informasjon kan finnes i <filename>/usr/share/doc/samba-doc/examples/pam_winbind/</filename>-mappen.
vi_vn: Thông tin thêm có thể được tìm thấy ở thư mục <filename>/usr/share/doc/samba-doc/examples/pam_winbind/</filename>.

source: Configuring with <command>debconf</command>
nb_no: Å konfigurere med <command>debconf</command>
vi_vn: Cấu hình với <command>debconf</command>

source: The package sets up a minimal configuration during the initial installation but you should really run <command>dpkg-reconfigure samba-common</command> to adapt it:
nb_no: Pakken setter opp en minimal konfigurasjon under den første installasjonen, men du skulle virkelig kjøre <command>dpkg-reconfigure samba-common</command> for tilpasning til:
vi_vn: Gói phần mềm này cài đặt một cấu hình đơn giản trong suốt quá trình cài đặt ban đầu nhưng bạn nên thực sự chạy lệnh <command>dpkg-reconfigure samba-common</command> để nó thích ứng:

source: The first piece of required information is the name of the workgroup where the Samba server will belong (the answer is <literal>FALCOTNET</literal> in our case).
nb_no: Den første delen med nødvendig informasjon er navnet på arbeidsgruppen som Samba-tjeneren vil tilhøre (svaret er <literal>FALCOTNET</literal> i vårt tilfelle).
vi_vn: Mảnh thông tin bắt buộc đầu tiên là tên của nhóm làm việc(workgroup) mà máy phục vụ Samba thuộc về (câu trả lời là <literal>FALCOTNET</literal> trong trường hợp của chúng ta).

source: The package also proposes identifying the WINS server from the information provided by the DHCP daemon. The Falcot Corp administrators rejected this option, since they intend to use the Samba server itself as the WINS server.
nb_no: Pakken foreslår også å identifisere WINS-tjeneren ut fra opplysninger gitt av DHCP-nissen. Falcot Corp-administratorene forkastet dette alternativet, siden de har tenkt å bruke Samba-tjeneren som WINS-tjener.
vi_vn: Gói phần mềm này cũng đề xuất nhận dạng máy phục vụ WINS từ thông tin được cung cấp bởi dịch vụ nền DHCP. Các nhà quản trị hệ thống của Công ty Falcot từ chối lựa chọn này, bởi họ muốn dùng chính máy phục vụ Samba làm máy phục vụ WINS.

source: Configuring Manually
nb_no: Å konfigurere manuelt
vi_vn: Cấu hình thủ công

source: Changes to <filename>smb.conf</filename>
nb_no: Forandringer i <filename>smb.conf</filename>
vi_vn: Những thay đổi cho <filename>smb.conf</filename>

source: The requirements at Falcot require other options to be modified in the <filename>/etc/samba/smb.conf</filename> configuration file. The following excerpts summarize the changes that were effected in the <literal>[global]</literal> section.
nb_no: Kravene hos Falcot forutsetter også endringer i andre valg i <filename>/etc/samba/smb.conf</filename>. Følgende utdrag oppsummerer de endringene som ble berørt i <literal>[global]</literal>-seksjonen.
vi_vn: Những yêu cầu tại Falcot bắt buộc các lựa chọn khác phải được thay đổi trong tập tin cấu hình <filename>/etc/samba/smb.conf</filename>. Đoạn mã sau tóm tắt các thay đổi trong phần <literal>[global]</literal>.

source: [global] ## Browsing/Identification ### # Change this to the workgroup/NT-domain name your Samba server will part of workgroup = FALCOTNET # Windows Internet Name Serving Support Section: # WINS Support - Tells the NMBD component of Samba to enable its WINS Server wins support = yes <co id="smb.conf.wins"></co> [...] ####### Authentication ####### # Server role. Defines in which mode Samba will operate. Possible # values are "standalone server", "member server", "classic primary # domain controller", "classic backup domain controller", "active # directory domain controller". # # Most people will want "standalone sever" or "member server". # Running as "active directory domain controller" will require first # running "samba-tool domain provision" to wipe databases and create a # new domain. server role = standalone server # "security = user" is always a good idea. This will require a Unix account # in this server for every user accessing the server. security = user <co id="smb.conf.security"></co> [...]
vi_vn: [global] ## Duyệt/Nhận dạng ### # Thay đổi dòng sau thành nhóm-làm-việc/miền-máy-tính-NT mà máy phục vụ Samba sẽ là một phần trong đó workgroup = FALCOTNET # Phần hỗ trợ Windows Internet Name Serving: # WINS Support - Bảo thành phần NMBD của Samba để kích hoạt máy phục vụ WINS wins support = yes <co id="smb.conf.wins"></co> [...] ####### Xác thực ####### # Vai trò máy phục vụ. Xác định chế độ mà Samba sẽ hoạt động. Các giá trị có khả thi # là "máy phục vụ đơn độc", "máy phục vụ thành viên", "trạm điều khiển miền máy tính chủ lực cổ điển # (classic primary domain controller)", "trạm điều khiển miền máy tính dự phòng cổ điển # (classic backup domain controller)", "trạm điều khiển miền máy tính active directory # (active directory domain controller)". # # Đa số người dùng sẽ muốn "máy phục vụ đơn độc" hoặc "máy phục vụ thành viên". # Chạy như "trạm điều khiển miền máy tính active directory" sẽ buộc trước tiên # chạy "samba-tool domain provision" để xóa sạch các cơ sở dữ liệu và tạo một miền máy tính # mới. server role = standalone server # "security = user" luôn là một ý tốt. Điều này sẽ buộc phải có một tài khoản Unix # trong máy phục vụ này cho mỗi người sử dụng truy cập máy phục vụ. security = user <co id="smb.conf.security"></co> [...]

source: Indicates that Samba should act as a Netbios name server (WINS) for the local network.
nb_no: Viser at Samba skal fungere som en NetBIOS-navneserver (WINS) for det lokale nettverket.
vi_vn: Chỉ ra rằng Samba nên hoạt động như một máy phục vụ tên Netbios (Netbios name server) cho mạng nội bộ.

source: This is the default value for this parameter; however, since it is central to the Samba configuration, filling it explicitly is recommended. Each user must authenticate before accessing any share.
nb_no: Dette er standardverdien for denne parameteren; men siden den er sentral i Samba-konfigurasjon, anbefales det å fylle den inn eksplisitt. Hver bruker må godkjennes før noen deling.
vi_vn: Đây là giá trị ngầm định cho tham biến này; tuy nhiên, bởi nó là cốt lõi trong cấu hình Samba, điền giá trị vào một cách công khai được khuyến cáo. Mỗi người sử dụng phải xác thực trước khi truy cập một chia sẻ nào.

source: Adding Users
nb_no: Å legge til brukere
vi_vn: Thêm các người dùng

source: Each Samba user needs an account on the server; the Unix accounts must be created first, then the user needs to be registered in Samba's database. The Unix step is done quite normally (using <command>adduser</command> for instance).
nb_no: Hver Samba-bruker trenger en konto på tjeneren; Unix-kontoer må opprettes først, deretter må brukeren bli registrert i Sambas database. Unix-trinnet utføres ganske vanlig (ved hjelp <command>adduser</command> for eksempel).
vi_vn: Mỗi một người sử dụng Samba cần một tài khoản trên máy phục vụ; các tài khoản Unix phải được tạo trước, sau đó mỗi người sử dụng cần phải được đăng ký vào cơ sở dữ liệu của Samba. Bước Unix được thực hiện như bình thường (ví dụ, sử dụng lệnh <command>adduser</command>).

source: Adding an existing user to the Samba database is a matter of running the <command>smbpasswd -a <replaceable>user</replaceable></command> command; this command asks for the password interactively.
nb_no: Å legge til en eksisterende bruker til Samba-databasen er et spørsmål om å kjøre <command>smbpasswd -a <replaceable>bruker</replaceable></command>-kommandoen; denne kommandoen ber interaktivt om passordet.
vi_vn: Thêm một người dùng đã tồn tại vào cơ sở dữ liệu Samba chỉ cần chạy lệnh <command>smbpasswd -a <replaceable>user</replaceable></command>; lệnh này hỏi mật mã theo cách tương tác trực tiếp.

source: A user can be deleted with the <command>smbpasswd -x <replaceable>user</replaceable></command> command. A Samba account can also be temporarily disabled (with <command>smbpasswd -d <replaceable>user</replaceable></command>) and re-enabled later (with <command>smbpasswd -e <replaceable>user</replaceable></command>).
nb_no: En bruker kan bli slettet med <command>smbpasswd -x <replaceable>bruker</replaceable></command>-kommandoen. En Samba-konto kan også midlertidig bli deaktivert (med <command>smbpasswd -d <replaceable>bruker</replaceable></command>), og reaktivert senere (med <command>smbpasswd -e <replaceable>bruker</replaceable></command>).
vi_vn: Một người sử dụng có thể bị xóa với lệnh <command>smbpasswd -x <replaceable>user</replaceable></command>. Một tài khoản Samba có thể bị tắt đi tạm thời (với lệnh <command>smbpasswd -d <replaceable>user</replaceable></command>) và được kích hoạt lại sau đó (với lệnh <command>smbpasswd -e <replaceable>user</replaceable></command>).

source: Samba Client
nb_no: Samba-klient
vi_vn: Chương trình khách Samba

source: The client features in Samba allow a Linux machine to access Windows shares and shared printers. The required programs are available in the <emphasis role="pkg">cifs-utils</emphasis> and <emphasis role="pkg">smbclient</emphasis> packages.
nb_no: Klient-funksjonene i Samba tillater en Linux-maskin å få tilgang til Windows-delinger og delte skrivere. De nødvendige programmene er tilgjengelig i <emphasis role="pkg">cifs-utils</emphasis> og <emphasis role="pkg">smbclient</emphasis>-pakkene.
vi_vn: Các tính năng của chương trình khách trong Samba cho phép một máy tính Linux truy cập các chia sẻ và các máy in được chia sẻ của Windows. Các chương trình bắt buộc đã có sẵn trong các gói phần mềm <emphasis role="pkg">cifs-utils</emphasis> và <emphasis role="pkg">smbclient</emphasis>.

source: The <command>smbclient</command> Program
nb_no: Programmet <command>smbclient</command>
vi_vn: Chương trình <command>smbclient</command>

source: The <command>smbclient</command> program queries SMB servers. It accepts a <literal>-U <replaceable>user</replaceable></literal> option, for connecting to the server under a specific identity. <command>smbclient //<replaceable>server</replaceable>/<replaceable>share</replaceable></command> accesses the share in an interactive way similar to the command-line FTP client. <command>smbclient -L <replaceable>server</replaceable></command> lists all available (and visible) shares on a server.
nb_no: Programmet <command>smbclient</command> forespør SMB-tjenere. Det aksepterer et <literal>-U <replaceable>bruker</replaceable></literal>-alternativ, for å koble til tjeneren med en bestemt identitet. <command>smbclient //<replaceable>server</replaceable>/<replaceable>dele</replaceable></command> åpner for delingen interaktivt på en måte lik kommandolinje FTP-klienten. <command>smbclient -L <replaceable>server</replaceable></command> lister opp alle tilgjengelige (og synlige) delinger på en tjener.
vi_vn: Chương trình <command>smbclient</command> truy xuất các máy phục vụ SMB. Nó chấp nhận lựa chọn <literal>-U <replaceable>user</replaceable></literal>, để kết nối tới máy phục vụ dưới một danh tính cụ thể nào đó. Lệnh <command>smbclient //<replaceable>server</replaceable>/<replaceable>share</replaceable></command> truy cập chia sẻ đó theo một cách có tương tác tương tự như chương trình khách FTP trên dòng lệnh. Lệnh <command>smbclient -L <replaceable>server</replaceable></command> liệt kê tất cả các chia sẻ có sẵn (và nhìn thấy được) trên một máy phục vụ.

source: Mounting Windows Shares
nb_no: Montere Windows-delinger
vi_vn: Kết nối các chia sẻ Windows

source: The <command>mount</command> command allows mounting a Windows share into the Linux filesystem hierarchy (with the help of <command>mount.cifs</command> provided by <emphasis role="pkg">cifs-utils</emphasis>).
nb_no: Kommandoen <command>mount</command> tillater montering av en Windows-deling inn i Linux-filsystemhierarki (ved hjelp av <command>mount.cifs</command> levert av <emphasis role="pkg">cifs-utils</emphasis>).
vi_vn: Lệnh <command>mount</command> cho phép kết nối một chia sẻ Windows vào một cây hệ thống tập tin Linux (với sự giúp đỡ của <command>mount.cifs</command> được cung cấp bởi <emphasis role="pkg">cifs-utils</emphasis>).

source: <primary>Windows share, mounting</primary>
nb_no: <primary>Windows dele, montering</primary>
vi_vn: <primary>Chia sẻ Windows, kết nối</primary>

source: Mounting a Windows share
nb_no: Å montere en Windows-deling
vi_vn: Kết nối một chia sẻ Windows

source: The <filename>/etc/smb-credentials</filename> file (which must not be readable by users) has the following format:
nb_no: Fil <filename>/etc/smb-credentials</filename> (som ikke må være lesbar av brukere) har følgende format:
vi_vn: Tập tin <filename>/etc/smb-credentials</filename> (vốn phải không đọc được bởi người sử dụng) có định dạng sau:

source: Other options can be specified on the command-line; their full list is available in the <citerefentry><refentrytitle>mount.cifs</refentrytitle> <manvolnum>1</manvolnum></citerefentry> manual page. Two options in particular can be interesting: <literal>uid</literal> and <literal>gid</literal> allow forcing the owner and group of files available on the mount, so as not to restrict access to root.
nb_no: Andre alternativer kan spesifiseres på kommandolinjen; den fullstendige listen er tilgjengelig i <citerefentry><refentrytitle>mount.cifs</refentrytitle> <manvolnum>1</manvolnum></citerefentry>-manulaside. Spesielt to alternativer kan være interessante: <literal>uid</literal> og <literal>gid</literal> som tillater å tvinge eieren og gruppen filer som er tilgjengelig i monteringen, for ikke å begrense adgangen til rot.
vi_vn: Các lựa chọn khác có thể được chỉ định trên dòng lệnh; danh sách đầy đủ của chúng có sẵn trong trang hướng dẫn sử dụng <citerefentry><refentrytitle>mount.cifs</refentrytitle> <manvolnum>1</manvolnum></citerefentry>. Hai lựa chọn cụ thể có thể thú vị: <literal>uid</literal> và <literal>gid</literal> cho phép ép buộc người sở hữu và danh sách các tập tin sẽ được hiện ra trên kết nối, để khỏi phải giới hạn truy cập chỉ cho tài khoản quản trị.

source: A mount of a Windows share can also be configured in <filename>/etc/fstab</filename>:
nb_no: En montering av en Windows-deling kan også konfigureres i <filename>/etc/fstab</filename>:
vi_vn: Một chia sẻ Windows cũng có thể được cấu hình trong <filename>/etc/fstab</filename>:

source: Unmounting a SMB/CIFS share is done with the standard <command>umount</command> command.
nb_no: Å avmontere en SMB/CIFS-deling er gjort med standarden <command>umount</command>-kommandoen.
vi_vn: Bỏ kết nối SMB/CIFS được thực hiện với lệnh <command>umount</command>.

source: Printing on a Shared Printer
nb_no: Å skrive ut på en delt skriver
vi_vn: In ấn trên một máy in được chia sẻ
