Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: All system administrators try to face this nuisance with spam filters, but of course spammers keep adjusting to try to work around these filters. Some even rent networks of machines compromised by a worm from various crime syndicates. Recent statistics estimate that up to 95% of all emails circulating on the Internet are spam!
nb_no: Alle systemadministratorer prøver å møte denne ordensforstyrrelser med spamfiltre, men selvfølgelig vil spammere holde seg oppdatert for å prøve å omgå disse filtrene. Noen leier til og med nettverk av maskiner kompromittert med en orm fra ulike kriminelle organisasjoner. Nyere statistikk anslår at opptil 95 % av all e-post som sirkulerer på Internett er spam!
vi_vn: Những quản trị hệ thống cố gắng đối mặt với vấn đề này bằng các bộ lọc thư rác, nhưng dĩ nhiên những spammer luôn cố gắng xoay sở để vượt qua các bộ lọc này. Một số thậm chí thuê một mạng máy tính nhiễm các loại sâu máy tính (worm) được tạo ra bởi các nhóm tội phạm. Thông số gần đây ước chừng có đến 95% của tất cả thư điện tử di chuyển trên Internet là thư rác (spam).

source: IP-Based Access Restrictions
nb_no: IP-baserte adgangsrestriksjoner
vi_vn: Những giới hạn truy cập dựa trên IP

source: The <literal>smtpd_client_restrictions</literal> directive controls which machines are allowed to communicate with the email server.
nb_no: Direktivet <literal>smtpd_client_restrictions</literal> styrer hvilke maskiner som får lov til å kommunisere med e-posttjeneren.
vi_vn: Tham biến <literal>smtpd_client_restrictions</literal> kiểm soát những máy nào được cho phép để giao tiếp với máy phục vụ thư điện tử.

source: Restrictions Based on Client Address
nb_no: Restriksjoner basert på klientadresse
vi_vn: Những giới hạn dựa trên địa chỉ máy khách

source: When a variable contains a list of rules, as in the example above, these rules are evaluated in order, from the first to the last. Each rule can accept the message, reject it, or leave the decision to a following rule. As a consequence, order matters, and simply switching two rules can lead to a widely different behavior.
nb_no: Når en variabel inneholder en liste med regler, som i eksempelet ovenfor, er disse reglene evaluert i rekkefølge fra den første til den siste. Hver regel kan akseptere meldingen, avvise den, eller overlate avgjørelsen til en følgende regel. Som en konsekvens, rekkefølge betyr noe, og ganske enkelt å bytte om på to regler kan føre til et vidt forskjellig resultat.
vi_vn: Khi một tham biến chứa một danh sách những quy tắc, như trong ví dụ ở trên, những quy tắc được thực thi theo thứ tự, từ đầu tiên đến cuối cùng. Mỗi quy tắc có thể nhận một thông điệp, từ chối nó, hoặc để việc quyết định đó cho quy tắc nằm phía sau. Do đó, thứ tự là quan trọng, và đơn giản hoán đổi giữa hai quy tắc có thể dẫn đến cách hoạt động hoàn toàn khác.

source: The <literal>permit_mynetworks</literal> directive, used as the first rule, accepts all emails coming from a machine in the local network (as defined by the <emphasis>mynetworks</emphasis> configuration variable).
nb_no: Direktivet <literal>permit_mynetworks</literal>, brukt som den første regelen, godtar alle e-poster som kommer fra en maskin i det lokale nettverket (som definert av konfigureringsvariabelen <emphasis>mynetworks</emphasis>).
vi_vn: Chỉ thị <literal>permit_mynetworks</literal>, vốn được sử dụng như quy tắc đầu tiên, chấp nhận tất cả những thư điện tử đến từ một máy tính trong mạng nội bộ (như được định nghĩa trong tham biến cấu hình <emphasis>mynetworks</emphasis>)

source: The second directive would normally reject emails coming from machines without a completely valid DNS configuration. Such a valid configuration means that the IP address can be resolved to a name, and that this name, in turn, resolves to the IP address. This restriction is often too strict, since many email servers do not have a reverse DNS for their IP address. This explains why the Falcot administrators prepended the <literal>warn_if_reject</literal> modifier to the <literal>reject_unknown_client</literal> directive: this modifier turns the rejection into a simple warning recorded in the logs. The administrators can then keep an eye on the number of messages that would be rejected if the rule were actually enforced, and make an informed decision later if they wish to enable such enforcement.
nb_no: Det andre direktivet vil normalt avvise e-post fra maskiner uten en helt gyldig DNS-konfigurasjon. En slik gyldig konfigurasjon betyr at IP-adressen kan løses til et navn, og at dette navnet i sin tur går over til IP-adressen. Denne begrensningen er ofte altfor streng, siden mange e-posttjenere ikke vil ha en omvendt DNS for deres IP-adresse. Dette forklarer hvorfor Falcot administratorer forvalgte <literal>warn_if_reject</literal>-modifikatoren til <literal>reject_unknown_client</literal>-direktivet: Denne modifikatoren gjør om avvisningen til en enkel varsling registrert i loggene. Administratorene kan deretter holde et øye med antall meldinger som ville bli avvist hvis regelen faktisk ble håndhevet, og ta en avgjørelse senere hvis de ønsker å muliggjøre slik håndheving.
vi_vn: Chỉ thị thứ hai thông thường sẽ từ chối những thư điện tử đến từ những máy tính không có cấu hình DNS tuyệt đối hợp lệ. Một cấu hình như vậy nghĩa là địa chỉ IP đó có thể được giải mã sang một tên, và tên này, tới lượt của nó, sẽ được giải mã sang một địa chỉ IP. Sự giới hạn này thông thường quá nghiêm khắc, bởi vì nhiều máy phục vụ thư điện tử không có một DNS phiên mã ngược cho địa chỉ IP. Điều này giải thích vì sau các nhà quản trị hệ thống của Falcot thêm từ bổ nghĩa <literal>warn_if_reject</literal> vào phía trước chỉ thị <literal>reject_unknown_client</literal>: từ bổ nghĩa này chuyển sự từ chối đó thành một cảnh báo đơn giản ghi lại trong các nhật ký. Những nhà quản trị hệ thống có thể theo dõi số lượng thông điệp đáng lẽ sẽ bị từ chối nếu quy tắc này được đưa vào hoạt động, và ra một quyết định đúng đắn sau đó nếu họ thực sự muốn điều đó hay không.

source: <emphasis>TIP</emphasis> <emphasis>access</emphasis> tables
nb_no: <emphasis>TIPS</emphasis> <emphasis>access</emphasis>-tabeller
vi_vn: <emphasis>THÔNG TIN THÊM</emphasis> Những bảng <emphasis>truy cập</emphasis>

source: The restriction criteria include administrator-modifiable tables listing combinations of senders, IP addresses, and allowed or forbidden hostnames. These tables can be created from an uncompressed copy of the <filename>/usr/share/doc/postfix-doc/examples/access.gz</filename> file. This model is self-documented in its comments, which means each table describes its own syntax.
nb_no: Restriksjonskriteriet omfatter administrator-modifiserbare tabeller som lister kombinasjoner av avsendere, IP-adresser, og tillatte eller forbudte vertsnavn. Disse tabellene kan opprettes fra en ukomprimert kopi av <filename>/usr/share/doc/postfix-doc/examples/access.gz</filename>-filen. Denne modellen er selv dokumentert i sine kommentarer, noe som betyr hver tabell beskriver sin egen syntaks.
vi_vn: Các điều kiện giới hạn bao gồm các bảng, điều chỉnh được bởi nhà quản trị hệ thống, liệt kê những xâu chuỗi thông tin của những người gửi, địa chỉ IP, và những tên của những máy cho phép hay bị cấm. Những bảng này có thể được tạo ra từ một bản sao đã được giải nén của tập tin <filename>/usr/share/doc/postfix-doc/examples/access.gz</filename>. Bản mẫu này được mô tả trong những ghi chú của nó, nghĩa là từng bảng mô tả cú pháp riêng của nó.

source: The <filename>/etc/postfix/access_clientip</filename> table lists IP addresses and networks; <filename>/etc/postfix/access_helo</filename> lists domain names; <filename>/etc/postfix/access_sender</filename> contains sender email addresses. All these files need to be turned into hash-tables (a format optimized for fast access) after each change, with the <command>postmap /etc/postfix/<replaceable>file</replaceable></command> command.
nb_no: Tabellen <filename>/etc/postfix/access_clientip</filename> viser IP-adresser og nettverk; <filename>/etc/postfix/access_helo</filename> lister domenenavn; <filename>/etc/postfix/access_sender</filename> inneholder e-postadresser til avsendere. Alle disse filene må bli omgjort til nøkkeltabeller (et format som er optimalisert for rask tilgang) etter hver endring med <command>postmap /etc/postfix/<replaceable>fil</replaceable></command>-kommandoen.
vi_vn: Bảng <filename>/etc/postfix/access_clientip</filename> liệt kê những địa chỉ IP và những mạng máy tính; <filename>/etc/postfix/access_helo</filename> liệt kê những tên miền; <filename>/etc/postfix/access_sender</filename> chứa những địa chỉ thư điện tử người gửi. Tất cả những tập tin này cần phải được chuyển thành những bảng hash (một định dạng được tối ưu hóa cho truy cập tức thời) sau mỗi thay đổi, với lệnh <command>postmap /etc/postfix/<replaceable>file</replaceable></command>

source: The third directive allows the administrator to set up a blacklist and a whitelist of email servers, stored in the <filename>/etc/postfix/access_clientip</filename> file. Servers in the whitelist are considered as trusted, and the emails coming from there therefore do not go through the following filtering rules.
nb_no: Den tredje direktivet tillater administratoren å sette opp en svarteliste og en hviteliste med e-postservere, lagret i <filename>/etc/postfix/access_clientip</filename>-filen. Tjenere i hvitelisten anses som klarert, og e-poster som kommer derfra går derfor ikke gjennom følgende filtreringsregler.
vi_vn: Chỉ thị thứ ba cho phép quản trị hệ thống sắp đặt một danh sách đen và một danh sách trắng (cho phép) những máy phục vụ thư điện tử, lưu trong tập tin <filename>/etc/postfix/access_clientip</filename>. Các máy phục vụ trong danh sách trắng được xem là đáng tin cậy, và những thư điện tử đến từ những nơi này không cần phải đi qua các quy tắc lọc sau đây.

source: The last two rules reject any message coming from a server listed in one of the indicated blacklists. RBL is an acronym for <emphasis>Remote Black List</emphasis>; there are several such lists, but they all list badly configured servers that spammers use to relay their emails, as well as unexpected mail relays such as machines infected with worms or viruses.
nb_no: De to siste regler avviser enhver melding som kommer fra en tjener oppført i en av de angitte svartelister. RBL er en forkortelse for <emphasis>Remote Black List</emphasis>. Det er flere slike lister, men alle lister dårlig konfigurerte tjenere som spammere bruker for å videresende sin e-post, samt uventede post-formidlere, for eksempel maskiner infisert med ormer eller virus.
vi_vn: Hai quy tắc cuối từ chối bất kỳ thông điệp nào đến từ một máy phục vụ được kể đến trong một trong các danh sách đen được liệt kê. RBL là một từ viết tắt cho <emphasis>Danh sách Đen Từ xa (Remote Black List)</emphasis>; có một vài danh sách như vậy, nhưng chúng đều liệt kê các máy phục vụ được cấu hình sai mà các spammer sử dụng để chuyển phát các thư điện tử của chúng, cũng như các máy chuyển phát thư điện tử không ngờ tới khác như là các máy bị nhiễm sâu máy tính hay vi-rút.

source: <primary>Remote Black List</primary>
nb_no: <primary>Fjern svarteliste</primary>
vi_vn: <primary>Danh sách Đen Từ xa</primary>

source: <emphasis>TIP</emphasis> White list and RBLs
nb_no: <emphasis>TIPS</emphasis> Hviteliste og RBL-er
vi_vn: <emphasis>Thông tin thêm</emphasis> Danh sách trắng và RBLs

source: Blacklists sometimes include a legitimate server that has been suffering an incident. In these situations, all emails coming from one of these servers would be rejected unless the server is listed in a whitelist defined by <filename>/etc/postfix/access_clientip</filename>.
nb_no: Svartelister omfatter noen ganger en legitim tjener som har vært offer for en hendelse. I slike situasjoner vil alle e-poster som kommer fra en av disse tjenerne bli avvist dersom tjeneren er oppført i en hviteliste definert av <filename>/etc/postfix/access_clientip</filename>.
vi_vn: Các danh sách đen thỉnh thoảng bao gồm một máy phục vụ hợp pháp vừa mới trải qua một tai nạn. Trong những trường hợp như thế này, tất cả những thư điện tử đến từ một trong những máy phục vụ như thế sẽ bị từ chối trừ khi máy phục vụ đó được liệt kê trong danh sách trắng trong <filename>/etc/postfix/access_clientip</filename>.

source: Prudence therefore recommends including in the whitelist all the trusted servers from which many emails are usually received.
nb_no: Ut fra forsiktighetshensyn anbefales derfor å hviteliste alle klarerte tjenere som mange e-poster vanligvis kommer fra.
vi_vn: Để tránh hậu họa về sau, danh sách trắng được khuyến cáo nên bao gồm tất cả những máy phục vụ tin tưởng được mà từ đó nhiều thư điện tử thường xuyên được nhận.

source: Checking the Validity of the <literal>EHLO</literal> or <literal>HELO</literal> Commands
nb_no: Sjekke validiteten til <literal>EHLO</literal> eller <literal>HELO</literal>-kommandoer
vi_vn: Kiểm tra Sự hợp lệ của các lệnh <literal>EHLO</literal> hay <literal>HELO</literal>

source: Each SMTP exchange starts with a <literal>HELO</literal> (or <literal>EHLO</literal>) command, followed by the name of the sending email server; checking the validity of this name can be interesting.
nb_no: Hver SMTP-utveksling starter med en <literal>HELO</literal> (eller <literal>EHLO</literal>)-kommando, etterfulgt av navnet på e-posttjeneren som sender; det kan være interessant å kontrollere gyldigheten av dette navnet.
vi_vn: Mỗi giao tiếp SMTP bắt đầu bằng một lệnh <literal>HELO</literal> (hoặc <literal>EHLO</literal>), theo sau bởi tên của một máy phục vụ thư điện tử gửi tới; kiểm tra sự hợp lệ của tên này có thể thú vị.

source: Restrictions on the name announced in <literal>EHLO</literal>
nb_no: Restriksjoner på navnet som er meldt i <literal>EHLO</literal>
vi_vn: Giới hạn về tên được công bố trong <literal>EHLO</literal>

source: The first <literal>permit_mynetworks</literal> directive allows all machines on the local network to introduce themselves freely. This is important, because some email programs do not respect this part of the SMTP protocol adequately enough, and they can introduce themselves with nonsensical names.
nb_no: Det første <literal>permit_mynetworks</literal>-direktivet tillater alle maskiner på det lokale nettverket fritt å legge seg til. Dette er viktig, fordi noen e-postprogrammer ikke respekterer denne delen av SMTP-protokollen godt nok, og de kan legge seg til med meningsløse navn.
vi_vn: Chỉ thị đầu tiên <literal>permit_mynetworks</literal> cho phép tất cả các máy tính trên mạng nội bộ được tự giới thiệu một cách thoải mái. Đó là điều quan trọng, bởi vì một vài chương trình thư điện tử không tôn trọng phần này của nghi thức SMTP một cách đủ nghiêm túc, và họ có thể tự trình diện với những tên không hợp lệ.

source: The <literal>reject_invalid_hostname</literal> rule rejects emails when the <literal>EHLO</literal> announce lists a syntactically incorrect hostname. The <literal>reject_non_fqdn_hostname</literal> rule rejects messages when the announced hostname is not a fully-qualified domain name (including a domain name as well as a host name). The <literal>reject_unknown_hostname</literal> rule rejects messages if the announced name does not exist in the DNS. Since this last rule unfortunately leads to too many rejections, the administrators turned its effect to a simple warning with the <literal>warn_if_reject</literal> modifier as a first step; they may decide to remove this modifier at a later stage, after auditing the results of this rule.
nb_no: Regelen <literal>reject_invalid_hostname</literal> avviser e-poster når <literal>EHLO</literal>-visningen lister et vertsnavn med feilaktig syntaks. Regelen <literal>reject_non_fqdn_hostname</literal> avviser meldinger når annonserte vertsnavn ikke er et fullt kvalifisert domenenavn (inkludert et domenenavn så vel som et vertsnavn). Regelen <literal>reject_unknown_hostname</literal> avviser meldinger hvis det annonserte navnet ikke finnes i DNS. Siden denne siste regelen dessverre fører til altfor mange avslag, snudde administratorene denne virkningen med en enkel advarsel ved hjelp av <literal>warn_if_reject</literal>-modifikatoren som et første skritt; de kan fjerne denne modifikatoren på et senere tidspunkt, etter å ha gjennomgått resultatene av å bruke regelen.
vi_vn: Quy tắc <literal>reject_invalid_hostname</literal> từ chối những thư điện tử khi <literal>EHLO</literal> công bố cho các danh sách một tên máy tính sai cú pháp. Quy tắc <literal>reject_non_fqdn_hostname</literal> từ chối những thông điệp khi tên máy tính được công bố không phải là một tên miền hoàn toàn đầy đủ và hợp lệ (bao gồm một tên miền và và một tên máy). Quy tắc <literal>reject_unknown_hostname</literal> từ chối những thông điệp nếu tên được công bố không tồn tại trong dns. Vì quy tắc cuối này không may dẫn đến quá nhiều sự từ chối, các nhà quản trị hệ thống thay hệ quả của nó bằng một cảnh báo đơn giản với tiền tố này <literal>warn_if_reject</literal> như là bước đầu tiên; họ có thể quyết định xóa bỏ tiền tố này ở các bước sau đó sau khi theo dõi những những kết quả của quy tắc này.

source: Using <literal>permit_mynetworks</literal> as the first rule has an interesting side effect: the following rules only apply to hosts outside the local network. This allows blacklisting all hosts that announce themselves as part of the <literal>falcot.com</literal>, for instance by adding a <literal>falcot.com REJECT You are not in our network!</literal> line to the <filename>/etc/postfix/access_helo</filename> file.
nb_no: Å bruke <literal>permit_mynetworks</literal> som den første regelen har en interessant bieffekt: De følgende regler gjelder kun verter utenfor det lokale nettverket. Dette tillater svartelisting av alle verter som varsler seg selv som en del av <literal>falcot.com</literal>, for eksempel for å legge til en <literal>falcot.com REJECT You are not in our network!</literal>-linje til <filename>/etc/postfix/access_helo</filename>-filen.
vi_vn: Sử dụng <literal>permit_mynetworks</literal> như là quy tắc đầu tiên có một tác dụng phụ thú vị: những quy tắc đứng phía sau chỉ chỉ áp dụng được với những máy tính nằm ngoài mạng nội bộ. Điều này cho phép đưa vào danh sách đen tất cả những máy tính công bố với bên ngoài rằng chúng là một phần của <literal>falcot.com</literal>, ví dụ như bằng cách thêm dòng <literal>falcot.com REJECT You are not in our network!</literal> vào tập tin <filename>/etc/postfix/access_helo</filename>.

source: Accepting or Refusing Based on the Announced Sender
nb_no: Godta eller nekte basert på annonsert avsender
vi_vn: Chấp nhận hoặc Từ chối dựa trên Người gửi Được công bố

source: Every message has a sender, announced by the <literal>MAIL FROM</literal> command of the SMTP protocol; again, this information can be validated in several different ways.
nb_no: Hver melding har en avsender, annonsert av <literal>MAIL FROM</literal>-kommandoen fra SMTP-protokollen; igjen, denne informasjonen kan bli validert på flere forskjellige måter.
vi_vn: Mỗi tin nhắn đều có một người gửi, được thông báo bởi lệnh <literal>MAIL FROM</literal> của giao thức SMTP; một lần nữa, thông tin này có thể được kiểm tra bằng nhiều cách.

source: <primary>email</primary><secondary>filtering on the sender</secondary>
nb_no: <primary>e-post (email)</primary><secondary>filtrer etter avsender</secondary>
vi_vn: <primary>email</primary><secondary>lọc dựa trên người gửi</secondary>

source: Sender checks
nb_no: Sjekking av sender
vi_vn: Kiểm tra dựa trên người gửi

source: The <filename>/etc/postfix/access_sender</filename> table maps some special treatment to some senders. This usually means listing some senders into a white list or a black list.
nb_no: Tabellen <filename>/etc/postfix/access_sender</filename> gir en noe spesiell behandling for noen avsendere. Dette betyr vanligvis å liste noen av avsenderne i en hviteliste eller en svarteliste.
vi_vn: Bảng <filename>/etc/postfix/access_sender</filename> ánh xạ một số cách xử lý đặc biệt với một số người gửi.

source: The <literal>reject_unknown_sender_domain</literal> rule requires a valid sender domain, since it is needed for a valid address. The <literal>reject_unlisted_sender</literal> rule rejects local senders if the address does not exist; this prevents emails from being sent from an invalid address in the <literal>falcot.com</literal> domain, and messages emanating from <literal>joe.bloggs@falcot.com</literal> are only accepted if such an address really exists.
nb_no: Regelen <literal>reject_unknown_sender_domain</literal> krever et gyldig avsenderdomene, siden det er nødvendig for en gyldig adresse. Regelen <literal>reject_unlisted_sender</literal> avviser lokale sendere hvis adressen ikke eksisterer; dette forhindrer e-poster å blir sendt fra en ugyldig adresse i <literal>falcot.com</literal>-domenet, og meldinger som skriver seg fra <literal>joe.bloggs@falcot.com</literal> aksepteres kun dersom en slik adresse virkelig eksisterer.
vi_vn: Quy tắc <literal>reject_unknown_sender_domain</literal> buộc phải có một miền người gửi hợp lệ, bởi vì điều đó là cần thiết cho một điạ chỉ hợp lệ. Quy tắc <literal>reject_unlisted_sender</literal> từ chối những người gửi nội bộ nếu địa chỉ đó không tồn tại; điều này chống các thư điện tử khỏi việc bị gửi từ một địa chỉ không hợp lệ trong miền <literal>falcot.com</literal>, và những thông điệp xuất phát từ <literal>joe.bloggs@falcot.com</literal> chỉ được nhận nếu địa chỉ đó thực sự tồn tại.

source: Finally, the <literal>reject_non_fqdn_sender</literal> rule rejects emails purporting to come from addresses without a fully-qualified domain name. In practice, this means rejecting emails coming from <literal>user@machine</literal>: the address must be announced as either <literal>user@machine.example.com</literal> or <literal>user@example.com</literal>.
nb_no: Til slutt, <literal>reject_non_fqdn_sender</literal>-regelen avviser e-post som angivelig kommer fra adresser uten et fullt kvalifisert domenenavn. I praksis betyr dette å avvise e-postmeldinger som kommer fra <literal>user@machine</literal>: Adressen må bli annonsert som enten <literal>user@machine.example.com</literal>, eller <literal>user@example.com</literal>.
vi_vn: Cuối cùng, quy tắc <literal>reject_non_fqdn_sender</literal> từ chối những thư điện tử tự cho là xuất phát từ những địa chỉ không có một tên miền đầy đủ và hợp lệ. Trên thực tế, điều này đồng nghĩa với việc từ chối những thư điện tử đến từ <literal>user@machine</literal>: địa chỉ phải được công bố nh�� <literal>user@machine.example.com</literal> hay <literal>user@example.com</literal>.
