Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: ; the server where everything will run server1 IN A 198.51.100.19 server1 IN AAAA 2001:DB8:1000:2000::19 ; IPv4 only for TURN for now, some clients are buggy with IPv6 turn-server IN A 198.51.100.19 ; IPv4 and IPv6 addresses for SIP sip-proxy IN A 198.51.100.19 sip-proxy IN AAAA 2001:DB8:1000:2000::19 ; IPv4 and IPv6 addresses for XMPP xmpp-gw IN A 198.51.100.19 xmpp-gw IN AAAA 2001:DB8:1000:2000::19 ; DNS SRV and NAPTR for STUN / TURN _stun._udp IN SRV 0 1 3467 turn-server.falcot.com. _turn._udp IN SRV 0 1 3467 turn-server.falcot.com. @ IN NAPTR 10 0 "s" "RELAY:turn.udp" "" _turn._udp.falcot.com. ; DNS SRV and NAPTR records for SIP _sips._tcp IN SRV 0 1 5061 sip-proxy.falcot.com. @ IN NAPTR 10 0 "s" "SIPS+D2T" "" _sips._tcp.falcot.com. ; DNS SRV records for XMPP Server and Client modes: _xmpp-client._tcp IN SRV 5 0 5222 xmpp-gw.falcot.com. _xmpp-server._tcp IN SRV 5 0 5269 xmpp-gw.falcot.com.
vi_vn: ; máy phục vụ nơi mà mọi thứ sẽ chạy server1 IN A 198.51.100.19 server1 IN AAAA 2001:DB8:1000:2000::19 ; hiện thời chỉ có IPv4 cho TURN, một số chương trình khách có nhiều lỗi với IPv6 turn-server IN A 198.51.100.19 ; Các địa chỉ IPv4 và IPv6 cho SIP sip-proxy IN A 198.51.100.19 sip-proxy IN AAAA 2001:DB8:1000:2000::19 ; Các địa chỉ IPv4 và IPv6 cho XMPP xmpp-gw IN A 198.51.100.19 xmpp-gw IN AAAA 2001:DB8:1000:2000::19 ; DNS SRV và NAPTR cho STUN / TURN _stun._udp IN SRV 0 1 3467 turn-server.falcot.com. _turn._udp IN SRV 0 1 3467 turn-server.falcot.com. @ IN NAPTR 10 0 "s" "RELAY:turn.udp" "" _turn._udp.falcot.com. ; Các mẩu tin DNS SRV và NAPTR cho SIP _sips._tcp IN SRV 0 1 5061 sip-proxy.falcot.com. @ IN NAPTR 10 0 "s" "SIPS+D2T" "" _sips._tcp.falcot.com. ; Các mẩu tin DNS SRV cho chế độ máy phục vụ và chế độ chương trình khách XMPP: _xmpp-client._tcp IN SRV 5 0 5222 xmpp-gw.falcot.com. _xmpp-server._tcp IN SRV 5 0 5269 xmpp-gw.falcot.com.

source: TURN Server
nb_no: TURN-tjener
vi_vn: Máy phục vụ TURN

source: TURN is a service that helps clients behind NAT routers and firewalls to discover the most efficient way to communicate with other clients and to relay the media streams if no direct media path can be found. It is highly recommended that the TURN server is installed before any of the other RTC services are offered to end users.
nb_no: TURN er en tjeneste som hjelper klientene bak NAT-rutere og brannmurer med å finne den mest effektive måten å kommunisere med andre klienter på, og for å formidle mediestrømmer hvis ingen direkte mediabane blir funnet. Det anbefales sterkt at TURN-tjeneren installeres før noen av de andre RTC-tjenestene tilbys til sluttbrukere.
vi_vn: TURN là một dịch vụ giúp các chương trình khách phía sau các router NAT và tường lửa tìm được cách hiệu quả nhất để giao tiếp với các chương trình khách khác và để chuyển phát các luồng thông tin nếu không có đường đi trực tiếp cho các thông tin đó. Máy phục vụ TURN được khuyến cáo cài đặt trước khi bất kỳ một trong các dịch vụ RTC khác được cung cấp cho các người dùng cuối.

source: TURN and the related ICE protocol are open standards. To benefit from these protocols, maximizing connectivity and minimizing user frustration, it is important to ensure that all client software supports ICE and TURN.
nb_no: TURN og den tilhørende ICE-protokollen er åpne standarder. For å dra nytte av disse protokollene, maksimere tilkoblingsmuligheter, og minimere brukerfrustrasjon, er det viktig å sikre at alle klientprogramvarene støtter ICE og TURN.
vi_vn: TURN và giao thức ICE liên quan là các tiêu chuẩn mở. Để có lợi được từ những giao thức này, nghĩa là tối đa hóa đường kết nối và giảm thiểu sự phiền phức cho người sử dụng, việc đảm bảo rằng các chương trình khách hỗ trợ ICE và TURN là rất quan trọng.

source: For the ICE algorithm to work effectively, the server must have two public IPv4 addresses.
nb_no: For å få ICE-algoritmene til å fungere effektivt må tjeneren ha to offentlige IPv4-adresser.
vi_vn: Để thuật toán ICE hoạt động hiệu quả, máy phục vụ phải có hai địa chỉ công cộng IPv4.

source: Install the TURN server
nb_no: Å installere TURN-tjeneren
vi_vn: Cài đặt máy phục vụ TURN

source: Install the <emphasis role="pkg">resiprocate-turn-server</emphasis> package.
nb_no: Å installere <emphasis role="pkg">resiprocate-turn-server</emphasis>-pakken.
vi_vn: Cài đặt gói phần mềm <emphasis role="pkg">resiprocate-turn-server</emphasis>.

source: Edit the <filename>/etc/reTurn/reTurnServer.config</filename> configuration file. The most important thing to do is insert the IP addresses of the server.
nb_no: Rediger konfigurasjonsfilen <filename>/etc/reTurn/reTurnServer.config</filename>. Det viktigste er å sette inn IP-adressene til tjeneren.
vi_vn: Chỉnh sửa tập tin cấu hình <filename>/etc/reTurn/reTurnServer.config</filename>. Điều quan trọng nhất là chèn vào đó các địa chỉ IP của máy phục vụ.

source: # your IP addresses go here: TurnAddress = 198.51.100.19 TurnV6Address = 2001:DB8:1000:2000::19 AltStunAddress = 198.51.100.20 # your domain goes here, it must match the value used # to hash your passwords if they are already hashed # using the HA1 algorithm: AuthenticationRealm = myrealm UserDatabaseFile = /etc/reTurn/users.txt UserDatabaseHashedPasswords = true
vi_vn: # các địa chỉ IP của bạn đặt vào đây: TurnAddress = 198.51.100.19 TurnV6Address = 2001:DB8:1000:2000::19 AltStunAddress = 198.51.100.20 # miền máy tính của bạn đặt vào đây, nó phải khớp với giá trị được sử dụng # để mã hóa các mật mã của bạn nếu chúng đã được mã hóa # bằng thuật toán HA1: AuthenticationRealm = myrealm UserDatabaseFile = /etc/reTurn/users.txt UserDatabaseHashedPasswords = true

source: Restart the service.
nb_no: Restart tjenesten.
vi_vn: Khởi động lại dịch vụ này

source: Managing the TURN users
nb_no: Å håndtere TURN-brukerne
vi_vn: Quản lý các người sử dụng TURN

source: Use the htdigest utility to manage the TURN server user list.
nb_no: Bruk htdigest-verktøyet for å håndtere TURN-tjenestens brukerliste.
vi_vn: Sử dụng công cụ htdigest để quản lý danh sách người sử dụng của máy phục vụ TURN

source: Use the HUP signal to make the server reload the <filename>/etc/reTurn/users.txt</filename> file after changing it or enable the automatic reload feature in <filename>/etc/reTurn/reTurnServer.config</filename>.
nb_no: Å bruke HUP-signalet til å få tjeneren til å laste <filename>/etc/reTurn/users.txt</filename>-filen på nytt etter å ha endret den, eller aktivere den automatiske gjenopplastingsfunksjonen i <filename>/etc/reTurn/reTurnServer.config</filename>.
vi_vn: Sử dụng tín hiệu HUP để buộc máy phục vụ tự cập nhật tập tin <filename>/etc/reTurn/users.txt</filename> sau khi chỉnh sửa nó hoặc kích hoạt tính năng tự động cập nhật trong <filename>/etc/reTurn/reTurnServer.config</filename>.

source: SIP Proxy Server
nb_no: SIP-mellomtjener
vi_vn: Máy phục vụ Trạm Chuyển hướng SIP

source: A SIP proxy server manages the incoming and outgoing SIP connections between other organizations, SIP trunking providers, SIP PBXes such as Asterisk, SIP phones, SIP-based softphones and WebRTC applications.
nb_no: En SIP-mellomtjener håndterer innkommende og utgående SIP-forbindelser mellom andre organisasjoner, SIP-kanalleverandører, SIP PBXer som Asterisk, SIP-telefoner, SIP-baserte PC-telefoner og WebRTC-applikasjoner.
vi_vn: Máy phục vụ trạm chuyển hướng SIP quản lý các kết nối SIP đến và đi giữa các tổ chức, các nhà cung cấp dịch vụ thoại và truyền tải đa phương tiện trên SIP, các chi nhánh giao dịch tư nhân SIP (SIP PBX) như là Asterisk, các điện thoại chạy trên SIP, các chương trình gọi điện thoại dựa trên SIP và các chương trình WebRTC.

source: <primary>SIP</primary><secondary>server</secondary>
vi_vn: <primary>SIP</primary><secondary>máy phục vụ</secondary>

source: <primary>SIP</primary><secondary>proxy</secondary>
vi_vn: <primary>SIP</primary><secondary>trạm chuyển phát</secondary>

source: <primary>SIP</primary><secondary>PBX</secondary>
vi_vn: <primary>SIP</primary><secondary>Nhánh Giao dịch Tư nhân(PBX)</secondary>

source: It is strongly recommended to install and configure the SIP proxy before attempting a SIP PBX setup. The SIP proxy normalizes a lot of the traffic reaching the PBX and provides greater connectivity and resilience.
nb_no: Det anbefales sterkt å installere og konfigurere SIP-mellomtjener før du prøver et SIP PBX-oppsett. SIP-mellomtjeneren normaliserer mye av trafikken som når PBX, og gir større tilkoblingsmuligheter og elastisitet.
vi_vn: Việc cài đặt và cấu hình trạm chuyển phát SIP trước khi tiến hành thử cài đặt một SIP PBX rất được khuyến cáo. Trạm chuyển phát SIP rải đều lượng tải thông tin đến PBX và cung cấp đường truyền tốt hơn và khả năng phục hồi tốt hơn.

source: Install the SIP proxy
nb_no: Å installere SIP-mellomtjener
vi_vn: Cài đặt một trạm chuyển phát SIP

source: Install the <emphasis role="pkg">repro</emphasis> package. Using the package from <emphasis role="distribution">jessie-backports</emphasis> is highly recommended, as it has the latest improvements for maximizing connectivity and resilience.
nb_no: Å installere <emphasis role="pkg">repro</emphasis>-pakken. Å bruke pakken fra <emphasis role="distribution">jessie-backports</emphasis> er sterkt anbefalt, ettersom den har de nyeste forbedringene for å maksimere tilkoblingsmuligheter og elastisitet.
vi_vn: Cài đặt gói phần mềm <emphasis role="pkg">repro</emphasis>. Sử dụng gói phần mềm <emphasis role="distribution">jessie-backports</emphasis> rất được khuyến cáo, bởi nó có những tiến bộ mới nhất để tối đa hóa khả năng kết nối và khả năng phục hồi khi gặp sự cố.

source: Edit the <filename>/etc/repro/repro.config</filename> configuration file. The most important thing to do is insert the IP addresses of the server. The example below demonstrates how to setup both regular SIP and WebSockets/WebRTC, using TLS, IPv4 and IPv6:
nb_no: Å redigere <filename>/etc/repro/repro.config</filename>-oppsettsfilen. Det viktigste å gjøre er å sette inn IP-adressene til tjeneren. Eksempelet nedenfor viser hvordan du setter opp både vanlig SIP og WebSockets/WebRTC, ved hjelp av TLS, IPv4 og IPv6:
vi_vn: Chỉnh sửa tập tin cấu hình <filename>/etc/repro/repro.config</filename>. Điều quan trọng nhất để làm là chèn vào đó những địa chỉ IP của máy phục vụ. Ví dụ dưới đây trình bày cách để cài đặt một SIP bình thường và các Websocket/WebRTC, sử dụng TLS, IPv4 và IPv6.

source: # Transport1 will be for SIP over TLS connections # We use port 5061 here but if you have clients connecting from # locations with firewalls you could change this to listen on port 443 Transport1Interface = 198.51.100.19:5061 Transport1Type = TLS Transport1TlsDomain = falcot.com Transport1TlsClientVerification = Optional Transport1RecordRouteUri = sip:falcot.com;transport=TLS Transport1TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport1TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport2 is the IPv6 version of Transport1 Transport2Interface = 2001:DB8:1000:2000::19:5061 Transport2Type = TLS Transport2TlsDomain = falcot.com Transport2TlsClientVerification = Optional Transport2RecordRouteUri = sip:falcot.com;transport=TLS Transport2TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport2TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport3 will be for SIP over WebSocket (WebRTC) connections # We use port 8443 here but you could use 443 instead Transport3Interface = 198.51.100.19:8443 Transport3Type = WSS Transport3TlsDomain = falcot.com # This would require the browser to send a certificate, but browsers # don't currently appear to be able to, so leave it as None: Transport3TlsClientVerification = None Transport3RecordRouteUri = sip:falcot.com;transport=WSS Transport3TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport3TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport4 is the IPv6 version of Transport3 Transport4Interface = 2001:DB8:1000:2000::19:8443 Transport4Type = WSS Transport4TlsDomain = falcot.com Transport4TlsClientVerification = None Transport4RecordRouteUri = sip:falcot.com;transport=WSS Transport4TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport4TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport5: this could be for TCP connections to an Asterisk server # in your internal network. Don't allow port 5060 through the external # firewall. Transport5Interface = 198.51.100.19:5060 Transport5Type = TCP Transport5RecordRouteUri = sip:198.51.100.19:5060;transport=TCP HttpBindAddress = 198.51.100.19, 2001:DB8:1000:2000::19 HttpAdminUserFile = /etc/repro/users.txt RecordRouteUri = sip:falcot.com;transport=tls ForceRecordRouting = true EnumSuffixes = e164.arpa, sip5060.net, e164.org DisableOutbound = false EnableFlowTokens = true EnableCertificateAuthenticator = True
vi_vn: # Transport1 sẽ được dành cho SIP trên các kết nối TLS # Chúng ta sử dụng cổng 5061 ở đây nhưng nếu bạn có các chương trình khách kết nối từ # các địa điểm có kèm tường lửa bạn có thể thay đổi điều này để lắng nghe trên cổng 443 Transport1Interface = 198.51.100.19:5061 Transport1Type = TLS Transport1TlsDomain = falcot.com Transport1TlsClientVerification = Optional Transport1RecordRouteUri = sip:falcot.com;transport=TLS Transport1TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport1TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport2 là phiên bản IPv6 của Transport1 Transport2Interface = 2001:DB8:1000:2000::19:5061 Transport2Type = TLS Transport2TlsDomain = falcot.com Transport2TlsClientVerification = Optional Transport2RecordRouteUri = sip:falcot.com;transport=TLS Transport2TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport2TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport3 sẽ được dành cho SIP trên các kết nối WebSocket (WebRTC) # Chúng ta sử dụng cổng 8443 ở đây nhưng bạn có thể sử dụng cổng 443 Transport3Interface = 198.51.100.19:8443 Transport3Type = WSS Transport3TlsDomain = falcot.com # Điều này sẽ buộc phải có một trình duyệt để gửi một chứng chỉ, nhưng các trình duyệt # hiện tại có vẻ không thể làm được điều đó, nên hãy đặt giá trị là None: Transport3TlsClientVerification = None Transport3RecordRouteUri = sip:falcot.com;transport=WSS Transport3TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport3TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport 4 là phiên bản IPv6 của Transport3 Transport4Interface = 2001:DB8:1000:2000::19:8443 Transport4Type = WSS Transport4TlsDomain = falcot.com Transport4TlsClientVerification = None Transport4RecordRouteUri = sip:falcot.com;transport=WSS Transport4TlsPrivateKey = /etc/ssl/private/falcot.com-key.pem Transport4TlsCertificate = /etc/ssl/public/falcot.com.pem # Transport5: cái này có thể dành cho các kết nối TCP đến một máy phục vụ Asterisk # trong mạng nội bộ của bạn. Không cho phép cổng 5060 qua tường lửa # bên ngoài. Transport5Interface = 198.51.100.19:5060 Transport5Type = TCP Transport5RecordRouteUri = sip:198.51.100.19:5060;transport=TCP HttpBindAddress = 198.51.100.19, 2001:DB8:1000:2000::19 HttpAdminUserFile = /etc/repro/users.txt RecordRouteUri = sip:falcot.com;transport=tls ForceRecordRouting = true EnumSuffixes = e164.arpa, sip5060.net, e164.org DisableOutbound = false EnableFlowTokens = true EnableCertificateAuthenticator = True

source: Use the <command>htdigest</command> utility to manage the admin password for the web interface. The username must be <emphasis>admin</emphasis> and the realm name must match the value specified in <filename>repro.config</filename>.
nb_no: Å bruke <command>htdigest</command>-verktøyet for å administrere admin-passordet for nettgrensesnittet. Brukernavnet må være <emphasis>admin</emphasis>, og områdenavnet må samsvare med verdien som er angitt i <filename>repro.config</filename>.
vi_vn: Sử dụng tiện ích <command>htdigest</command> để quản lý mật mã quản trị cho giao diện web. Tên người dùng phải là <emphasis>admin</emphasis> và tên realm phải khớp với giá trị được chỉ ra trong <filename>repro.config</filename>.

source: Restart the service to use the new configuration.
nb_no: Å restarte tjenesten for å bruke den nye konfigurasjonen.
vi_vn: Khởi động lại dịch vụ để sử dụng cấu hình mới.

source: Managing the SIP proxy
nb_no: Å håndtere SIP-mellomtjeneren
vi_vn: Quản lý trạm chuyển phát SIP

source: Go to the web interface at <literal>http://sip-proxy.falcot.com:5080</literal> to complete the configuration by adding domains, local users and static routes.
nb_no: Gå til nettgrensesnittet på <literal>http://sip-proxy.falcot.com:5080</literal> for å fullføre oppsettet ved å legge til domener, lokale brukere og statiske ruter.
vi_vn: Chuyển đến giao diện web tại <literal>http://sip-proxy.falcot.com:5080</literal> để hoàn tất cấu hình bằng việc thêm các miền máy tính, các người dùng nội bộ và các định tuyến tĩnh(static routes).

source: The first step is to add the local domain. The process must be restarted after adding or removing domains from the list.
nb_no: Det første trinnet er å legge til det lokale domenet. Prosessen må startes på nytt etter å ha lagt til, eller fjernet, domener fra listen.
vi_vn: Bước đầu tiên là th��m một miền máy tính nội bộ. Tiến trình phải được khởi động lại sau khi thêm hoặc bỏ đi những miền máy tính khỏi danh sách này.

source: The proxy knows how to route calls between local users and full SIP address, the routing configuration is only necessary for overriding default behavior, for example, to recognize phone numbers, add a prefix and route them to a SIP provider.
vi_vn: Trạm chuyển phát biết cách để định tuyến các cuộc gọi giữa các người sử dụng nội bộ và địa chỉ SIP đầy đủ, cấu hình định tuyến này chỉ thực sự cần thiết để từ chối (override) hành vi ngầm định, ví dụ, để nhận dạng các số điện thoại và thêm một tiền tố và định tuyến nó đến một nhà cung cấp SIP.

source: XMPP Server
nb_no: XMPP-tjener
vi_vn: Máy phục vụ XMPP

source: An XMPP server manages connectivity between local XMPP users and XMPP users in other domains on the public Internet.
nb_no: En XMPP-tjener håndterer tilkobling mellom lokale XMPP-brukere og XMPP-brukere i andre domener på det offentlige Internettet.
vi_vn: Một máy phục vụ XMPP quản lý kết nối giữa các người sử dụng XMPP nội bộ và những người sử dụng XMPP ở những miền máy tính khác trên mạng Internet công cộng.

source: <primary>XMPP</primary><secondary>server</secondary>
vi_vn: <primary>XMPP</primary><secondary>máy phục vụ</secondary>

source: <emphasis>VOCABULARY</emphasis> XMPP or Jabber?
nb_no: <emphasis>ORDFORRÅD</emphasis> XMPP eller Jabber?
vi_vn: <emphasis>TỪ VỰNG</emphasis> XMPP hay Jabber?

source: XMPP is sometimes referred to as Jabber. In fact, Jabber is a trademark and XMPP is the official name of the standard.
nb_no: XMPP er noen ganger referert til som Jabber. Faktisk er Jabber et varemerke, og XMPP er det offisielle navnet på standarden.
vi_vn: XMPP thỉnh thoảng được biết tới như là Jabber. Thực ra, Jabber là một thương hiệu và XMPP là tên chính thức của một tiêu chuẩn.

source: Prosody is a popular XMPP server that operates reliably on Debian servers.
nb_no: Prosodi er en populær XMPP-tjener som opererer pålitelig på Debian-tjenere.
vi_vn: Prosody là một máy phục vụ XMPP vốn hoạt động ổn định trên các máy phục vụ Debian.

source: Install the XMPP server
nb_no: Å installere XMPP-tjener
vi_vn: Cài đặt máy phục vụ XMPP

source: Install the <emphasis role="pkg">prosody</emphasis> package. Using the package from <emphasis role="distribution">jessie-backports</emphasis> is highly recommended, as it has the latest improvements for maximizing connectivity and resilience.
nb_no: Installer <emphasis role="pkg">prosody</emphasis>-pakken. Å bruke pakken fra <emphasis role="distribution">jessie-backports</emphasis> er sterkt anbefalt, ettersom den har de nyeste forbedringene for å maksimere tilkoblingsmuligheter og elastisitet.
vi_vn: Cài đặt gói phần mềm <emphasis role="pkg">prosody</emphasis>. Sử dụng gói phần mềm này từ <emphasis role="distribution">jessie-backports</emphasis> là rất được khuyến cáo, bởi nó có những tiến bộ mới nhất để tối đa hóa kết nối và khả năng phục hồi khi gặp sự cố.

source: Review the <filename>/etc/prosody/prosody.cfg.lua</filename> configuration file. The most important thing to do is insert JIDs of the users who are permitted to manage the server.
nb_no: Gjennomgå <filename>/etc/prosody/prosody.cfg.lua</filename>-konfigureringsfilen. Det viktigste å gjøre er å sette inn JISs til brukerne som har tillatelse til å håndtere tjeneren.
vi_vn: Xem tập tin cấu hình <filename>/etc/prosody/prosody.cfg.lua</filename>. Điều quan trọng nhất để làm là chèn những JID của những người sử dụng được cho phép quản lý máy phục vụ.

source: An individual configuration file is also needed for each domain. Copy the sample from <filename>/etc/prosody/conf.avail/example.com.cfg.lua</filename> and use it as a starting point. Here is <literal>falcot.com.cfg.lua</literal>:
nb_no: Et individuell konfigurasjonsfil er også nødvendig for hvert domene. Kopier eksemplet fra <filename>/etc/prosody/conf.avail/example.com.cfg.lua</filename>, og bruk det som et startpunkt. Her er <literal>falcot.com.cfg.lua</literal>:
vi_vn: Một tập tin cấu hình cũng cần thiết cho mỗi miền máy tính. Sao chép mẫu sau từ <filename>/etc/prosody/conf.avail/example.com.cfg.lua</filename> và sử dụng nó như một điểm khởi động. Đây là <literal>falcot.com.cfg.lua</literal>:

source: To enable the domain, there must be a symlink from <filename>/etc/prosody/conf.d/</filename>. Create it that way:
nb_no: For å aktivere domenet må det være en symlink fra <filename>/etc/prosody/conf.d/</filename>. Lag den på denne måten:
vi_vn: Để kích hoạt miền máy tính, phải có một đường dẫn tượng trưng (symbolic link) xuất phát từ <filename>/etc/prosody/conf.d/</filename>. Hãy tạo nó theo cách đó:

source: Managing the XMPP server
nb_no: Å håndtere XMPP-tjeneren
vi_vn: Quản lý một máy phục vụ XMPP

source: Some management operations can be performed using the <literal>prosodyctl</literal> command line utility. For example, to add the administrator account specified in <filename>/etc/prosody/prosody.cfg.lua</filename>:
nb_no: Noen håndteringsoperasjoner kan utføres ved hjelp av <literal>prosodyctl</literal>-kommandolinjeverktøyet. For eksempel, å legge til administratorkontoen som er angitt i <filename>/etc/prosody/prosody.cfg.lua</filename>:
vi_vn: Một số tác vụ quản lý có thể được thực hiện bằng tiện ích dòng lệnh <literal>prosodyctl</literal>. Ví dụ, để thêm một tài khoản quản trị viên vốn được chỉ định trong <filename>/etc/prosody/prosody.cfg.lua</filename>:

source: See the <ulink url="http://prosody.im/doc/configure"> Prosody online documentation</ulink> for more details about how to customize the configuration.
vi_vn: Xem <ulink url="http://prosody.im/doc/configure"> Tài liệu hướng dẫn trên mạng của Prosody</ulink> để biết thêm chi tiết về cách để tùy chỉnh cấu hình này.
