Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: Accepting or Refusing Based on the Recipient
nb_no: Akesept eller avvising basert på mottaker
vi_vn: Chấp nhận hoặc từ chối dựa trên người nhận

source: Each email has at least one recipient, announced with the <literal>RCPT TO</literal> command in the SMTP protocol. These addresses also warrant validation, even if that may be less relevant than the checks made on the sender address.
nb_no: Hver e-post har minst én mottaker, kunngjort med <literal>RCPT TO</literal>-kommandoen i SMTP-protokollen. Disse adressene garanterer også validering, selv om det kan være mindre relevant enn kontrollene av avsenderadressen.
vi_vn: Mỗi thư điện tử có ít nhất một người nhận, được công bố bằng lệnh <literal>RCPT TO</literal> của giao thức SMTP. Những địa chỉ này cũng đảm bảo tính hợp lệ, ngay cả khi việc kiểm tra nó ít liên quan hơn việc kiểm tra dựa trên địa chỉ người gửi.

source: <primary>email</primary><secondary>filtering on the recipient</secondary>
nb_no: <primary>e-post (email)</primary><secondary>filtrere av mottakeren</secondary>
vi_vn: <primary>email</primary><secondary>lọc dựa trên người nhận </secondary>

source: Recipient checks
nb_no: Sjekk av mottaker
vi_vn: Các kiểm tra trên người nhận

source: <literal>reject_unauth_destination</literal> is the basic rule that requires outside messages to be addressed to us; messages sent to an address not served by this server are rejected. Without this rule, a server becomes an open relay that allows spammers to send unsolicited emails; this rule is therefore mandatory, and it will be best included near the beginning of the list, so that no other rules may authorize the message before its destination has been checked.
nb_no: Regelen <literal>reject_unauth_destination</literal> er den grunnleggende regelen som krever at meldinger utenfra adresseres til oss; meldinger sendt til en adresse som ikke er betjent med denne tjeneren, blir avvist. Uten denne regelen, blir tjeneren et åpent relé som tillater spammere å sende uønsket e-post. Denne regelen er derfor obligatorisk, og den er tas best inn nær begynnelsen av listen, slik at ingen andre regler kan autorisere meldingen før destinasjonen er kontrollert.
vi_vn: <literal>reject_unauth_destination</literal> là quy tắc cơ bản vốn buộc những thông điệp bên ngoài phải được gửi đến chúng ta; những thông điệp được gửi đến một địa chỉ không được phục vụ bởi máy phục vụ này sẽ bị từ chối. Nếu không có quy tắc này, một máy phục vụ trở thành một điểm trung chuyển mở cho phép những spammer gửi các thư điện tư mà không ai yêu cầu; vì thế quy tắc này là bắt buộc, và nó nên được thêm vào ở gần cuối của danh sách, để không có quy tắc nào khác cho phép những thông điệp như thế này qua trước khi điểm đến đã được kiểm tra.

source: The <literal>reject_unlisted_recipient</literal> rule rejects messages sent to non-existing local users, which makes sense. Finally, the <literal>reject_non_fqdn_recipient</literal> rule rejects non-fully-qualified addresses; this makes it impossible to send an email to <literal>jean</literal> or <literal>jean@machine</literal>, and requires using the full address instead, such as <literal>jean@machine.falcot.com</literal> or <literal>jean@falcot.com</literal>.
nb_no: Regelen <literal>reject_unlisted_recipient</literal> avviser meldinger som sendes til ikke-eksisterende lokale brukere, noe som gir mening. Endelig avslår <literal>reject_non_fqdn_recipient</literal>-regelen ikke-fullt-kvalifiserte adresser; dette gjør det umulig å sende en e-post til <literal>jean</literal>, eller <literal>jean@machine</literal>, og krever bruk av hele adressen i stedet, som for eksempel <literal>jean@machine.falcot.com</literal>, eller <literal>jean@falcot.com</literal>.
vi_vn: Quy tắc <literal>reject_unlisted_recipient</literal> từ chối những thông điệp được gửi đến những người dùng nội bộ không có tồn tại, vốn nghe rất có lý. Cuối cùng, quy tắc <literal>reject_non_fqdn_recipient</literal> từ chối các địa chỉ không đúng chuẩn; và điều này chặn việc gửi một thư điện tử tới <literal>jean</literal> hay <literal>jean@machine</literal>, và buộc phải sử dụng địa chỉ đầy đủ, ví dụ như <literal>jean@machine.falcot.com</literal> hoặc <literal>jean@falcot.com</literal>.

source: Restrictions Associated with the <literal>DATA</literal> Command
nb_no: Restriksjoner knyttet til <literal>DATA</literal>-kommandoen
vi_vn: Những giới hạn liên quan tới lệnh <literal>DATA</literal>

source: The <literal>DATA</literal> command of SMTP is emitted before the contents of the message. It doesn't provide any information per se, apart from announcing what comes next. It can still be subjected to checks.
nb_no: <literal>DATA</literal>-kommandoen til SMTP avgis før innholdet i meldingen. Den gir ikke noen informasjon per se (av seg selv), bortsett fra annonsere hva som kommer etterpå. Den kan fortsatt være underlagt sjekk.
vi_vn: Lệnh <literal>DATA</literal> của SMTP được xuất ra trước nội dung của thông điệp. Nó không cung cấp bất kỳ thông tin nào khác, ngoài việc công bố những gì xuất hiện tiếp theo. Nó vẫn có thể bị kiểm tra.

source: <literal>DATA</literal> checks
nb_no: <literal>DATA</literal>-sjekk
vi_vn: Những lần kiểm tra <literal>DATA</literal>

source: The <literal>reject_unauth_pipelining</literal> directives causes the message to be rejected if the sending party sends a command before the reply to the previous command has been sent. This guards against a common optimization used by spammer robots, since they usually don't care a fig about replies and only focus on sending as many emails as possible in as short a time as possible.
nb_no: Direktivene <literal>reject_unauth_pipelining</literal> fører til at meldingen blir avvist hvis avsender sender en kommando før svaret på den forrige kommando er blitt sendt. Dette beskytter mot en vanlig optimalisering som brukes av spamroboter, siden de vanligvis ikke bryr seg det grann om svar, og bare fokuserer på å sende så mange e-poster som mulig på så kort tid som mulig.
vi_vn: Những chỉ thị <literal>reject_unauth_pipelining</literal> làm cho thông điệp bị từ chối nếu bên gửi gửi ra một lệnh trước khi câu trả lời cho một lệnh trước đó được gửi ra. Điều này phòng chống được một loại tối ưu hóa phổ biến được sử dụng bởi các rô-bốt spammer, bởi chúng thường không quan tâm gì về những câu trả lời và chỉ tập trung vào việc gửi càng nhiều thư điện tử càng tốt và trong thời gian ngắn nhất có thể.

source: Applying Restrictions
nb_no: Å bruke restriksjoner
vi_vn: Áp đặt những giới hạn

source: Although the above commands validate information at various stages of the SMTP exchange, Postfix only sends the actual rejection as a reply to the <literal>RCPT TO</literal> command.
nb_no: Selv om de ovennevnte kommandoene validerer informasjon på ulike stadier av SMTP-utvekslingen, sender Postfix bare selve avslaget som et svar på <literal>RCPT TO</literal>-kommandoen.
vi_vn: Mặc dù những lệnh trên đều kiểm tra tính hợp lệ của các thông tin ở nhiều giai đoạn trong một quá trình trao đổi SMTP, Postfix chỉ gửi ra những sự từ chối thực sự như là một câu trả lời cho lệnh <literal>RCPT TO</literal>.

source: This means that even if the message is rejected due to an invalid <literal>EHLO</literal> command, Postfix knows the sender and the recipient when announcing the rejection. It can then log a more explicit message than it could if the transaction had been interrupted from the start. In addition, a number of SMTP clients do not expect failures on the early SMTP commands, and these clients will be less disturbed by this late rejection.
nb_no: Dette betyr at selv om meldingen blir avvist på grunn av en ugyldig <literal>EHLO</literal>-kommando, kjenner Postfix avsenderen og mottakeren da avvisningen ble varslet. Den kan da logge et mer eksplisitt budskap enn om transaksjonen hadde blitt avbrutt fra starten. I tillegg trenger ikke en rekke SMTP-klienter å forvente feil med de tidlige SMTP-kommandoene, og disse klientene blir mindre forstyrret av dette ved denne senere avvisningen.
vi_vn: Điều này có nghĩa là thậm chí nếu thông điệp bị từ chối bởi một lệnh không hợp lệ <literal>EHLO</literal>, Postfix biết người gửi và người nhận khi công bố một sự từ chối. Nó sau đó có thể ghi lại nhật ký một thông điệp chặt chẽ hơn so với khi một giao dịch bị ngắt quãng ngay từ đầu. Hơn nữa, nhiều chương trình khách SMTP(SMTP clients) không tính trước những sự cố này sẽ xảy ra ở những lệnh SMTP đầu, và những chương trình khách này sẽ bị làm phiền bởi sự từ chối trễ này.

source: A final advantage to this choice is that the rules can accumulate information during the various stages of the SMTP exchange; this allows defining more fine-grained permissions, such as rejecting a non-local connection if it announces itself with a local sender.
nb_no: En siste fordel ved dette valget er at reglene kan akkumulere informasjon fra de ulike stadier i SMTP-utvekslingen. Dette tillater å definere mer finkornede tillatelser, som for eksempel avvise en ikke-lokal tilkobling hvis den melder seg med en lokal avsender.
vi_vn: Lợi thế cuối cùng của lựa chọn này là những quy tắc có thể tích tụ thông tin lại trong các giai đoạn của quá trình trao đổi SMTP; điều này cho phép việc định nghĩa những sự cho phép chi tiết hơn, như là việc từ chối một kết nối mạng không phải là nội bộ nếu nó tự công bố nó với một người gửi nội bộ.

source: Filtering Based on the Message Contents
nb_no: Filtrering basert på meldingsinnholdet
vi_vn: Lọc dựa trên nội dung thông điệp

source: The validation and restriction system would not be complete without a way to apply checks to the message contents. Postfix differentiates the checks applying to the email headers from those applying to the email body.
nb_no: Validerings- og begrensningssystemet ville ikke være komplett uten å kunne sjekke meldingsinnholdet. Postfix skiller mellom sjekking av topptekster i e-postene - fra den som gjelder selve meldingskroppen.
vi_vn: Hệ thống kiểm soát giới hạn và kiểm tra tính hợp lệ sẽ không thể hoàn thiện nếu thiếu một cách để áp dụng những cách kiểm tra vào nội dung của thông điệp. Postfix phân biệt giữa những cách kiểm tra vào những tiêu đề(headers) của thư điện tử và những cách kiểm tra áp dụng vào nội dung(body) thư điện tử.

source: Enabling content-based filters
nb_no: Å aktivere innholdsbaserte filtre
vi_vn: Kích hoạt các bộ lọc dựa trên nội dung

source: <primary>email</primary><secondary>filtering on contents</secondary>
nb_no: <primary>e-post (email)</primary><secondary>filtrering på innhold</secondary>
vi_vn: <primary>email</primary><secondary>Lọc dựa trên nội dung</secondary>

source: Both files contain a list of regular expressions (commonly known as <emphasis>regexps</emphasis> or <emphasis>regexes</emphasis>) and associated actions to be triggered when the email headers (or body) match the expression.
nb_no: Begge filer inneholder en liste med vanlige uttrykk (kjent som <emphasis>regexps</emphasis> eller <emphasis>regexes</emphasis>), og tilhørende tiltak som skal utløses når e-posthoder (eller kroppen) samsvarer med uttrykket.
vi_vn: Cả hai tập tin đều chứa một danh sách các thành ngữ có quy tắc(regular expressions) (thông thường được biết đến như là <emphasis>regexps</emphasis> hay <emphasis>regexes</emphasis>) và những hành động có liên quan chờ được kích hoạt khi các tiêu đề của thư điện tử (hoặc nội dung thư) ghép đúng với thành ngữ đó.

source: <emphasis>QUICK LOOK</emphasis> Regexp tables
nb_no: <emphasis>HURTIGVISNING (QUICK LOOK)</emphasis> Regexp-tabeller
vi_vn: <emphasis>SƠ BỘ</emphasis> Các bảng Regexp

source: The <filename>/usr/share/doc/postfix-doc/examples/header_checks.gz</filename> file contains many explanatory comments and can be used as a starting point for creating the <filename>/etc/postfix/header_checks</filename> and <filename>/etc/postfix/body_checks</filename> files.
nb_no: Filen <filename>/usr/share/doc/postfix-doc/examples/header_checks.gz</filename> inneholder mange forklaringer, og kan brukes som et utgangspunkt for å lage <filename>/etc/postfix/header_checks</filename> og <filename>/etc/postfix/body_checks</filename>-filer.
vi_vn: Tập tin <filename>/usr/share/doc/postfix-doc/examples/header_checks.gz</filename> chứa những ghi chú đọc là hiểu và có thể được sử dụng như nơi bắt đầu để tạo ra các tập tin <filename>/etc/postfix/header_checks</filename> và <filename>/etc/postfix/body_checks</filename>.

source: Example <filename>/etc/postfix/header_checks</filename> file
nb_no: Eksempelfil <filename>/etc/postfix/header_checks</filename>
vi_vn: Ví dụ cho tập tin <filename>/etc/postfix/header_checks</filename>

source: /^X-Mailer: GOTO Sarbacane/ REJECT I fight spam (GOTO Sarbacane) /^Subject: *Your email contains VIRUSES/ DISCARD virus notification
vi_vn: /^X-Mailer: GOTO Sarbacane/ REJECT Tôi chống lại thư rác (GOTO Sarbacane) /^Subject: *Thư của bạn chứa VI-RÚT/ DISCARD cảnh báo vi-rút

source: <emphasis>BACK TO BASICS</emphasis> Regular expression
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> Regulært utrykk
vi_vn: <emphasis>TRỞ VỀ CƠ BẢN</emphasis> Thành ngữ có quy tắc(Regular expression)

source: The <emphasis>regular expression</emphasis> term (shortened to <emphasis>regexp</emphasis> or <emphasis>regex</emphasis>) references a generic notation for expressing a description of the contents and/or structure of a string of characters. Certain special characters allow defining alternatives (for instance, <literal>foo|bar</literal> matches either “foo” or “bar”), sets of allowed characters (for instance, <literal>[0-9]</literal> means any digit, and <literal>.</literal> — a dot — means any character), quantifications (<literal>s?</literal> matches either <literal>s</literal> or the empty string, in other words 0 or 1 occurrence of <literal>s</literal>; <literal>s+</literal> matches one or more consecutive <literal>s</literal> characters; and so on). Parentheses allow grouping search results.
nb_no: Betegnelsen <emphasis>regulært utrykk </emphasis> (forkortet til <emphasis>regexp</emphasis>, eller <emphasis>regex</emphasis>) refererer til et felles tegnsystem for å gi en beskrivelse av innholdet og/eller strukturen til en streng med tegn. Visse spesialtegn tillater å definere alternativer (for eksempel <literal>foo|bar</literal> samsvarer med enten «foo» eller «bar»), setter tillate tegn (for eksempel betyr, <literal>[0-9]</literal> hvilket som helst tall, og <literal>.</literal> - et punktum - betyr hvilket som helst tegn), kvantifiseringer (<literal>s?</literal> samsvarer enten med <literal>s</literal>, eller den tomme strengen, med andre ord 0 eller 1 forekomsten av <literal>s</literal>; <literal>s+</literal> samsvarer med en eller flere påfølgende <literal>s</literal> tegn; og så videre). Parenteser tillater gruppering av søkeresultater.
vi_vn: Cụm từ <emphasis>thành ngữ có quy tắc(regular expression)</emphasis> (viết tắt là <emphasis>regexp</emphasis> hoặc <emphasis>regex</emphasis>) sử dụng một cách viết chung để biểu thị một mô tả của những nội dung và/hoặc cấu trúc của một chuỗi của các ký tự. Một vài ký tự đặc biệt cho phép việc định nghĩa các lựa chọn khác (ví dụ, <literal>foo|bar</literal> sẽ bắt(matches) “foo“ hoặc “bar“), những tập hợp của các ký tự cho phép (ví dụ như <literal>[0-9]</literal> nghĩa là bất kỳ chữ số nào, và <literal>.</literal> — một dấu chấm — nghĩa là bất kỳ ký tự nào), số lượng (<literal>s?</literal> bắt <literal>s</literal> hoặc một chuỗi ký tự trống, nói cách khác 0 hoặc 1 lần <literal>s</literal>; <literal>s+</literal> bắt một hoặc nhiều hơn một những chữ <literal>s</literal> đứng liền nhau; và vâng vâng). Các dấu ngoặc cho phép nhóm các kết quả tìm kiếm.

source: The precise syntax of these expressions varies across the tools using them, but the basic features are similar. <ulink type="block" url="http://en.wikipedia.org/wiki/Regular_expression" />
nb_no: Den presise syntaksen til disse uttrykkene varierer mellom de verktøyene som bruker dem, men de grunnleggende funksjonene er like. <ulink type="block" url="http://en.wikipedia.org/wiki/Regular_expression" />
vi_vn: Cú pháp chính xác của những thành ngữ này thay đổi khi được sử dụng bởi các công cụ sử dụng chúng, nhưng các tính năng cơ bản là tương tự nhau. <ulink type="block" url="http://en.wikipedia.org/wiki/Regular_expression" />

source: The first one checks the header mentioning the email software; if <literal>GOTO Sarbacane</literal> (a bulk email software) is found, the message is rejected. The second expression controls the message subject; if it mentions a virus notification, we can decide not to reject the message but to discard it immediately instead.
nb_no: Den første sjekker toppteksten som viser til programvaren for e-mail; hvis <literal>GOTO Sarbacane</literal> (en samling e-post-programvare) blir funnet, blir meldingen avvist. Det andre uttrykket styrer meldingens subjekt; hvis det nevner et virusvarsel, kan vi bestemme oss for ikke å avvise meldingen, men straks å forkaste den i stedet.
vi_vn: Thành ngữ đầu tiên kiểm tra tiêu đề(headers) vốn đề cập đến phần mềm thư điện tử; nếu <literal>GOTO Sarbacane</literal> (một phần mềm thư điện tử cồng kềnh) được tìm thấy, thông điệp sẽ bị từ chối. Thành ngữ thứ hai kiểm soát tên(subject) của thư; nếu nó đề cập một cảnh báo vi-rút, chúng ta có thể quyết định không từ chối(reject) thông điệp mà hủy(discard) nó ngay lập tức.

source: Using these filters is a double-edged sword, because it is easy to make the rules too generic and to lose legitimate emails as a consequence. In these cases, not only the messages will be lost, but their senders will get unwanted (and annoying) error messages.
nb_no: Bruk av disse filtrene er et tveegget sverd, fordi det er lett å gjøre reglene for allmenne, og som resultat miste legitim e-post. I disse tilfellene vil ikke bare meldingene gå tapt, men avsenderne får uønskede (og irriterende) feilmeldinger.
vi_vn: Sử dụng những bộ lọc này là con dao hai lưỡi, bởi vì nó rất dễ làm các quy tắc trở nên quá chung chung và dẫn đến việc mất các thư điện tử hợp lệ. Trong những trường hợp này, không chỉ những thông điệp bị mất, mà cả những người gửi của chúng cũng sẽ nhận những thông điệp báo lỗi không muốn có và rất phiền phức.

source: Setting Up <foreignphrase>greylisting</foreignphrase>
nb_no: Å sette opp <foreignphrase>greylisting</foreignphrase>
vi_vn: Cài đặt <foreignphrase>đánh dấu xám</foreignphrase>

source: <primary>greylisting</primary>
nb_no: <primary>grålisting</primary>
vi_vn: <primary>đánh dấu xám</primary>

source: “Greylisting” is a filtering technique according to which a message is initially rejected with a temporary error code, and only accepted on a further try after some delay. This filtering is particularly efficient against spam sent by the many machines infected by worms and viruses, since this software rarely acts as a full SMTP agent (by checking the error code and retrying failed messages later), especially since many of the harvested addresses are really invalid and retrying would only mean losing time.
nb_no: «Grålisting» («Greylisting») er en filtreringsteknikk der en melding som i utgangspunktet er avvist med en midlertidig feilkode, og bare aksepteres etter et ytterligere forsøk etter noen tid. Denne filtreringen er spesielt effektiv mot spam som sendes av de mange maskinene som er infisert av ormer og virus, fordi denne programvaren sjelden fungerer som en full SMTP-agent (ved å kontrollere feilkode ,og prøve meldinger som har feilet på nytt senere), spesielt fordi mange av de oppsamlede adressene virkelig er ugyldige, og prøve dem på nytt bare ville bety å miste tid.
vi_vn: “Đánh dấu xám” là một kĩ thuật lọc dựa trên thông điệp nào bị từ chối lần đầu tiên với một mã lỗi tạm thời, và chỉ nhận trong lần sau đó sau một khoảng thời gian chờ. Việc lọc này là hiệu quả cực kỳ với những thư rác gửi ra những máy tính bị nhiễm sâu và vi-rút, bởi các phần mềm độc hại này ít khi hoạt động như là một chương trình SMTP đầy đủ(bằng việc kiểm tra mã lỗi và thử lại sau đó các thông điệp bị lỗi khi gửi), đặc biệt bởi vì nhiều địa chỉ thu lại được rất bất hợp lệ và việc thử lại chỉ mất thời gian.

source: Postfix doesn't provide greylisting natively, but there is a feature by which the decision to accept or reject a given message can be delegated to an external program. The <emphasis role="pkg">postgrey</emphasis> package contains just such a program, designed to interface with this access policy delegation service.
nb_no: Postfix leverer ikke grålisting (greylisting) fritt, men det er en funksjon, der beslutningen om å godta eller forkaste en gitt melding, kan delegeres til et eksternt program. Pakken <emphasis role="pkg">postgrey</emphasis> inneholder akkurat et slikt program, laget for å være bindeleddet til denne delegerte adgangspolitikktjenesten.
vi_vn: Postfix không cung cấp sẵn việc đánh dấu xám, nhưng có một tính năng mà dựa trên đó một quyết định để nhận hay từ chối một thông điệp có thể được chuyển giao cho một chương trình bên ngoài. Gói phần mềm <emphasis role="pkg">postgrey</emphasis> chứa một chương trình như vậy, được thiết kế để giao tiếp với một dịch vụ chuyển giao quyền kiểm soát truy cập này.

source: Once <emphasis role="pkg">postgrey</emphasis> is installed, it runs as a daemon and listens on port 10023. Postfix can then be configured to use it, by adding the <literal>check_policy_service</literal> parameter as an extra restriction:
nb_no: Så snart <emphasis role="pkg">postgrey</emphasis> er installert, kjører den som en nisse, og lytter på port 10023. Postfix kan så konfigureres til å bruke den ved å legge til <literal>check_policy_service</literal>-parameteret som en ekstra begrensning:
vi_vn: Một khi <emphasis role="pkg">postgrey</emphasis> đã được cài đặt, nó chạy như là một tiến trình nền và lắng nghe tín hiệu trên cổng 100023. Postfix sau đó có thể được cấu hình để sử dụng nó, bằng việc thêm tham biến <literal>check_policy_service</literal> như là một giới hạn thêm:
