Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: The <literal>Order</literal> directive tells the server of the order in which the <literal>Allow from</literal> and <literal>Deny from</literal> directives are applied; the last one that matches takes precedence. In concrete terms, <literal>Order deny,allow</literal> allows access if no <literal>Deny from</literal> applies, or if an <literal>Allow from</literal> directive does. Conversely, <literal>Order allow,deny</literal> rejects access if no <literal>Allow from</literal> directive matches (or if a <literal>Deny from</literal> directive applies).
nb_no: <literal>Order</literal>-direktivet forteller tjeneren om rekkefølgen på <literal>Allow from</literal> og <literal>Deny from</literal>-direktivene; den siste som matcher har forrang. Konkret tillater <literal>Order deny,allow</literal> adgang hvis ingen <literal>Deny from</literal> passer, eller hvis et <literal>Allow from</literal>-direktiv gjør det. Omvendt, stanser <literal>Order allow,deny</literal> adgang hvis intet <literal>Allow from</literal>-direktiv matcher (eller hvis et <literal>Deny from</literal>-direktiv tillater).
vi_vn: Chỉ thị <literal>Order</literal> cho máy phục vụ biết rằng thứ tự thực thi các chỉ thị <literal>Allow from</literal> và <literal>Deny from</literal>; chỉ thị nằm cuối cùng và phải khớp được ưu tiên trước. Cụ thể hơn, <literal>Order deny,allow</literal> cho phép truy cập nếu không có <literal>Deny from</literal> nào áp dụng được, hoặc nếu một chỉ thị <literal>Allow from</literal> áp dụng được. Ngược lại, <literal>Order allow,deny</literal> từ chối truy cập nếu không có chỉ thị <literal>Allow from</literal> nào khớp (hoặc nếu một chỉ thị <literal>Deny from</literal> áp dụng được).

source: The <literal>Allow from</literal> and <literal>Deny from</literal> directives can be followed by an IP address, a network (such as <literal>192.168.0.0/255.255.255.0</literal>, <literal>192.168.0.0/24</literal> or even <literal>192.168.0</literal>), a hostname or a domain name, or the <literal>all</literal> keyword, designating everyone.
nb_no: Direktivene <literal>Allow from</literal> og <literal>Deny from</literal> kan etterfølges av en IP-adresse, et nettverk (slik som <literal>192.168.0.0/255.255.255.0</literal>, <literal>192.168.0.0/24</literal>, eller til og med <literal>192.168.0</literal>), et vertsnavn eller domenenavn, eller <literal>all</literal>-nøkkelen som peker ut alle.
vi_vn: Các chỉ thị <literal>Allow from</literal> và <literal>Deny from</literal> có thể được theo sau bởi một địa chỉ IP, một dãy số cho vùng mạng (như là <literal>192.168.0.0/255.255.255.0</literal>, <literal>192.168.0.0/24</literal> or even <literal>192.168.0</literal>), một tên máy hoặc một tên miền, hoặc từ khóa <literal>all</literal>, ám chỉ bất cứ ai.

source: For instance, to reject connections by default but allow them from the local network, you could use this:
nb_no: For eksempel, for å avvise forbindelser som standard, men tillate dem fra det lokale nettverket, kan du bruke denne:
vi_vn: Ví dụ, để từ chối các kết nối theo ngầm định nhưng cho phép chúng từ mạng nội bộ, bạn có thể làm như sau:

source: Log Analyzers
nb_no: Logg-analysatorer
vi_vn: Các chương trình phân tích nhật ký

source: A log analyzer is frequently installed on a web server; since the former provides the administrators with a precise idea of the usage patterns of the latter.
nb_no: En logg-analysator er ofte installert på en nett-tjener; siden den første gir administratorer en presis idé om bruksmønstre på sistnevnte.
vi_vn: Một chương trình phân tích nhật ký thường được cài đặt trên một máy phục vụ web; bởi chương trình phân tích cung cấp cho các quản trị viên một cái nhìn chính xác về quy luật hoạt động của máy phục vụ web.

source: The Falcot Corp administrators selected <emphasis>AWStats</emphasis> (<emphasis>Advanced Web Statistics</emphasis>) to analyze their Apache log files.
nb_no: Falcot Corp-administratorene valgte <emphasis>AWStats</emphasis> (<emphasis>Advanced Web Statistics</emphasis>) til å analysere sine Apache-loggfiler.
vi_vn: Các nhà quản trị hệ thống Công ty Falcot đã lựa chọn <emphasis>AWStats</emphasis> (<emphasis>Advanced Web Statistics (Thông số Web Chuyên sâu)</emphasis>) để phân tích các tập tin nhật ký Apache.

source: <primary>web logs analyzer</primary>
nb_no: <primary>analysator av web-logger</primary>
vi_vn: <primary>chương trình phân tích các nhật ký web</primary>

source: <primary>logs</primary><secondary>web logs analyzer</secondary>
nb_no: <primary>logger</primary><secondary>analysator av web-logger</secondary>
vi_vn: <primary>logs</primary><secondary>chương trình phân tích các nhật ký web</secondary>

source: <primary>analyzer of web logs</primary>
nb_no: <primary>analysator av web-logger</primary>
vi_vn: <primary>chương trình phân tích các nhật ký web</primary>

source: The first configuration step is the customization of the <filename>/etc/awstats/awstats.conf</filename> file. The Falcot administrators keep it unchanged apart from the following parameters:
nb_no: Det første konfigurasjonstrinnet er å tilpasse <filename>/etc/awstats/awstats.conf</filename>-filen. Falcot-administratorene holdt den uendret, bortsett fra følgende parametre:
vi_vn: Bước cấu hình đầu tiên là tùy chỉnh tập tin <filename>/etc/awstats/awstats.conf</filename>. Các nhà quản trị hê thống của Falcot giữ phần không thay đổi của nó khỏi các thông số sau đây:

source: All these parameters are documented by comments in the template file. In particular, the <varname>LogFile</varname> and <varname>LogFormat</varname> parameters describe the location and format of the log file and the information it contains; <varname>SiteDomain</varname> and <varname>HostAliases</varname> list the various names under which the main web site is known.
nb_no: Alle disse parametrene er dokumentert av kommentarer i male-filen. Spesielt beskriver <varname>LogFile</varname> og <varname>LogFormat</varname>-parameterene, plasseringen og formatet på loggfilen og informasjonen den inneholder;<varname>SiteDomain</varname> og <varname>HostAliases</varname> lister de ulike navnene som hovednettstedet er kjent under.
vi_vn: Tất cả những thông số này đuợc ghi chú trong tập tin mẫu(template). Cụ thể hơn, các thông số <varname>LogFile</varname> và <varname>LogFormat</varname> mô tả địa điểm và định dạng của tập tin nhật ký và thông tin chứa đựng trong nó; <varname>SiteDomain</varname> và <varname>HostAliases</varname> liệt kê những cái tên mà trang web chính thức được biết tới.

source: For high traffic sites, <varname>DNSLookup</varname> should usually not be set to <literal>1</literal>; for smaller sites, such as the Falcot one described above, this setting allows getting more readable reports that include full machine names instead of raw IP addresses.
nb_no: For områder med stor trafikk skal <varname>DNSLookup</varname> vanligvis ikke settes til <literal>1</literal>. For mindre nettsteder, som for eksempel Falcot-eksemplet beskrevet ovenfor, tillater denne innstillingen mer lesbare rapporter med komplette maskinnavn i stedet for rå (enkle) IP-adresser.
vi_vn: Đối với những trang web có lưu lượng truyền tải cao, <varname>DNSLookup</varname> thuờng không nên được cài đặt giá trị <literal>1</literal>; cho những trang nhỏ, như cái Falcot được mô tả phía trên, cài đặt này cho phép thu thập nhiều bản báo cáo dễ đọc hơn vốn bao gồm những tên máy đầy đủ thay vì các địa chỉ IP thô.

source: <emphasis>SECURITY</emphasis> Access to statistics
nb_no: <emphasis>SIKKERHET</emphasis> Tilgang til statistikk
vi_vn: <emphasis>AN NINH</emphasis> Truy cập tới các thông số

source: AWStats makes its statistics available on the website with no restrictions by default, but restrictions can be set up so that only a few (probably internal) IP addresses can access them; the list of allowed IP addresses needs to be defined in the <varname>AllowAccessFromWebToFollowingIPAddresses</varname> parameter
nb_no: AWStats gjør statistikk tilgjengelig på nettstedet uten restriksjoner som standard. Men restriksjoner kan settes opp slik at bare noen få (sannsynligvis interne) IP-adresser kan få tilgang til dem. Listen over tillatte IP-adresser må være definert i <varname>AllowAccessFromWebToFollowingIPAddresses</varname>-parameteret
vi_vn: AWStats công bố các thông số của nó trên trang web mà không có giới hạn gì theo ngầm định, nhưng các giới hạn có thể được đặt ra để một số địa chỉ IP (có thể nội bộ) có thể truy cập chúng; danh sách các địa chỉ IP được cho phép cần phải được định nghĩa lại trong tham số <varname>AllowAccessFromWebToFollowingIPAddresses</varname>

source: AWStats will also be enabled for other virtual hosts; each virtual host needs its own configuration file, such as <filename>/etc/awstats/awstats.www.falcot.org.conf</filename>.
nb_no: AWStats er også aktivert for andre virtuelle verter; hver virtuell vert må ha en egen konfigurasjonsfil, som for eksempel <filename>/etc/awstats/awstats.www.falcot.org.conf</filename>.
vi_vn: AWStats sẽ được kích hoạt cho các máy ảo(virtual host) khác;mỗi máy ảo cần có một tập tin cấu hình riêng, như là <filename>/etc/awstats/awstats.www.falcot.org.conf</filename>.

source: AWStats configuration file for a virtual host
nb_no: AWStats konfigurasjonsfil for en virtuell vert
vi_vn: Tập tin cấu hình AWStats cho một máy ảo(virtual host)

source: AWStats uses many icons stored in the <filename>/usr/share/awstats/icon/</filename> directory. In order for these icons to be available on the web site, the Apache configuration needs to be adapted to include the following directive:
nb_no: AWStats bruker mange ikoner lagret i <filename>/usr/share/awstats/icon/</filename>-mappen. For at disse ikonene skal være tilgjengelige på nettsiden, må Apache-konfigurasjonen tilpasses ved å inkludere følgende direktiv:
vi_vn: AWStats sử dụng nhiều biểu tượng lưu trong thư mục <filename>/usr/share/awstats/icon/</filename>. Để những biểu tượng này có thể được truy cập bởi trang web, cấu hình Apache cần được chỉnh sửa để bao gồm chỉ thị sau đây:

source: After a few minutes (and once the script has been run a few times), the results are available online: <ulink type="block" url="http://www.falcot.com/cgi-bin/awstats.pl" /><ulink type="block" url="http://www.falcot.org/cgi-bin/awstats.pl" />
nb_no: Etter noen minutter (og så snart skriptet er kjørt et par ganger), er resultatene tilgjengelig på nettet: <ulink type="block" url="http://www.falcot.com/cgi-bin/awstats.pl" /><ulink type="block" url="http://www.falcot.org/cgi-bin/awstats.pl" />
vi_vn: Sau một vài phút (và khi đoạn mã được chạy vài lần), các kết quả nằm sẵn trên mạng: <ulink type="block" url="http://www.falcot.com/cgi-bin/awstats.pl" /><ulink type="block" url="http://www.falcot.org/cgi-bin/awstats.pl" />

source: <emphasis>CAUTION</emphasis> Log file rotation
nb_no: <emphasis>VÆR VARSOM</emphasis> Loggfil-rotasjon
vi_vn: <emphasis>CẢNH BÁO</emphasis> Quay vòng các tập tin nhật ký

source: In order for the statistics to take all the logs into account, <emphasis>AWStats</emphasis> needs to be run right before the Apache log files are rotated. Looking at the <literal>prerotate</literal> directive of <filename>/etc/logrotate.d/apache2</filename> file, this can be solved by putting a symlink to <filename>/usr/share/awstats/tools/update.sh</filename> in <filename>/etc/logrotate.d/httpd-prerotate</filename>:
nb_no: For at statistikken skal ta alle loggene med i betraktningen, trenger <emphasis>AWStats</emphasis> å kjøres rett før Apache loggfilene blir rotert. Se på <literal>prerotate</literal>-direktivet til <filename>/etc/logrotate.d/apache2</filename>-filen. Dette kan løses ved å sette en symlink til <filename>/usr/share/awstats/tools/update.sh</filename> i <filename>/etc/logrotate.d/httpd-prerotate</filename>:
vi_vn: Để những thông số này tính luôn cả các tập tin nhật ký, <emphasis>AWStats</emphasis> cần được chạy ngay trước khi các tập tin nhật ký được xoay vòng. Xem chỉ thị <literal>prerotate</literal> của tập tin <filename>/etc/logrotate.d/apache2</filename>, điều này có thể được giải quyết bằng việc đặt một đường link tượng trưng vào <filename>/usr/share/awstats/tools/update.sh</filename> vào <filename>/etc/logrotate.d/httpd-prerotate</filename>:

source: Note also that the log files created by <command>logrotate</command> need to be readable by everyone, especially AWStats. In the above example, this is ensured by the <literal>create 644 root adm</literal> line (instead of the default <literal>640</literal> permissions).
nb_no: Merk også at loggfilene som ble opprettet av <command>logrotate</command>, må kunne leses av alle, spesielt AWStats. I eksempelet ovenfor er dette sikret av <literal>create 644 root adm</literal>-linjen (i stedet for de standard <literal>640</literal>- tillatelsene).
vi_vn: Ghi chú rằng các tập tin nhật ký tạo ra bởi lệnh <command>logrotate</command> cần có thể được đọc bởi mọi người, đặc biệt là AWStats. Trong ví dụ trên, điều này được đảm bảo bằng dòng <literal>create 644 root adm</literal> (thay vì mã truy cập <literal>640</literal> ngầm định).

source: FTP File Server
nb_no: FTP-filtjener
vi_vn: Máy phục vụ Tập tin FTP

source: <primary>FTP (<emphasis>File Transfer Protocol</emphasis>)</primary>
vi_vn: <primary>FTP (<emphasis>Giao thức chuyển tải tập tin</emphasis>)</primary>

source: FTP (<emphasis>File Transfer Protocol</emphasis>) is one of the first protocols of the Internet (RFC 959 was issued in 1985!). It was used to distribute files before the Web was even born (the HTTP protocol was created in 1990, and formally defined in its 1.0 version by RFC 1945, issued in 1996).
nb_no: FTP (<emphasis>File Transfer Protocol</emphasis>) (Filoverføringsprotokoll) er en av de første protokollene for Internett (RFC 959 ble utstedt i 1985!). Den ble brukt til å distribuere filer før nettet til og med var født (HTTP-protokollen ble laget i 1990, og formelt definert i sin 1.0-versjon av RFC 1945, utgitt i 1996).
vi_vn: FTP (<emphasis>Giao thức Chuyển tải Tập tin</emphasis>) là một trong những giao thức Internet (RFC 959 được tung ra vào năm 1985!). Nó được dùng để phân phối các tập tin trước khi Web được sinh ra (giao thức HTTP được tạo ra vào năm 1990, và được định nghĩa chính thức trong phiên bản 1.0 trong RFC 1945, tung ra năm 1996).

source: This protocol allows both file uploads and file downloads; for this reason, it is still widely used to deploy updates to a website hosted by one's Internet service provider (or any other entity hosting websites). In these cases, secure access is enforced with a user identifier and password; on successful authentication, the FTP server grants read-write access to that user's home directory.
nb_no: Denne protokollen tillater både filopplasting og -nedlasting av filer. Derfor er den fortsatt mye brukt til å distribuere oppdateringer til et nettsted som drives av en internettleverandør (eller andre som er vert for nettsteder). I disse tilfellene håndheves sikker adgang med en brukeridentifikasjon og passord. Ved vellykket autentisering, gir FTP-tjeneren lese- og skrivetilgang til brukerens hjemmekatalog.
vi_vn: Giao thức này cho phép cả tải lên và tải xuống; vì lí do này, nó vẫn được sử dụng rộng rãi để phân phối các bản cập nhật cho một trang web lưu trên nhà cung cấp dịch vụ Internet của một cá nhân nào đó(hoặc bất kì các trang web lưu trữ khác). Trong các trường hợp này, truy cập an toàn được đảm bảo với một tên tài khoản và mật mã; khi đăng nhập thành công, máy phục vụ FTP cho phép truy cập đọc-viết vào thư mục nhà của người sử dụng đó.

source: Other FTP servers are mainly used to distribute files for public downloading; Debian packages are a good example. The contents of these servers is fetched from other, geographically remote, servers; it is then made available to less distant users. This means that client authentication is not required; as a consequence, this operating mode is known as “anonymous FTP”. To be perfectly correct, the clients do authenticate with the <literal>anonymous</literal> username; the password is often, by convention, the user's email address, but the server ignores it.
nb_no: Andre FTP-tjenere brukes i hovedsak til å distribuere filer for offentlig nedlasting: Debian-pakker er et godt eksempel. Innholdet i disse tjenerne er hentet fra andre, geografisk fjerntliggende tjenere, og gjøres da tilgjengelige for mindre fjerntliggende brukere. Dette betyr at klientautentisering ikke er nødvendig. Som et resultat er denne driftsmodus kjent som «anonymus FTP». For å være helt korrekt autentiseres klientene med brukernavnet <literal>anonymous</literal>; passordet er ofte, ifølge vanlig praksis, brukerens e-postadresse, men det ignorerer tjeneren.
vi_vn: Các máy phục vụ FTP khác được sử dụng nhằm để phân phối các tập tin để tải xuống công cộng; các gói phần mềm Debian là một ví dụ tốt. Nội dung của những máy phục vụ được lấy về từ các máy phục vụ từ xa; sau đó nó được cung cấp cho các người dùng ít xa xôi hơn. Điều này nghĩa là chứng thực chương trình khách là không cần thiết; vì thế, chế độ hoạt động này được biết đến là “FTP ẩn danh“. Để nói cho thực sự chính xác, các khách hàng xác thực với tên tài khoản <literal>anonymous</literal>; mật mã thường là địa chỉ email của người sử dụng, nhưng máy phục vụ thường phớt lờ nó.

source: Many FTP servers are available in Debian (<emphasis role="pkg">ftpd</emphasis>, <emphasis role="pkg">proftpd-basic</emphasis>, <emphasis role="pkg">pyftpd</emphasis> and so on). The Falcot Corp administrators picked <emphasis role="pkg">vsftpd</emphasis> because they only use the FTP server to distribute a few files (including a Debian package repository); since they don't need advanced features, they chose to focus on the security aspects.
nb_no: Mange FTP-tjenere er tilgjengelige i Debian (<emphasis role="pkg">ftpd</emphasis>, <emphasis role="pkg">proftpd-basic</emphasis>, <emphasis role="pkg">pyftpd</emphasis> og så videre). Falcot Corp-administratorene valgte ut <emphasis role="pkg">vsftpd</emphasis> fordi de bare bruker FTP-tjeneren for å distribuere noen få filer (inkludert en Debian-pakkebrønn). Ettersom de ikke trenger avanserte funksjoner, valgte de å fokusere på de sikkerhetsmessige aspektene.
vi_vn: Nhiều máy phục vụ FTP hiện đang có sẵn trong Debian (<emphasis role="pkg">ftpd</emphasis>, <emphasis role="pkg">proftpd-basic</emphasis>, <emphasis role="pkg">pyftpd</emphasis> và vâng vâng). Các nhà quản trị hê thống của Công ty Falcot chọn <emphasis role="pkg">vsftpd</emphasis> bởi họ chỉ sử dụng máy phục vụ FTP để phân phối một vài tập tin (bao gồm một kho gói phần mềm Debian); do họ không cần các tính năng phức tạp, họ chọn tập trung vào các mặt an ninh.

source: Installing the package creates an <literal>ftp</literal> system user. This account is always used for anonymous FTP connections, and its home directory (<filename>/srv/ftp/</filename>) is the root of the tree made available to users connecting to this service. The default configuration (in <filename>/etc/vsftpd.conf</filename>) requires some changes to cater to the simple need of making big files available for public downloads: anonymous access needs to be enabled (<literal>anonymous_enable=YES</literal>) and read-only access of local users needs to be disabled (<literal>local_enable=NO</literal>). The latter is particularly important since the FTP protocol doesn't use any form of encryption and the user password could be intercepted over the wire.
nb_no: Å installere pakken skaper en <literal>ftp</literal> systembruker. Denne kontoen brukes alltid for anonyme FTP-tilkoblinger, og hjemmekatalogen dens (<filename>/srv/ftp/</filename>) er roten til treet som brukerne kan benytte for å knytte seg til denne tjenesten. Standardoppsettet (i <filename>/etc/vsftpd.conf</filename>) krever noen endringer for å imøtekomme enkle behov for å gjøre store filer tilgjengelig for offentlige nedlastinger: Anonym tilgang må være aktivert (<literal>anonymous_enable=YES</literal>), og lesetilgang fra lokale brukere må være deaktivert (<literal>local_enable=NO</literal>). Det siste er spesielt viktig ettersom FTP-protokollen ikke bruker noen form for kryptering, og brukerpassord kan bli snappet opp underveis.
vi_vn: Cài đặt gói phần mềm đó tạo một tài khoản hệ thống <literal>ftp</literal>. Tài khoản này luôn được sử dụng cho các kết nối FTP ẩn danh, và thư mục nhà của nó (<filename>/srv/ftp/</filename>) là gốc của cây thư mục được tạo sẵn cho các người sử dụng kết nối đến dịch vụ này. Cấu hình ngầm định (trong <filename>/etc/vsftpd.conf</filename>) buộc một vài thay đổi để hỗ trợ nhu cầu tạo ra các tập tin lớn để tải xuống công cộng: các kết nối ẩn danh cần được kích hoạt (<literal>anonymous_enable=YES</literal>) và kết nối chỉ đọc cho các người dùng cục bộ cần phải được tắt (<literal>local_enable=NO</literal>). Phần sau chỉ đặc biệt quan trọng bởi giao thức FTP không sử dụng bất cứ hình thức mã hóa nào và mật mã tài khoản có thể bị can thiệp trên đường truyền.

source: NFS File Server
nb_no: NFS-filtjener
vi_vn: Máy phục vụ tập tin NFS

source: NFS (<emphasis>Network File System</emphasis>) is a protocol allowing remote access to a filesystem through the network. All Unix systems can work with this protocol; when Windows systems are involved, Samba must be used instead.
nb_no: NFS (<emphasis>Network File System</emphasis>) er en protokoll som tillater ekstern tilgang til et filsystem gjennom nettverket. Alle Unix-systemer kan arbeide med denne protokollen; når Windows-systemer er involvert, må Samba brukes i stedet.
vi_vn: NFS ("<emphasis>Hệ thống Tập tin Mạng(Network File System)</emphasis>) là một giao thức cho phép truy cập từ xa tới một hệ thống tập tin thông qua mạng. Tất cả các hệ thống Unix có thể làm việc với giao thức này; khi các hệ thống Windows có liên quan, Samba phải được sử dụng thay thế.

source: <primary><emphasis>Network</emphasis></primary><secondary><emphasis>File System</emphasis></secondary>
nb_no: <primary><emphasis>Nettverk</emphasis></primary><secondary><emphasis>Filsystem</emphasis></secondary>
vi_vn: <primary><emphasis>Mạng</emphasis></primary><secondary><emphasis>Hệ thống Tập tin</emphasis></secondary>

source: <primary>filesystem</primary><secondary>network</secondary>
nb_no: <primary>filsystem</primary><secondary>nettverk</secondary>
vi_vn: <primary>Hệ thống tập tin</primary><secondary>mạng</secondary>

source: <primary>file</primary><secondary>server</secondary>
nb_no: <primary>fil</primary><secondary>server</secondary>
vi_vn: <primary>tập tin</primary><secondary>máy phục vụ</secondary>

source: <primary>server</primary><secondary>file</secondary>
nb_no: <primary>server</primary><secondary>fil</secondary>
vi_vn: <primary>máy phục vụ</primary><secondary>tập tin</secondary>
