Repository: Debian-VN/debian-handbook
Catalog: */11_network-services.po
Languages: nb_no, vi_vn

source: The Apache server, as configured so far, uses the same log files for all virtual hosts (although this could be changed by adding <literal>CustomLog</literal> directives in the definitions of the virtual hosts). It therefore makes good sense to customize the format of this log file to have it include the name of the virtual host. This can be done by creating a <filename>/etc/apache2/conf-available/customlog.conf</filename> file that defines a new format for all log files (with the <literal>LogFormat</literal> directive) and by enabling it with <command>a2enconf customlog</command>. The <literal>CustomLog</literal> line must also be removed (or commented out) from the <filename>/etc/apache2/sites-available/000-default.conf</filename> file.
nb_no: Apache-tjeneren, konfigurert så langt, bruker de samme loggfiler for alle virtuelle verter (selv om dette kan endres ved å legge til <literal>CustomLog</literal>-direktiver i definisjonene til de virtuelle vertene). Det er derfor klokt å tilpasse formatet på denne loggfilen slik at den inneholder navnet på den virtuelle verten. Dette kan gjøres ved å opprette en <filename>/etc/apache2/conf-available/customlog.conf</filename>-fil som fastsetter et nytt format for alle loggfiler (med <literal>LogFormat</literal>-direktivet), og ved å aktivere den med <command>a2enconf customlog</command>. <literal>CustomLog</literal>-linjen må også fjernes (eller kommenteres ut) fra <filename>/etc/apache2/sites-available/000-default.conf</filename>-filen.
vi_vn: Máy phục vụ Apache, như được cấu hình như trước đây, sử dụng chung những tập tin nhật ký cho tất cả các máy ảo (mặc dù điều này có thể được thay đổi bằng việc thêm các chỉ thị <literal>CustomLog</literal> vào các định nghĩa của các máy ảo). Vì thế sẽ có lý khi tùy chỉnh định dạng của tập tin nhật ký này để nhờ nó đính kèm tên của máy ảo. Điều này có thể được thực hiện bằng việc tạo một <filename>/etc/apache2/conf-available/customlog.conf</filename> vốn định nghĩa một định dạng mới cho tất cả các tập tin nhật ký (với chỉ thị <literal>LogFormat</literal>) và bằng việc kích hoạt nó với lệnh <command>a2enconf customlog</command>. Dòng <literal>CustomLog</literal> phải được xóa bỏ (hay chuyển thành ghi chú) khỏi tập tin <filename>/etc/apache2/sites-available/000-default.conf</filename>.

source: The <filename>/etc/apache2/conf.d/customlog.conf</filename> file
nb_no: Filen <filename>/etc/apache2/conf.d/customlog.conf</filename>
vi_vn: Tập tin <filename>/etc/apache2/conf.d/customlog.conf</filename>

source: # New log format including (virtual) host name LogFormat "%v %h %l %u %t \"%r\" %&gt;s %b \"%{Referer}i\" \"%{User-Agent}i\"" vhost # Now let's use this "vhost" format by default CustomLog /var/log/apache2/access.log vhost
vi_vn: # Định dạng nhật ký mới bao gồm tên máy (ảo) LogFormat "%v %h %l %u %t \"%r\" %&gt;s %b \"%{Referer}i\" \"%{User-Agent}i\"" vhost # Bây giờ hãy sử dụng định dạng "vhost" cho lựa chọn ngầm định CustomLog /var/log/apache2/access.log vhost

source: Common Directives
nb_no: Vanlige direktiver
vi_vn: Các chỉ thị phổ biến

source: This section briefly reviews some of the commonly-used Apache configuration directives.
nb_no: Dette avsnittet gir en kort gjennomgang av noen av de oftest brukte Apache-konfigurasjonsdirektivene.
vi_vn: Phần này ôn lại một số chỉ thị của các chỉ thị cấu hình thường sử dụng của Apache.

source: <primary>Apache directives</primary>
nb_no: <primary>Apache-direktiver</primary>
vi_vn: <primary>Các chỉ thị Apache</primary>

source: <primary>directive, Apache</primary>
vi_vn: <primary>chỉ thị, Apache</primary>

source: The main configuration file usually includes several <literal>Directory</literal> blocks; they allow specifying different behaviors for the server depending on the location of the file being served. Such a block commonly includes <literal>Options</literal> and <literal>AllowOverride</literal> directives.
nb_no: Den viktigste konfigurasjonsfilen inneholder vanligvis flere <literal>Directory</literal>-blokker. De åpner for å spesifisere ulike virkemåter for tjeneren, avhengig av plasseringen av filen som blir betjent. En slik blokk omfatter vanligvis <literal>Options</literal> og <literal>AllowOverride</literal>-direktiver.
vi_vn: Tập tin cấu hình chính thường bao gồm các khối <literal>Directory</literal>; chúng cho phép chỉ định những hành vi khác nhau cho một máy phục vụ tùy theo địa chỉ của tập tin sẽ được phục vụ. Một khối như vậy thường bao gồm các chỉ thị <literal>Options</literal> và các chỉ thị <literal>AllowOverride</literal>.

source: <primary><literal>Options</literal>, Apache directive</primary>
nb_no: <primary><literal>Options</literal>, Apache-direktiv</primary>
vi_vn: <primary><literal>Options</literal>, chỉ thị Apache</primary>

source: <primary><literal>AllowOverride</literal>, Apache directive</primary>
nb_no: <primary><literal>AllowOverride</literal>, Apache-direktiv</primary>
vi_vn: <primary><literal>AllowOverride</literal>, chỉ thị Apache</primary>

source: Directory block
nb_no: Katalogblokk
vi_vn: Khối thư mục (Directory block)

source: The <literal>DirectoryIndex</literal> directive contains a list of files to try when the client request matches a directory. The first existing file in the list is used and sent as a response.
nb_no: Direktivet <literal>DirectoryIndex</literal> inneholder en liste over filer som kan prøves når klientens forespørsel matcher en katalog. Den første filen som forekommer i listen brukes, og er sendt som en respons.
vi_vn: Chỉ thị <literal>DirectoryIndex</literal> bao gồm một danh sách các tập tin để thử khi yêu cầu từ chương trình khách hợp với một thư mục. Tập tin đầu tiên tồn tại trong danh sách sẽ được sử dụng và gửi đi như là một câu trả lời.

source: <primary><literal>DirectoryIndex</literal>, Apache directive</primary>
nb_no: <primary><literal>DirectoryIndex</literal>, Apache-direktiv</primary>
vi_vn: <primary><literal>DirectoryIndex</literal>, chỉ thị Apache</primary>

source: The <literal>Options</literal> directive is followed by a list of options to enable. The <literal>None</literal> value disables all options; correspondingly, <literal>All</literal> enables them all except <literal>MultiViews</literal>. Available options include:
nb_no: Direktivet <literal>Options</literal> er etterfulgt av en liste av alternativer som kan aktiveres. Verdien <literal>None</literal> slår av alle valg; tilsvarende aktiverer <literal>All</literal> alle sammen unntatt <literal>MultiViews</literal>. Tilgjengelige valg inkluderer:
vi_vn: Chỉ thị <literal>Options</literal> được theo sau bởi một danh sách các lựa chọn để kích hoạt. Giá trị <literal>None</literal> tắt hết các lựa chọn; tương ứng, <literal>All</literal> kích hoạt tất cả ngoại trừ <literal>MultiViews</literal>. Các lựa chọn có sẵn bao gồm:

source: <literal>ExecCGI</literal> indicates that CGI scripts can be executed. <indexterm><primary><literal>ExecCGI</literal>, Apache directive</primary></indexterm>
nb_no: <literal>ExecCGI</literal> indikerer at CGI-skript kan utføres. <indexterm><primary><literal>ExecCGI</literal>, Apache-direktiv</primary></indexterm>
vi_vn: <literal>ExecCGI</literal> báo rằng các mã kịch bản CGI có thể được thực thi. <indexterm><primary><literal>ExecCGI</literal>, chỉ thị Apache</primary></indexterm>

source: <literal>FollowSymlinks</literal> tells the server that symbolic links can be followed, and that the response should contain the contents of the target of such links. <indexterm><primary><literal>FollowSymlinks</literal>, Apache directive</primary></indexterm>
nb_no: <literal>FollowSymlinks</literal> forteller tjeneren at symbolske lenker kan bli fulgt, og at responsen skal inneholde innholdet av målet for slike koblinger. <indexterm><primary><literal>FollowSymlinks</literal>, Apache-direktiv</primary></indexterm>
vi_vn: <literal>FollowSymlinks</literal> cho máy phục vụ biết là các đường link tượng trưng (symbolic links) có thể dùng để tìm ra địa điểm, và câu trả lời nên chứa những nội dung ở địa điểm của các đường link đó.<indexterm><primary><literal>FollowSymlinks</literal>, chỉ thị Apache</primary></indexterm>

source: <literal>SymlinksIfOwnerMatch</literal> also tells the server to follow symbolic links, but only when the link and the its target have the same owner. <indexterm><primary><literal>SymlinksIfOwnerMatch</literal>, Apache directive</primary></indexterm>
nb_no: <literal>SymlinksIfOwnerMatch</literal> forteller også at tjeneren skal følge symbolske lenker, men bare når koblingen og målet har samme eier. <indexterm><primary><literal>SymlinksIfOwnerMatch</literal>, Apache-direktiv</primary></indexterm>
vi_vn: <literal>SymlinksIfOwnerMatch</literal> cũng bảo máy phục vụ đi theo các đường dẫn tượng trưng (symbolic links), nhưng chỉ khi đường dẫn và đích của nó có chung một người sở hữu. <indexterm><primary><literal>SymlinksIfOwnerMatch</literal>, chỉ thị Apache</primary></indexterm>

source: <literal>Includes</literal> enables <emphasis>Server Side Includes</emphasis> (<emphasis>SSI</emphasis> for short). These are directives embedded in HTML pages and executed on the fly for each request. <indexterm><primary><literal>Includes</literal>, Apache directive</primary></indexterm>
nb_no: <literal>Includes</literal> aktiverer <emphasis>Server Side Includes</emphasis> (<emphasis>SSI</emphasis> i korthet). Dette er direktiver som er innebygd i HTML-sider, og utført underveis for hver forespørsel. <indexterm><primary><literal>Includes</literal>, Apache-direktiv</primary></indexterm>
vi_vn: <literal>Includes</literal> kích hoạt <emphasis>Các Hướng dẫn Kèm tập tin bên Máy phục vụ(Server Side Includes)</emphasis>(ngắn gọn là <emphasis>SSI</emphasis>). Những chỉ thị này được nhúng vào các trang HTML và thực thi theo yêu cầu. <indexterm><primary><literal>Includes</literal>, Apache directive</primary></indexterm>

source: <literal>Indexes</literal> tells the server to list the contents of a directory if the HTTP request sent by the client points at a directory without an index file (ie, when no files mentioned by the <literal>DirectoryIndex</literal> directive exists in this directory). <indexterm><primary><literal>Indexes</literal>, Apache directive</primary></indexterm>
nb_no: <literal>Indexes</literal> forteller at tjeneren skal vise innholdet i en katalog hvis HTTP-forespørselen sendt av klienten peker på en katalog uten en indeksfil (dvs. når ingen filer nevnt av <literal>DirectoryIndex</literal>-direktivet finnes i denne mappen). <indexterm><primary><literal>Indexes</literal>, Apache-direktiv</primary></indexterm>
vi_vn: <literal>Indexes</literal> bảo máy phục vụ liệt kê nội dung của một thư mục nếu yêu cầu HTTP gửi bởi một chương trình khách chỉ đến một thư mục mà không có tập tin chỉ mục (index file) (nghĩa là khi không có tập tin nào được đề cập đến trong chỉ thị <literal>DirectoryIndex</literal> tồn tại trong thư mục này). <indexterm><primary><literal>Indexes</literal>, chỉ thị Apache</primary></indexterm>

source: <literal>MultiViews</literal> enables content negotiation; this can be used by the server to return a web page matching the preferred language as configured in the browser. <indexterm><primary><literal>MultiViews</literal>, Apache directive</primary></indexterm>
nb_no: <literal>MultiViews</literal> muliggjør forhandlinger om innholdet. Denne kan brukes av tjeneren for å returnere en nettside som matcher det foretrukne språket som er konfigurert i nettleseren. <indexterm><primary><literal>MultiViews</literal>, Apache-direktiv</primary></indexterm>
vi_vn: <literal>MultiViews</literal> kích hoạt việc đàm phán về nội dung; điều này có thể được sử dụng bởi một máy phục vụ để trả về một trang web hợp với ngôn ngữ ưu tiên được cấu hình trong trình duyệt. <indexterm><primary><literal>MultiViews</literal>, chỉ thị Apache</primary></indexterm>

source: <emphasis>BACK TO BASICS</emphasis> <filename>.htaccess</filename> file
nb_no: <emphasis>DET GRUNNLEGGENDE</emphasis> <filename>.htaccess</filename>-filen
vi_vn: <emphasis>TRỞ VỀ CƠ BẢN</emphasis> tập tin <filename>.htaccess</filename>

source: The <filename>.htaccess</filename> file contains Apache configuration directives enforced each time a request concerns an element of the directory where it is stored. The scope of these directives also recurses to all the subdirectories within.
nb_no: Filen <filename>.htaccess</filename> inneholder konfigurasjonsdirektiver for Apache som utføres hver gang en forespørsel om et element i katalogen der den er lagret. Definisjonsområdet for disse direktivene gjentas også for alle underkatalogene.
vi_vn: Tập tin <filename>.htaccess</filename> chứa các chỉ thị cấu hình Apache được thực thi mỗi lần một yêu cầu cần đến một phần tử của một thư mục nơi nó được lưu. Phạm vi của những chỉ thị này sẽ đi sâu xuống các thư mục con bên trong nó.

source: Most of the directives that can occur in a <literal>Directory</literal> block are also legal in a <filename>.htaccess</filename> file.
nb_no: De fleste direktiver som kan forekomme i en <literal>Directory</literal>-blokk gjelder også for en <filename>.htaccess</filename>-fil.
vi_vn: Đa số những chỉ thị có thể xảy ra trong khối <literal>Directory</literal> cũng hợp lệ trong tập tin <filename>.htaccess</filename>.

source: The <literal>AllowOverride</literal> directive lists all the options that can be enabled or disabled by way of a <filename>.htaccess</filename> file. A common use of this option is to restrict <literal>ExecCGI</literal>, so that the administrator chooses which users are allowed to run programs under the web server's identity (the <literal>www-data</literal> user).
nb_no: Direktivet <literal>AllowOverride</literal> lister opp alle alternativer som kan aktiveres eller deaktiveres ved hjelp av en <filename>.htaccess</filename>-fil. En vanlig bruk av dette valget er til å begrense <literal>ExecCGI</literal>, slik at administratoren velger hvilke brukere som har lov til å kjøre programmer under nett-tjenerens identitet (<literal>www-data</literal>-brukeren).
vi_vn: Chỉ thị <literal>AllowOverride</literal> liệt kê tất cả những lựa chọn được kích hoạt hay được tắt bởi tập tin <filename>.htaccess</filename>. Một mục đích sử dụng của lựa chọn này là để giới hạn <literal>ExecCGI</literal>, để cho nhà quản trị hệ thống lựa chọn những người sử dụng nào được cho phép chạy các chương trình dưới danh xưng của máy phục vụ web (tài khoản <literal>www-data</literal>).

source: Requiring Authentication
nb_no: Å kreve autentisering
vi_vn: Ràng buộc Chứng thực

source: <primary>web authentication</primary>
nb_no: <primary>web-autentiseringn</primary>
vi_vn: <primary>chứng thực web</primary>

source: In some circumstances, access to part of a website needs to be restricted, so only legitimate users who provide a username and a password are granted access to the contents.
nb_no: I noen tilfeller trenges det begrenset tilgang til en del av et nettsted, slik at bare legitime brukere som gir et brukernavn og et passord får tilgang til innholdet.
vi_vn: Trong một số trường hợp, truy cập tới một phần của một trang web cần phải được giới hạn, để chỉ có những người sử dụng hợp lệ có tên tài khoản và mật mã mới được cho phép truy cập nội dung.

source: <filename>.htaccess</filename> file requiring authentication
nb_no: <filename>.htaccess</filename>-fil som krever autentisering
vi_vn: Tập tin <filename>.htaccess</filename> bắt buộc chứng thực

source: <emphasis>SECURITY</emphasis> No security
nb_no: <emphasis>SIKKERHET</emphasis> Ingen sikkerhet
vi_vn: <emphasis>AN NINH</emphasis> Không an toàn

source: The authentication system used in the above example (<literal>Basic</literal>) has minimal security as the password is sent in clear text (it is only encoded as <emphasis>base64</emphasis>, which is a simple encoding rather than an encryption method). It should also be noted that the documents “protected” by this mechanism also go over the network in the clear. If security is important, the whole HTTP connection should be encrypted with SSL.
nb_no: Autentiseringssystemet som brukes i eksempelet ovenfor (<literal>Basic</literal>) har minimal sikkerhet når passordet sendes i klartekst (det er bare kodet som <emphasis>base64</emphasis>, som er en enkel innkoding snarere enn en krypteringsmetode). Det bør også bemerkes at de dokumenter som er «beskyttet» av denne mekanismen også går over nettverket i klartekst. Hvis sikkerhet er viktig, bør hele HTTP-tilkobling krypteres med SSL.
vi_vn: Hệ thống chứng thực sử dụng trong ví dụ trên (<literal>Basic</literal>) có độ an toàn rất thấp bởi mật mã được gửi đi dưới dạng chữ (nó chỉ được mã hóa dưới dạng <emphasis>base64</emphasis>, vốn là một dạng mã đơn giản hơn là một phương thức mã hóa). Cũng cần phải ghi chú rằng những tài liệu “được bảo vệ” bởi cơ chế này cũng di chuyển trên mạng không có ai trông coi. Nếu an ninh cần được coi trọng, toàn bộ kết nối HTTP nên được mã hóa với SSL.

source: The <filename>/etc/apache2/authfiles/htpasswd-private</filename> file contains a list of users and passwords; it is commonly manipulated with the <command>htpasswd</command> command. For example, the following command is used to add a user or change their password: <indexterm><primary><command>htpasswd</command></primary></indexterm>
nb_no: Filen <filename>/etc/apache2/authfiles/htpasswd-private</filename> inneholder en liste over brukere og passord. Den er ofte håndtert med <command>htpasswd</command>-kommandoen. For eksempel brukes følgende kommando til å legge til en bruker eller endre passordet deres: <indexterm><primary><command>htpasswd</command></primary></indexterm>
vi_vn: Tập tin <filename>/etc/apache2/authfiles/htpasswd-private</filename> chứa một danh sách các tên tài khoản và mật mã; nó thường được chỉnh sửa bởi lệnh <command>htpasswd</command>. Ví dụ, lệnh sau được sử dụng để thêm một tài khoản hoặc thay đổi mật mã: <indexterm><primary><command>htpasswd</command></primary></indexterm>

source: <computeroutput># </computeroutput><userinput>htpasswd /etc/apache2/authfiles/htpasswd-private <replaceable>user</replaceable> </userinput><computeroutput>New password: Re-type new password: Adding password for user <replaceable>user</replaceable> </computeroutput>
vi_vn: <computeroutput># </computeroutput><userinput>htpasswd /etc/apache2/authfiles/htpasswd-private <replaceable>user</replaceable> </userinput><computeroutput>Mật mã mới: Nhập lại mật mã mới: Thêm mật mã cho tài khoản <replaceable>user</replaceable> </computeroutput>

source: Restricting Access
nb_no: Adgangsbegrensning
vi_vn: Giới hạn truy cập

source: <primary>web access restriction</primary>
nb_no: <primary>nettilgang begrensning</primary>
vi_vn: <primary>Giới hạn truy cập web</primary>

source: The <literal>Require</literal> directive controls access restrictions for a directory (and its subdirectories, recursively).
nb_no: Direktivet <literal>Require</literal> regulerer adgangsbegrensninger for en katalog (og gjentatt for katalogens undermapper).
vi_vn: Chỉ thị <literal>Require</literal> kiểm soát các giới hạn truy cập cho một thư mục (và những thư mục con, và tiếp tục như vậy cho chúng).

source: <primary><literal>Require</literal>, Apache directive</primary>
nb_no: <primary><literal>Require</literal>, Apache direktiv</primary>
vi_vn: <primary><literal>Require</literal>, chỉ thị Apache</primary>

source: It can be used to restrict access based on many criteria; we will stop at describing access restriction based on the IP address of the client, but it can be made much more powerful than that, especially when several <literal>Require</literal> directives are combined within a <literal>RequireAll</literal> block.
nb_no: Den kan brukes til å begrense adgangen basert på flere kriterier: Vi vil stoppe med å beskrive adgangsbegrensning basert på klientens IP-adresse, men det kan gjøres mye kraftigere enn det, særlig når flere <literal>Require</literal>-direktiver kombineres i en <literal>RequireAll</literal>-blokk.
vi_vn: Nó có thể được sử dụng để giới hạn truy cập dựa trên nhiều điều kiện; chúng ta sẽ ngưng tại việc mô tả giới hạn truy cập dựa trên địa chỉ IP của chương trình khách, nhưng nó có thể được làm cho mạnh hơn thế, đặc biệt khi vài chỉ thị <literal>Require</literal> được kết hợp trong một khối <literal>RequireAll</literal>.

source: Only allow from the local network
nb_no: Tillat bare fra det lokale nettverket
vi_vn: Chỉ cho phép từ mạng nội bộ

source: <emphasis>ALTERNATIVE</emphasis> Old syntax
nb_no: <emphasis>ALTERNATIV</emphasis> Gammel syntaks
vi_vn: <emphasis>LỰA CHỌN THAY THẾ</emphasis> Cú pháp cũ

source: The <literal>Require</literal> syntax is only available in Apache 2.4 (the version in <emphasis role="distribution">Jessie</emphasis>). For users of <emphasis role="distribution">Wheezy</emphasis>, the Apache 2.2 syntax is different, and we describe it here mainly for reference, although it can also be made available in Apache 2.4 using the <literal>mod_access_compat</literal> module.
nb_no: <literal>Require</literal>-syntaksen er bare tilgjengelig i Apache 2.4 (versjonen i <emphasis role="distribution">Jessie</emphasis>). For brukere av <emphasis role="distribution">Wheezy</emphasis> er Apache 2,2-syntaksen forskjellig, og her beskriver vi den hovedsakelig som referanse, selv om den også kan gjøres tilgjengelig i Apache 2,4 ved hjelp av <literal>mod_access_compat</literal>-modulen.
vi_vn: Cú pháp <literal>Require</literal> chỉ tồn tại trong Apache 2.4 (phiên bản có trong <emphasis role="distribution">Jessie</emphasis>). Với những người sử dụng của <emphasis role="distribution">Wheezy</emphasis>, cú pháp Apache 2.2 rất khác biệt, và chúng ta mô tả nó ở đây chủ yếu để tham khảo, mặc dù nó có thể được hỗ trợ trong Apache 2.4 bằng mô-đun <literal>mod_access_compat</literal>.

source: The <literal>Allow from</literal> and <literal>Deny from</literal> directives control access restrictions for a directory (and its subdirectories, recursively).
nb_no: Direktivene <literal>Allow from</literal> og <literal>Deny from</literal> kontrollerer adgangsbegrensninger for en katalog (og gjentatt for katalogens undermapper).
vi_vn: Các chỉ thị <literal>Allow from</literal> và <literal>Deny from</literal> kiểm soát các giới hạn truy cập cho một thư mục (và các thư mục con, và lại tiếp tục như vậy).

source: <primary><literal>Allow from</literal>, Apache directive</primary>
nb_no: <primary><literal>Allow from</literal>, Apache direktiv</primary>
vi_vn: <primary><literal>Allow from</literal>, chỉ thị Apache</primary>

source: <primary><literal>Deny from</literal>, Apache directive</primary>
nb_no: <primary><literal>Deny from</literal>, Apache direktiv</primary>
vi_vn: <primary><literal>Deny from</literal>, chỉ thị Apache</primary>

source: <primary><literal>Order</literal>, Apache directive</primary>
nb_no: <primary><literal>Order</literal>, Apache direktiv</primary>
vi_vn: <primary><literal>Order</literal>, chỉ thị Apache</primary>
