Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: SELinux uses a set of rules — collectively known as a <emphasis>policy</emphasis> — to authorize or forbid operations. Those rules are difficult to create. Fortunately, two standard policies (<emphasis>targeted</emphasis> and <emphasis>strict</emphasis>) are provided to avoid the bulk of the configuration work.
nb_no: SELinux bruker et sett med regler — kollektivt kjent som en <emphasis>policy</emphasis> — for å godkjenne eller forby operasjoner. Disse reglene er vanskelige å lage. Heldigvis er to standardregler (<emphasis>targeted</emphasis> og <emphasis>strict</emphasis>) laget for å unngå mesteparten av konfigurasjonsarbeidet.

source: With SELinux, the management of rights is completely different from traditional Unix systems. The rights of a process depend on its <emphasis>security context</emphasis>. The context is defined by the <emphasis>identity</emphasis> of the user who started the process, the <emphasis>role</emphasis> and the <emphasis>domain</emphasis> that the user carried at that time. The rights really depend on the domain, but the transitions between domains are controlled by the roles. Finally, the possible transitions between roles depend on the identity.
nb_no: Med SELinux, er nåndteringen av rettighetene helt forskjellig fra tradisjonelle Unix-systemer. Rettighetene til en prosess er avhengig av sin <emphasis>security context</emphasis>. Denne konteksten er definert av <emphasis>identity</emphasis> til brukeren som startet prosessen, <emphasis>role</emphasis> og <emphasis>domain</emphasis> som brukeren hadde med seg på det tidspunktet. Rettighetene egentlig avhengig av domenet, men overgangene mellom domenene er kontrollert av rollene. Til slutt, de mulige overgangene mellom roller avhenger av identiteten.

source: Security contexts and Unix users
nb_no: Sikkerhetskontekster og Unix-brukere

source: In practice, during login, the user gets assigned a default security context (depending on the roles that they should be able to endorse). This defines the current domain, and thus the domain that all new child processes will carry. If you want to change the current role and its associated domain, you must call <command>newrole -r <replaceable>role_r</replaceable> -t <replaceable>domain_t</replaceable></command> (there's usually only a single domain allowed for a given role, the <literal>-t</literal> parameter can thus often be left out). This command authenticates you by asking you to type your password. This feature forbids programs to automatically switch roles. Such changes can only happen if they are explicitly allowed in the SELinux policy.
nb_no: I praksis får brukeren, under innlogging, tildelt en standard sikkerhetskontekst (avhengig av hvilke roller de skal være i stand til å støtte). Dette definerer det gjeldende domenet, og dermed domenet som alle nye avleggerprosesser vil ha. Hvis du ønsker å endre nåværende rolle og tilhørende domene, må du påkalle <command>newrole -r <replaceable>role_r</replaceable> -t <replaceable>domain_t</replaceable></command> (Det er vanligvis bare ett enkelt domene som er tillatt for en gitt rolle, <literal>-t</literal> parameteren kan derfor utelates). Denne kommandoen godkjenner du ved å be deg skrive inn passordet ditt. Denne funksjonen forbyr programmer å automatisk bytte roller. Slike endringer kan bare skje dersom de er uttrykkelig tillatt i Parameteren kan derfor ofte bli utelatt). Denne kommandoen godkjenner du ved å be deg skrive inn passordet ditt. Denne funksjonen forbyr programmer for å automatisk bytte roller. Slike endringer kan bare skje dersom de er uttrykkelig tillatt i SELinuxs politikk.

source: Obviously the rights do not apply to all <emphasis>objects</emphasis> (files, directories, sockets, devices, etc.). They can vary from object to object. To achieve this, each object is associated to a <emphasis>type</emphasis> (this is known as labeling). Domains' rights are thus expressed with sets of (dis)allowed operations on those types (and, indirectly, on all objects which are labeled with the given type).
nb_no: Sekvsagt gjelder ikke rettighetene for alle <emphasis>objects</emphasis> (filer, kataloger, stikkontakter, enheter, etc.). De kan variere fra objekt til objekt. For å oppnå dette, blir hvert objekt forbundet til en <emphasis>type</emphasis> (Dette kalles merking). Domenene sine rettigheter er dermed uttrykt med sett (dis)tillatte operasjoner for disse typene (og, indirekte, for alle objekter som er merket med den gitte typen).

source: <emphasis>EXTRA</emphasis> Domains and types are equivalent
nb_no: <emphasis>EXTRA</emphasis> Domener og typer er tilsvarer hverandre

source: Internally, a domain is just a type, but a type that only applies to processes. That's why domains are suffixed with <literal>_t</literal> just like objects' types.
nb_no: Internt er et domene bare en type, men en type som bare gjelder for prosesser. Det er derfor domener er suffikset med <literal>_t</literal> akkurat likt objektenes typer.

source: By default, a program inherits its domain from the user who started it, but the standard SELinux policies expect many important programs to run in dedicated domains. To achieve this, those executables are labeled with a dedicated type (for example <command>ssh</command> is labeled with <literal>ssh_exec_t</literal>, and when the program starts, it automatically switches to the <literal>ssh_t</literal> domain). This automatic domain transition mechanism makes it possible to grant only the rights required by each program. It is a fundamental principle of SELinux.
nb_no: Som standard arver et program sitt domene fra brukeren som startet det, men standard SELinux politikk forventer at mange viktige programmer kjører i øremerkede domener. For å oppnå dette, er disse kjørbare merket med en øremerket type (for eksempel er <command>ssh_t</command> merket med <literal>ssh_exec_t</literal>, og når et program starter, skifter det automatisk til <literal>ssh_t</literal>-domenet). Denne automatiske domene-overgangsmekanismen gjør det mulig å gi bare de rettigheter som kreves av hvert program. Dette er et grunnleggende prinsipp for SELinux.

source: Automatic transitions between domains
nb_no: Automatiske overganger mellom domenter

source: <emphasis>IN PRACTICE</emphasis> Finding the security context
nb_no: <emphasis>IN PRACTICE</emphasis> Å finne sikkerhetskonteksten

source: To find the security context of a given process, you should use the <literal>Z</literal> option of <command>ps</command>.
nb_no: For å finne sikkerhetskonteksten for en gitt prosess, bør du bruke <literal>Z</literal> option of <command>ps</command>.

source: The first field contains the identity, the role, the domain and the MCS level, separated by colons. The MCS level (<emphasis>Multi-Category Security</emphasis>) is a parameter that intervenes in the setup of a confidentiality protection policy, which regulates the access to files based on their sensitivity. This feature will not be explained in this book.
nb_no: Det første feltet inneholder identitet, rolle, domenet og MCS-nivå, atskilt med kolon. MCS-nivået (<emphasis>Multi-Category Security</emphasis>) er et parameter som griper inn i oppsettet av en taushetsbeskyttelsespolitikk, som regulerer tilgang til filer basert på deres følsomhet. Denne funksjonen blir ikke forklart i denne boken.

source: To find the current security context in a shell, you should call <command>id -Z</command>.
nb_no: For å finne den gjeldende sikkerhetskonteksten i et skall, bør du påkalle <command>id -Z</command>.

source: Finally, to find the type assigned to a file, you can use <command>ls -Z</command>.
nb_no: Til slutt, for å finne en type knyttet til en fil, kan du bruke <command>ls -Z</command>.

source: It is worth noting that the identity and role assigned to a file bear no special importance (they are never used), but for the sake of uniformity, all objects get assigned a complete security context.
nb_no: Det er verdt å merke seg at identitet og rolle tilordnet til en fil, ikke har noen spesiell betydning (de er aldri brukt), men av hensyn til ensartetheten, blir alle objekter tildelt en komplett sikkerhetskontekst.

source: Setting Up SELinux
nb_no: Å sette opp SELinux

source: SELinux support is built into the standard kernels provided by Debian. The core Unix tools support SELinux without any modifications. It is thus relatively easy to enable SELinux.
nb_no: SELinux-støtte er innebygd i standardkjernene som følger med Debian. Kjernen i Unix-verktøyet støtter SELinux uten noen modifikasjoner. Det er dermed relativt enkelt å aktivere SELinux.

source: The <command>apt install selinux-basics selinux-policy-default</command> command will automatically install the packages required to configure an SELinux system.
nb_no: <command>apt install selinux-basics selinux-policy-default</command>-kommandoen vil automatisk installere de nødvendige pakkene til å konfigurere et SELinux system.

source: <emphasis>CAUTION</emphasis> Reference policy not in jessie
nb_no: <emphasis>CAUTION</emphasis> Referansepolitikken er ikke i Jessie

source: Unfortunately the maintainers of the <emphasis role="pkg">refpolicy</emphasis> source package did not handle release critical bugs on their package and the package got removed from jessie. This means that the <emphasis role="pkg">selinux-policy-*</emphasis> packages are currently not installable in jessie and need to be fetched from another place. Hopefully they will come back in one of the point releases or in jessie-backports. In the meantime, you can grab them from unstable.
nb_no: Uheldigvis, vedlikeholderne av <emphasis role="pkg">refpolicy</emphasis>-kildepakken håndterte ikke utsending av kritiske feil i sin pakke og pakken ble fjernet fra Jessie. Dette betyr at <emphasis role="pkg">selinux-policy-*</emphasis>-pakkene for øyeblikket ikke er installerbare i Jessie og må hentes fra et annet sted. Forhåpentligvis vil de komme tilbake i en av punktversjonene eller i Jessie-backports . I mellomtiden kan du hente dem fra ustabil-versjonen.

source: This sad situation at least proves that SELinux is not very popular in the set of users/developers who are running the development versions of Debian. Thus, if you opt to use SELinux, you should expect the default policy to not work perfectly and you will have to invest quite some time to make it suitable to your specific needs.
nb_no: Denne trist situasjonen beviser i det minste at SELinux er ikke veldig populær i blant brukere/utviklere som kjører utviklingsversjoner av Debian. Dermed, hvis du velger å bruke SELinux, bør du forvente at standardregelen ikke fungerer perfekt, og at du blir nødt til å investere litt tid for å gjøre den egnet til dine spesifikke behov.

source: The <emphasis role="pkg">selinux-policy-default</emphasis> package contains a set of standard rules. By default, this policy only restricts access for a few widely exposed services. The user sessions are not restricted and it is thus unlikely that SELinux would block legitimate user operations. However, this does enhance the security of system services running on the machine. To setup a policy equivalent to the old “strict” rules, you just have to disable the <literal>unconfined</literal> module (modules management is detailed further in this section).
nb_no: <emphasis role="pkg">selinux-policy-default</emphasis>-pakken inneholder et sett med vanlige regler. Som standard begrenser disse reglene kun tilgang til noen allment synlige tjenester. Brukersesjoner er ikke begrenset, og det er derfor usannsynlig at SELinux ville blokkere legitime brukeroperasjoner. Men dette forbedrer sikkerheten i systemtjenester som kjører på maskinen. For å sette opp et opplegg som tilsvarer de gamle "strenge" reglene, er det bare å deaktivere <literal>unconfined</literal>-modulen (modulhåndtering er beskrevet nærmere i denne seksjonen).

source: Once the policy has been installed, you should label all the available files (which means assigning them a type). This operation must be manually started with <command>fixfiles relabel</command>.
nb_no: Når opplegget er installert, bør du merke alle tilgjengelige filer (som betyr å tildele dem en type). Denne operasjonen må startes manuelt med <command>fixfiles relabel</command>.

source: The SELinux system is now ready. To enable it, you should add the <literal>selinux=1 security=selinux</literal> parameter to the Linux kernel. The <literal>audit=1</literal> parameter enables SELinux logging which records all the denied operations. Finally, the <literal>enforcing=1</literal> parameter brings the rules into application: without it SELinux works in its default <emphasis>permissive</emphasis> mode where denied actions are logged but still executed. You should thus modify the GRUB bootloader configuration file to append the desired parameters. One easy way to do this is to modify the <literal>GRUB_CMDLINE_LINUX</literal> variable in <filename>/etc/default/grub</filename> and to run <command>update-grub</command>. SELinux will be active after a reboot.
nb_no: SELinux-systemet er nå klart. For å aktivere det, bør du legge <literal>selinux=1 security=selinux</literal>-parameteret til Linux-kjernen. <literal>audit=1</literal>-parameteret aktiver SELinux-logging med registrering av alle de nektede operasjonene. Endelig tar <literal>enforcing=1</literal>-parameteret reglene i bruk: Uten det virker SELinux i sin standard <emphasis>permissive</emphasis>-modus der avviste handlinger logges, men fremdeles blir utført. Du bør derfor endre GRUBs oppstarskonfigurasjonsfil ved å legge til de ønskede parametere. En enkel måte å gjøre dette på er å modifisere <literal>GRUB_CMDLINE_LINUX</literal>-variabelen i <filename>/etc/default/grub</filename> og å kjøre <command>update-grub</command>. SELinux vil være aktivert etter en omstart.

source: It is worth noting that the <command>selinux-activate</command> script automates those operations and forces a labeling on next boot (which avoids new non-labeled files created while SELinux was not yet active and while the labeling was going on).
nb_no: Det er verdt å merke seg at <command>selinux-activate</command>-skriptet automatiserer disse operasjonene og tvinger en merking ved neste oppstart (som unngår nye ikke-merkede filer som er opprettet mens SELinux ennå ikke var aktiv og mens merking skjer).

source: Managing an SELinux System
nb_no: Å håndtere SELinux system

source: The SELinux policy is a modular set of rules, and its installation detects and enables automatically all the relevant modules based on the already installed services. The system is thus immediately operational. However, when a service is installed after the SELinux policy, you must be able to manually enable the corresponding module. That is the purpose of the <command>semodule</command> command. Furthermore, you must be able to define the roles that each user can endorse, and this can be done with the <command>semanage</command> command.
nb_no: SELinux-opplegget et modulbasert sett med regler, og installasjonen oppdager og aktiverer automatisk alle relevante moduler basert på den allerede installerte tjenesten. Systemet er dermed umiddelbart i drift. Men når en tjeneste er installert etter SELinux-opplegget, må du klare å aktivere den tilsvarende modulen manuelt. Det er hensikten med <command>semodule</command>-komandoen. Videre kan du klare å definere rollene som hver bruker kan slutte seg til, og dette kan gjøres med <command>semanage</command>-kommandoen.

source: Those two commands can thus be used to modify the current SELinux configuration, which is stored in <filename>/etc/selinux/default/</filename>. Unlike other configuration files that you can find in <filename>/etc/</filename>, all those files must not be changed by hand. You should use the programs designed for this purpose.
nb_no: De to kommandoer kan dermed brukes til å endre den gjeldende SELinux-konfigurasjonen, lagret i <filename>/etc/selinux/default/</filename>. I motsetning til andre konfigurasjonsfiler du finner i <filename>/etc/</filename>, skal ikke alle disse filene endres for hånd. Du bør bruke programmer som er laget til dette formålet.

source: <emphasis>GOING FURTHER</emphasis> More documentation
nb_no: <emphasis>GOING FURTHER</emphasis> Mer dokumentasjon

source: Since the NSA doesn't provide any official documentation, the community set up a wiki to compensate. It brings together a lot of information, but you must be aware that most SELinux contributors are Fedora users (where SELinux is enabled by default). The documentation thus tends to deal specifically with that distribution. <ulink type="block" url="http://www.selinuxproject.org" />
nb_no: Ettersom NSA ikke gir noen offisiell dokumentasjon, har community satt opp en wiki for å kompensere. Den bringer sammen en masse informasjon, men du må være klar over at de fleste SELinux-bidragsytere er Fedora-brukere (der SELinux er aktivert som standard). Dokumentasjonen tenderer dermed til å håndtere spesielt den distribusjonen. <ulink type="block" url="http://www.selinuxproject.org" />

source: You should also have a look at the dedicated Debian wiki page as well as Russell Coker's blog, who is one of the most active Debian developers working on SELinux support. <ulink type="block" url="http://wiki.debian.org/SELinux" /> <ulink type="block" url="http://etbe.coker.com.au/tag/selinux/" />
nb_no: Du bør også ta en titt på den dedikerte Debian wiki-siden, samt Russell Cokers blogg, som er en av de mest aktive Debian-utviklere som jobber med SELinux støtte. <ulink type="block" url="http://wiki.debian.org/SELinux" /> <ulink type="block" url="http://etbe.coker.com.au/tag/selinux/" />

source: Managing SELinux Modules
nb_no: Å håndtere SELinux moduler

source: Available SELinux modules are stored in the <filename>/usr/share/selinux/default/</filename> directory. To enable one of these modules in the current configuration, you should use <command>semodule -i <replaceable>module.pp.bz2</replaceable></command>. The <emphasis>pp.bz2</emphasis> extension stands for <emphasis>policy package</emphasis> (compressed with bzip2).
nb_no: Tilgjengelige SELinux-moduler er lagret i <filename>/usr/share/selinux/default/</filename>-mappen. For å aktivere en av disse modulene i den gjeldende konfigurasjonen, bør du bruke <command>semodule -i <replaceable>module.pp.bz2</replaceable></command>. <emphasis>pp.bz2</emphasis>-forlengelsen står for <emphasis>policy package</emphasis> (compressed with bzip2).

source: Removing a module from the current configuration is done with <command>semodule -r <replaceable>module</replaceable></command>. Finally, the <command>semodule -l</command> command lists the modules which are currently installed. It also outputs their version numbers. Modules can be selectively enabled with <command>semodule -e</command> and disabled with <command>semodule -d</command>.
nb_no: Å fjerne en modul fra den gjeldende konfigurasjonen gjøres med <command>semodule -r <replaceable>module</replaceable></command>. Til slutt, lister <command>semodule -l</command>-kommandoen modulene som er installert. De gir også sine også sine versjonsnumre. Moduler kan selektivt aktiveres med <command>semodule -e</command> og slås av med <command>semodule -d</command>.

source: <command>semodule</command> immediately loads the new configuration unless you use its <literal>-n</literal> option. It is worth noting that the program acts by default on the current configuration (which is indicated by the <literal>SELINUXTYPE</literal> variable in <filename>/etc/selinux/config</filename>), but that you can modify another one by specifying it with the <literal>-s</literal> option.
nb_no: <command>semodule</command> laster umiddelabart den nye konfigurasjonen om ikke du bruker dens <literal>-n</literal>-valg. Det er verdt å merke seg at programmet er standard på den gjeldende konfigurasjonen (som er angitt av <literal>SELINUXTYPE</literal>-variabelen i <filename>/etc/selinux/config</filename>), men at du kan endre en annen ved å spesifisere den med <literal>-s</literal>-valget.

source: Managing Identities
nb_no: Å håndtere identiteter

source: Every time that a user logs in, they get assigned an SELinux identity. This identity defines the roles that they will be able to endorse. Those two mappings (from the user to the identity and from this identity to roles) are configurable with the <command>semanage</command> command.
nb_no: Hver gang en bruker logger inn, får de tildelt en SELinux-identitet. Denne identiteten definerer rollene de kan støtte. Disse to adressingene (fra brukeren til identiteten og fra denne identiteten til roller) kan konfigureres med <command>semanage</command>-kommandoen.

source: You should definitely read the <citerefentry><refentrytitle>semanage</refentrytitle><manvolnum>8</manvolnum></citerefentry> manual page, even if the command's syntax tends to be similar for all the concepts which are managed. You will find common options to all sub-commands: <literal>-a</literal> to add, <literal>-d</literal> to delete, <literal>-m</literal> to modify, <literal>-l</literal> to list, and <literal>-t</literal> to indicate a type (or domain).
nb_no: Du bør absolutt lese manualsiden <citerefentry><refentrytitle>semanage</refentrytitle><manvolnum>8</manvolnum></citerefentry>, selv om kommando-syntaksen tenderer til å være lik for alle begrepene som håndteres. Du vil finne vanlige valg til alle underkommandoer:<literal>-a</literal> for å legge til, <literal>-d</literal> for å trekke fra, <literal>-m</literal> for å modifisere, <literal>-l</literal> til å liste, og <literal>-t</literal> for å indikere en type (eller et domene).

source: <command>semanage login -l</command> lists the current mapping between user identifiers and SELinux identities. Users that have no explicit entry get the identity indicated in the <literal>__default__</literal> entry. The <command>semanage login -a -s user_u <replaceable>user</replaceable></command> command will associate the <emphasis>user_u</emphasis> identity to the given user. Finally, <command>semanage login -d <replaceable>user</replaceable></command> drops the mapping entry assigned to this user.
nb_no: <command>semanage login -l</command> lister gjeldende adressering mellom brukeridentifisere og SELinux-identiteter. Brukere som ikke har noen eksplisitt inngang får identiteten angitt i <literal>__default__</literal>-inngangen. <command>semanage login -a -s user_u <replaceable>user</replaceable></command>-kommandoen vil knytte <emphasis>user_u</emphasis>-identiteten til den gitte brukeren. Tilslutt, <command>semanage login -d <replaceable>user</replaceable></command> dropper asdresserings-inngangen knyttet til denne brukeren.
