Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: Some time later, this access was used to download, install and run an IRC <emphasis>bot</emphasis> that connected to an underground IRC network. The bot could then be controlled via this protocol and instructed to download files for sharing. This program even has its own log file:
nb_no: En tid senere ble denne tilgangen brukt til å laste ned, installere og kjøre en IRC <emphasis>bot</emphasis> som er koblet til et underjordisk IRC-nettverk. Oppstarten kan da styres via denne protokollen og instrueres til å laste ned filer til deling. Dette programmet har også sin egen loggfil:

source: These traces show that two video files have been stored on the server by way of the 82.50.72.202 IP address.
nb_no: Disse sporene viser at to videofiler er lagret på tjeneren ved hjelp av IP-adressen 82.50.72.202.

source: In parallel, the attacker also downloaded a pair of extra files, <filename>/tmp/pt</filename> and <filename>/tmp/loginx</filename>. Running these files through <command>strings</command> leads to strings such as <foreignphrase>Shellcode placed at 0x%08lx</foreignphrase> and <foreignphrase>Now wait for suid shell...</foreignphrase>. These look like programs exploiting local vulnerabilities to obtain administrative privileges. Did they reach their target? In this case, probably not, since no files seem to have been modified after the initial breach.
nb_no: Parallelt har angriperen også lastet ned et par ekstra filer,<filename>/tmp/pt</filename> og <filename>/tmp/loginx</filename>. Å kjøre disse filene gjennom <command>strings</command> leder til strenger slike som <foreignphrase>Shellcode placed at 0x%08lx</foreignphrase> og <foreignphrase>Now wait for suid shell...</foreignphrase>. Disse ser ut som programmer som utnytter lokale sårbarheter for å få administrative rettigheter. Hadde de nå sine mål? I dette tilfellet sannsynligvis ikke, ettersom ingen filer synes å ha blitt modifisert etter det første innbruddet.

source: In this example, the whole intrusion has been reconstructed, and it can be deduced that the attacker has been able to take advantage of the compromised system for about three days; but the most important element in the analysis is that the vulnerability has been identified, and the administrator can be sure that the new installation really does fix the vulnerability.
nb_no: I dette eksemplet er hele inntrengningen rekonstruert, og det kan utledes at angriperen har greid å dra nytte av det kompromitterte systemet i rundt tre dager. Men det viktigste elementet i analysen er at sikkerhetsbruddet er identifisert, og administratoren kan være sikker på at den nye installasjonen virkelig fikser sårbarheten.
