Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: Once the 3 files (<filename>example.if</filename>, <filename>example.fc</filename>, and <filename>example.te</filename>) match your expectations for the new rules, just run <command>make NAME=devel</command> to generate a module in the <filename>example.pp</filename> file (you can immediately load it with <command>semodule -i example.pp</command>). If several modules are defined, <command>make</command> will create all the corresponding <filename>.pp</filename> files.
nb_no: Så snart 3 filene (<filename>example.if</filename>, <filename>example.fc</filename>, og <filename>example.te</filename>) svarer til dine forventninger til de nye reglene, kjør bare <command>make NAME=devel</command> for å generere en modul i <filename>example.pp</filename>-filen (du kan umiddelbart laste den med <command>semodule -i example.pp</command>). Hvis flere moduler er definert vil <command>make</command> lage alle de korresponderende <filename>.pp</filename>-filene.

source: Other Security-Related Considerations
nb_no: Andre sikkerhetsrelaterte overveielser

source: Security is not just a technical problem; more than anything, it is about good practices and understanding the risks. This section reviews some of the more common risks, as well as a few best practices which should, depending on the case, increase security or lessen the impact of a successful attack.
nb_no: Sikkerhet er ikke bare et teknisk problem; for mer enn noe annet, handler det om god praksis og forståelse av risiko. Denne seksjonen gjennomgår noen av de vanligste risikoene, samt noen "beste praksis"-er som, avhengig av tilfellet, bør øke sikkerheten eller minske virkningen av et vellykket angrep.

source: Inherent Risks of Web Applications
nb_no: Iboende risiko hos nett-applikasjoner

source: The universal character of web applications led to their proliferation. Several are often run in parallel: a webmail, a wiki, some groupware system, forums, a photo gallery, a blog, and so on. Many of those applications rely on the “LAMP” (<emphasis>Linux, Apache, MySQL, PHP</emphasis>) stack. Unfortunately, many of those applications were also written without much consideration for security problems. Data coming from outside is, too often, used with little or no validation. Providing specially-crafted values can be used to subvert a call to a command so that another one is executed instead. Many of the most obvious problems have been fixed as time has passed, but new security problems pop up regularly.
nb_no: Nettprogrammenes universelle karakteren førte til spredningen. Flere kjøres ofte i parallell: en nettpost, en wiki, noen gruppevaresystemer, et forum, et fotogalleri, en blogg, og så videre. Mange av disse programmene er avhengige av "LAMP" (<emphasis>Linux, Apache, MySQL, PHP</emphasis>)-stablen. Dessverre er mange av disse programmene også skrevet uten mye hensyn til sikkerhetsproblemer. Data som kommer utenfra brukes også ofte med liten eller ingen validering. Å gi spesiallagede verdier kan brukes til å undergrave et anrop til en kommando, slik at en annen blir utført i stedet. Mange av de mest åpenbare problemene er løst etter hvert som tiden har gått, men nye sikkerhetsproblemer dukker opp med jevne mellomrom.

source: <emphasis>VOCABULARY</emphasis> SQL injection
nb_no: <emphasis>VOCABULARY</emphasis> SQL injeksjon

source: When a program inserts data into SQL queries in an insecure manner, it becomes vulnerable to SQL injections; this name covers the act of changing a parameter in such a way that the actual query executed by the program is different from the intended one, either to damage the database or to access data that should normally not be accessible. <ulink type="block" url="http://en.wikipedia.org/wiki/SQL_Injection" />
nb_no: Når et program legger inn data i SQL-spørringer på en usikker måte, blir det sårbart for SQL-injeksjoner; dette navnet dekker at det lov å endre et parameter slik at den faktiske spørringen som utføres av programmet er forskjellig fra den tiltenkte, enten for å skade database eller for å få tilgang til data som normalt ikke bør være tilgjengelig. <ulink type="block" url="http://en.wikipedia.org/wiki/SQL_Injection" />

source: Updating web applications regularly is therefore a must, lest any cracker (whether a professional attacker or a script kiddy) can exploit a known vulnerability. The actual risk depends on the case, and ranges from data destruction to arbitrary code execution, including web site defacement.
nb_no: Å oppdatere nettprogrammer regelmessig er derfor et must, slik at ikke noe forsøk (enten av en profesjonell angriper eller en script kiddy) kan utnytte en kjent sårbarhet. Den faktiske risikoen avhenger av tilfellet, og spenner fra ødeleggelse av data - til kjøring av vilkårlig kode, medregnet å gjøre nettsider uleselige.

source: Knowing What To Expect
nb_no: Å vite hva som forventes

source: A vulnerability in a web application is often used as a starting point for cracking attempts. What follows is a short review of possible consequences.
nb_no: En sårbarhet i et nettprogram blir ofte brukt som utgangspunkt for inntrengningsforsøk. Her følger en kort gjennomgang av mulige konsekvenser.

source: <emphasis>QUICK LOOK</emphasis> Filtering HTTP queries
nb_no: <emphasis>QUICK LOOK</emphasis> Å filtrere HTTP-spørringer

source: Apache 2 includes modules allowing filtering incoming HTTP queries. This allows blocking some attack vectors. For instance, limiting the length of parameters can prevent buffer overflows. More generally, one can validate parameters before they are even passed to the web application and restrict access along many criteria. This can even be combined with dynamic firewall updates, so that a client infringing one of the rules is banned from accessing the web server for a given period of time.
nb_no: Apache 2 inkluderer moduler som tillater filtrering av innkommende HTTP-spørringer. Dette gjør det mulig å blokkere noen angrepsvektorer. For eksempel kan det å begrense lengden på parametrene forhindre overflom i mellomlager. Mer generelt kan man validere parametre selv før de sendes til nettprogrammet, og begrense tilgangen etter mange kriterier. Dette kan også kombineres med dynamiske brannmuroppdateringer, slik at en klient som krenker en av reglene blir utestengt fra tilgang til netttjeneren for en gitt periode.

source: Setting up these checks can be a long and cumbersome task, but it can pay off when the web application to be deployed has a dubious track record where security is concerned.
nb_no: Å sette opp disse kontrollene kan være en lang og kronglete oppgave, men det kan lønne seg når nettprogrammet som som skal utplasseres har en tvilsom merittliste når det gjelder sikkerhet.

source: <emphasis>mod-security2</emphasis> (in the <emphasis role="pkg">libapache2-mod-security2</emphasis> package) is the main such module. It even comes with many ready-to-use rules of its own (in the <emphasis role="pkg">modsecurity-crs</emphasis> package) that you can easily enable.
nb_no: <emphasis>mod-security2</emphasis> (i <emphasis role="pkg">libapache2-mod-security2</emphasis>-pakken) er den viktigste slike modulen. Den har til og med mange egne "klare til bruk"-regler (i <emphasis role="pkg">modsecurity-crs</emphasis> package) som du enkelt kan aktivere.

source: The consequences of an intrusion will have various levels of obviousness depending on the motivations of the attacker. <emphasis>Script-kiddies</emphasis> only apply recipes they find on web sites; most often, they deface a web page or delete data. In more subtle cases, they add invisible contents to web pages so as to improve referrals to their own sites in search engines.
nb_no: Konsekvensene av en inntrengning vil være synlig i ulik grad avhengig av motivasjonen til angriperen. <emphasis>Script-kiddies</emphasis> gjelder bare oppskrifter de finner på nettsider; oftest, de gjør en nettside uleselig eller de sletter data. I mer subtile tilfeller legger de inn usynlig innhold på nettsidene, slik som å forbedre henvisninger til sine egne sider i søkemotorer.

source: A more advanced attacker will go beyond that. A disaster scenario could go on in the following fashion: the attacker gains the ability to execute commands as the <literal>www-data</literal> user, but executing a command requires many manipulations. To make their life easier, they install other web applications specially designed to remotely execute many kinds of commands, such as browsing the filesystem, examining permissions, uploading or downloading files, executing commands, and even provide a network shell. Often, the vulnerability will allow running a <command>wget</command> command that will download some malware into <filename>/tmp/</filename>, then executing it. The malware is often downloaded from a foreign website that was previously compromised, in order to cover tracks and make it harder to find out the actual origin of the attack.
nb_no: En mer avansert angriper vil gå utover det. Et katastrofe-scenario kunne være dette opplegget: Angriperen får muligheten til å utføre kommandoer som <literal>www-data</literal>-bruker, men kjører en kommando som krever mange håndteringer. For å gjøre livet sitt enklere, installerer de andre nettprogrammer spesielt utformet for å fjernutføre mange typer kommandoer, som for eksempel surfing i filsystemet, å undersøke tillatelser, å laster opp eller ned filer, utføre kommandoer, og selv gi et nettverkskall. Ofte vil sårbarheten tillate å kjøre en <command>wget</command>-kommando som vil laste ned skadelig programvare til <filename>/tmp/</filename>, og så kjøre den. Den skadelige programvaren er ofte lastet ned fra en utenlandsk nettside som tidligere er kompromittert, for å dekke sporene og gjøre det vanskeligere å finne den faktiske opprinnelsen til angrepet.

source: At this point, the attacker has enough freedom of movement that they often install an IRC <emphasis>bot</emphasis> (a robot that connects to an IRC server and can be controlled by this channel). This bot is often used to share illegal files (unauthorized copies of movies or software, and so on). A determined attacker may want to go even further. The <literal>www-data</literal> account does not allow full access to the machine, and the attacker will try to obtain administrator privileges. Now, this should not be possible, but if the web application was not up-to-date, chances are that the kernel and other programs are outdated too; this sometimes follows a decision from the administrator who, despite knowing about the vulnerability, neglected to upgrade the system since there are no local users. The attacker can then take advantage of this second vulnerability to get root access.
nb_no: På dette punktet, har angriperen nok bevegelsesfrihet slik at de ofte kan installere en IRC <emphasis>bot</emphasis>(en robot som kobles til en IRC tjener og kan styres av denne kanalen). Denne boten er ofte brukt til å dele ulovlige filer (uautoriserte kopier av filmer eller programvare, og så videre). En besluttsom angriper kan ønske å gå enda lengre. <literal>www-data</literal>-kontoen gir ikke full tilgang til maskinen, og angriperen vil prøve å få administratorrettigheter. Nå, dette skal ikke være mulig, men hvis nettprogrammet ikke var oppdatert, er sjansene at kjernen og andre programmer er utdatert også; dette følger noen ganger av en avgjørelse fra administrator som, til tross for å vite om sikkerhetsproblemet, har unnlatt å oppgradere systemet siden det ikke er noen lokale brukere. Angriperen kan så dra nytte av denne andre sårbarheten for å få rot-tilgang.

source: <emphasis>VOCABULARY</emphasis> Privilege escalation
nb_no: <emphasis>VOCABULARY</emphasis> Opptrapping av privilegier

source: This term covers anything that can be used to obtain more permissions than a given user should normally have. The <command>sudo</command> program is designed for precisely the purpose of giving administrative rights to some users. But the same term is also used to describe the act of an attacker exploiting a vulnerability to obtain undue rights.
nb_no: Dette begrepet omfatter alt som kan anvendes for å oppnå ytterligere tillatelser enn en gitt bruker bør normalt ha. <command>sudo</command>.programmet er utviklet nettopp med det formål å gi administrative rettigheter til enkelte brukere. Men det samme begrepet brukes også for å beskrive handlingen når en angriper utnytter en sårbarhet å oppnå utilbørlige rettigheter.

source: Now the attacker owns the machine; they will usually try to keep this privileged access for as long as possible. This involves installing a <emphasis>rootkit</emphasis>, a program that will replace some components of the system so that the attacker will be able to obtain the administrator privileges again at a later time; the rootkit also tries hiding its own existence as well as any traces of the intrusion. A subverted <command>ps</command> program will omit to list some processes, <command>netstat</command> will not list some of the active connections, and so on. Using the root permissions, the attacker was able to observe the whole system, but didn't find important data; so they will try accessing other machines in the corporate network. Analyzing the administrator's account and the history files, the attacker finds what machines are routinely accessed. By replacing <command>sudo</command> or <command>ssh</command> with a subverted program, the attacker can intercept some of the administrator's passwords, which they will use on the detected servers… and the intrusion can propagate from then on.
nb_no: Nå eier angriper maskinen; og de vil vanligvis prøve å holde på dette privilegiet så lenge som mulig. Dette innebærer å installere en <emphasis>rootkit</emphasis>, et program som vil erstatte enkelte komponentene i systemet, slik at angriperen vil kunne få administratorrettigheter igjen på et senere tidspunkt; rootkit forsøker også å skjule sin egen eksistens samt eventuelle spor etter inntrengning. En skadelig <command>ps</command>-program vil unngå å liste noen prosesser, <command>netstat</command>vil ikke liste somn av de aktive forbindelsene, og så videre. Ved hjelp av rotrettigheter, var angriperen i stand til å observere hele systemet, men fant ikke viktige data; slik at de vil prøve å få tilgang til andre maskiner i bedriftens nettverk. Analysere administratorkontoen og historiefiler, finner angriperen hvilke maskiner som rutinemessig er benyttet. Ved å erstatte <command>sudo</command> eller <command>ssh</command> med en skadelig program, kan angriperen avskjære noen av administratorens passord, som de vil bruke på de oppdagede tjenerne ... og inntrengingen kan forplante seg derfra.

source: This is a nightmare scenario which can be prevented by several measures. The next few sections describe some of these measures.
nb_no: Dette blir et marerittscenario som kan forebygges ved flere tiltak. De neste avsnittene beskriver noen av disse tiltakene.

source: Choosing the Software Wisely
nb_no: Kloke valg av programvare

source: Once the potential security problems are known, they must be taken into account at each step of the process of deploying a service, especially when choosing the software to install. Many web sites, such as <literal>SecurityFocus.com</literal>, keep a list of recently-discovered vulnerabilities, which can give an idea of a security track record before some particular software is deployed. Of course, this information must be balanced against the popularity of said software: a more widely-used program is a more tempting target, and it will be more closely scrutinized as a consequence. On the other hand, a niche program may be full of security holes that never get publicized due to a lack of interest in a security audit.
nb_no: Så snart de potensielle sikkerhetsproblemene er kjent, må de tas hensyn til ved hvert trinn i prosessen med å legge ut en tjeneste, særlig når man velger ut programvaren som skal installeres. Mange nettsteder, for eksempel <literal>SecurityFocus.com</literal>, har en liste over nylig oppdagede sårbarheter, som kan gi en ide om sikkerhets-merittene før en spesiell programvare blir utplassert. Selvfølgelig må denne informasjonen balanseres mot populariteten til den nevnte programvaren: Et mer allment brukt programmet er et mer fristende mål, og det vil bli nærmere saumfart som en konsekvens. På den annen side kan et nisjeprogram være fullt av sikkerhetshull som aldri blir publisert på grunn av manglende interesse for en sikkerhetsgjennomgang.

source: <emphasis>VOCABULARY</emphasis> Security audit
nb_no: <emphasis>VOCABULARY</emphasis> Sikkerhetsgjennomgang

source: A security audit is the process of thoroughly reading and analyzing the source code of some software, looking for potential security vulnerabilities it could contain. Such audits are usually proactive and they are conducted to ensure a program meets certain security requirements.
nb_no: Sikkerhetsgjennomgang er prosessen med grundig lesing og analyse av kildekoden til noen programvarer, på jakt etter potensielle sikkerhetsproblemer den kan inneholde. Slike revisjoner er vanligvis proaktive og gjennomføres for å sikre et program oppfyller visse krav til sikkerhet.

source: In the Free Software world, there is generally ample room for choice, and choosing one piece of software over another should be a decision based on the criteria that apply locally. More features imply an increased risk of a vulnerability hiding in the code; picking the most advanced program for a task may actually be counter-productive, and a better approach is usually to pick the simplest program that meets the requirements.
nb_no: I verden av fri programvare, er det vanligvis rikelig rom for valg, og velge en programvare fremfor en annen bør være en beslutning basert på kriteriene som gjelder lokalt. Flere funksjoner innebærer en økt risiko for at en sårbarhet gjemmer seg i koden; Å plukke det mest avanserte programmet til en oppgave, kan faktisk virke mot sin hensikt, for en bedre tilnærming er å plukke det enkleste programmet som tilfredsstiller kravene.

source: <emphasis>VOCABULARY</emphasis> Zero-day exploit
nb_no: <emphasis>VOCABULARY</emphasis> Zero-day sårbarhet

source: A <emphasis>zero-day exploit</emphasis> attack is hard to prevent; the term covers a vulnerability that is not yet known to the authors of the program.
nb_no: Et <emphasis>zero-day exploit</emphasis>-angrep er vanskelig å hindre; Begrepet gjelder en sårbarhet som ennå ikke er kjent for forfatterne av programmet.

source: Managing a Machine as a Whole
nb_no: Å håndtere en maskin som en helhet

source: Most Linux distributions install by default a number of Unix services and many tools. In many cases, these services and tools are not required for the actual purposes for which the administrator set up the machine. As a general guideline in security matters, unneeded software is best uninstalled. Indeed, there is no point in securing an FTP server, if a vulnerability in a different, unused service can be used to get administrator privileges on the whole machine.
nb_no: De fleste Linux-distribusjoner installerer som standard en rekke Unix tjenester og mange verktøy. I mange tilfelle er disse tjenestene og verktøyene ikke påkrevd for den faktiske formål som administrator setter opp for maskinen. Som en generell retningslinje i sikkerhetssaker, er det best å avinstallere unødvendige programvare. Faktisk, det er ingen vits i å sikre en FTP-tjener, hvis en sårbarhet i en annen, ubrukt tjeneste kan brukes til å få administratorrettigheter på hele maskinen.

source: By the same reasoning, firewalls will often be configured to only allow access to services that are meant to be publicly accessible.
nb_no: Med samme resonnement, vil brannmurer ofte bli konfigurert til å kun gi tilgang til tjenester som er ment å være offentlig tilgjengelige.

source: Current computers are powerful enough to allow hosting several services on the same physical machine. From an economic viewpoint, such a possibility is interesting: only one computer to administrate, lower energy consumption, and so on. From the security point of view, however, such a choice can be a problem. One compromised service can bring access to the whole machine, which in turn compromises the other services hosted on the same computer. This risk can be mitigated by isolating the services. This can be attained either with virtualization (each service being hosted in a dedicated virtual machine or container), or with AppArmor/SELinux (each service daemon having an adequately designed set of permissions).
nb_no: Nåværende datamaskiner er kraftige nok til å være vertskap for flere tjenester på samme fysiske maskin. Fra et økonomisk synspunkt, er en slik mulighet interessant: bare én datamaskin å administrere, lavere energiforbruk, og så videre. Fra sikkerhetssynspunkt, kan et slikt valg være et problem. En kompromittert tjeneste kan gi tilgang til hele maskinen, som igjen svekker de andre tjenestene som ligger på samme datamaskin. Denne risikoen kan reduseres ved å isolere tjenestene. Dette kan oppnås enten med virtualisering (hver tjeneste legges til en egen virtuell maskin eller beholder), eller med AppArmor/SELinux (at hver tjenestenisse har et tilstrekkelig dimensjonert sett med tillatelser).

source: Users Are Players
nb_no: Brukere er spillere

source: Discussing security immediately brings to mind protection against attacks by anonymous crackers hiding in the Internet jungle; but an often-forgotten fact is that risks also come from inside: an employee about to leave the company could download sensitive files on the important projects and sell them to competitors, a negligent salesman could leave their desk without locking their session during a meeting with a new prospect, a clumsy user could delete the wrong directory by mistake, and so on.
nb_no: Å diskutere sikkerhet bringer umiddelbart tankene til beskyttelse mot angrep fra anonyme inntrengere som gjemmer seg i Internet-jungelen; Men et ofte glemt faktum er at risikoen også kommer fra innsiden: En ansatt som skal forlate selskapet kunne laste ned sensitive filer om viktige prosjekter og selge dem til konkurrentene, en uaktsom selger kan forlate arbeidsplassen uten å låse sin sesjon under et møte om et nytt prospekt, en klønete bruker kan slette feil katalog ved et uhell, og så videre.

source: The response to these risks can involve technical solutions: no more than the required permissions should be granted to users, and regular backups are a must. But in many cases, the appropriate protection is going to involve training users to avoid the risks.
nb_no: Responsen for disse risikoene kan omfatte tekniske løsninger: At ikke mer enn de nødvendige tillatelsene skal gis til brukerne, og at regelmessige sikkerhetskopier er et must. For å unngå risikoene, er i mange tilfelle brukeropplæring den hensiktsmessige beskyttelsen.

source: The <emphasis role="pkg">autolog</emphasis> package provides a program that automatically disconnects inactive users after a configurable delay. It also allows killing user processes that persist after a session ends, thereby preventing users from running daemons.
nb_no: <emphasis role="pkg">autolog</emphasis> pakken har et program som automatisk frakobler inaktive brukere etter en konfigurerbar forsinkelse. Det tillater også å stanse brukerprosesser som vedvarer etter at en økt er avsluttet, og dermed hindrer brukere fra å kjøre nisser.

source: Physical Security
nb_no: Fysisk sikkerhet
