Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: <literal>REDIRECT</literal> (only in the <literal>nat</literal> table): redirect a packet to a given port of the firewall itself; this can be used to set up a transparent web proxy that works with no configuration on the client side, since the client thinks it connects to the recipient whereas the communications actually go through the proxy.
nb_no: <literal>REDIRECT</literal> (bare i <literal>nat</literal>-tabellen): å omdirigere en pakke til en gitt port i brannmuren selv. Denne kan brukes til å sette opp en gjennomsiktig nettmellomtjener som fungerer uten konfigurasjon på klientsiden, siden klienten tror den kobles til mottakeren, mens kommunikasjonen faktisk gå gjennom mellomtjeneren.

source: Other actions, particularly those concerning the <literal>mangle</literal> table, are outside the scope of this text. The <citerefentry><refentrytitle>iptables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> and <citerefentry><refentrytitle>ip6tables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> have a comprehensive list.
nb_no: Andre handlinger, spesielt dem som gjelder <literal>mangle</literal>-tabellen, er utenfor formålet med teksten her. <citerefentry><refentrytitle>iptables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> og <citerefentry><refentrytitle>ip6tables</refentrytitle> <manvolnum>8</manvolnum></citerefentry> har en omfattende liste.

source: Syntax of <command>iptables</command> and <command>ip6tables</command>
nb_no: Syntaksen til <command>iptables</command> and <command>ip6tables</command>

source: The <command>iptables</command> and <command>ip6tables</command> commands allow manipulating tables, chains and rules. Their <literal>-t <replaceable>table</replaceable></literal> option indicates which table to operate on (by default, <literal>filter</literal>).
nb_no: <command>iptables</command> og <command>ip6tables</command>-kommandoene kan håndtere tabeller, kjeder og regler. Alternativet deres <literal>-t <replaceable>table</replaceable></literal> indikerer hvilken tabell en kan operere fra (som standard <literal>filter</literal>).

source: Commands
nb_no: Kommandoer

source: The <literal>-N <replaceable>chain</replaceable></literal> option creates a new chain. The <literal>-X <replaceable>chain</replaceable></literal> deletes an empty and unused chain. The <literal>-A <replaceable>chain</replaceable> <replaceable>rule</replaceable></literal> adds a rule at the end of the given chain. The <literal>-I <replaceable>chain</replaceable> <replaceable>rule_num</replaceable> <replaceable>rule</replaceable></literal> option inserts a rule before the rule number <replaceable>rule_num</replaceable>. The <literal>-D <replaceable>chain</replaceable> <replaceable>rule_num</replaceable></literal> (or <literal>-D <replaceable>chain</replaceable> <replaceable>rule</replaceable></literal>) option deletes a rule in a chain; the first syntax identifies the rule to be deleted by its number, while the latter identifies it by its contents. The <literal>-F <replaceable>chain</replaceable></literal> option flushes a chain (deletes all its rules); if no chain is mentioned, all the rules in the table are deleted. The <literal>-L <replaceable>chain</replaceable></literal> option lists the rules in the chain. Finally, the <literal>-P <replaceable>chain</replaceable> <replaceable>action</replaceable></literal> option defines the default action, or “policy”, for a given chain; note that only standard chains can have such a policy.
nb_no: <literal>-N <replaceable>chain</replaceable></literal>-valget lager en ny kjede. <literal>-X <replaceable>chain</replaceable></literal> sletter en tom eller ubrukt kjede. <literal>-A <replaceable>chain</replaceable> <replaceable>rule</replaceable></literal> legger til en regel ved slutten av en gitt kjede. <literal>-I <replaceable>chain</replaceable> <replaceable>rule_num</replaceable> <replaceable>rule</replaceable></literal>-valget setter inn en regel før regelnummeret <replaceable>rule_num</replaceable>. <literal>-D <replaceable>chain</replaceable> <replaceable>rule_num</replaceable></literal> (eller <literal>-D <replaceable>chain</replaceable> <replaceable>rule</replaceable></literal>)-valget sletter en regel i en kjede; Den første syntaksen identifiserer regelen som skal slettet ut fra nummeret den har. <literal>-F <replaceable>chain</replaceable></literal>-alternativet tømmer en kjede (sletter alle dens regler); hvis ingen kjede er nevnt, er alle reglene i tabellen slettet. <literal>-L <replaceable>chain</replaceable></literal>-valget lister reglene i kjeden. Til slutt, <literal>-P <replaceable>chain</replaceable> <replaceable>action</replaceable></literal>-valget definerer standardhandlingen, eller “policy”, for en gitt kjede; Merk at bare standardkjeder kan ha en slik "policy".

source: Rules
nb_no: Regler

source: Each rule is expressed as <literal><replaceable>conditions</replaceable> -j <replaceable>action</replaceable> <replaceable>action_options</replaceable></literal>. If several conditions are described in the same rule, then the criterion is the conjunction (logical <emphasis>and</emphasis>) of the conditions, which is at least as restrictive as each individual condition.
nb_no: Hver regel er utrtrykt som <literal><replaceable>conditions</replaceable> -j <replaceable>action</replaceable> <replaceable>action_options</replaceable></literal>. Hvis flere betingelser er beskrevet i den samme regelen, da det kriteriet forbindelsen mellom betingelsene (logisk <emphasis>and</emphasis>), som er minst like restriktive som hver individuelle betingelse.

source: The <literal>-p <replaceable>protocol</replaceable></literal> condition matches the protocol field of the IP packet. The most common values are <literal>tcp</literal>, <literal>udp</literal>, <literal>icmp</literal>, and <literal>icmpv6</literal>. Prefixing the condition with an exclamation mark negates the condition, which then becomes a match for “any packets with a different protocol than the specified one”. This negation mechanism is not specific to the <literal>-p</literal> option and it can be applied to all other conditions too.
nb_no: <literal>-p <replaceable>protocol</replaceable></literal>-betingelsen samsvarer med protokollfeltet i IP-pakken. De vanligste verdiene er <literal>tcp</literal>, <literal>udp</literal>, <literal>icmp</literal>, og <literal>icmpv6</literal>. Å forhåndsinnstille betingelsen med et utropstegn som benekter betingelsen, som deretter blir en oppgave for "noen pakker med en annen protokoll enn den spesifiserte". Denne negasjonsmekanismen er ikke spesiell for <literal>-p</literal>-alternativet, og det kan brukes på alle andre forhold også.

source: The <literal>-s <replaceable>address</replaceable></literal> or <literal>-s <replaceable>network/mask</replaceable></literal> condition matches the source address of the packet. Correspondingly, <literal>-d <replaceable>address</replaceable></literal> or <literal>-d <replaceable>network/mask</replaceable></literal> matches the destination address.
nb_no: <literal>-s <replaceable>address</replaceable></literal> eller <literal>-s <replaceable>network/mask</replaceable></literal>-betingelsen samsvarer med pakkens kildeadresse. Tilsvarende, <literal>-d <replaceable>address</replaceable></literal> eller <literal>-d <replaceable>network/mask</replaceable></literal> samsvarer med måladressen.

source: The <literal>-i <replaceable>interface</replaceable></literal> condition selects packets coming from the given network interface. <literal>-o <replaceable>interface</replaceable></literal> selects packets going out on a specific interface.
nb_no: <literal>-i <replaceable>interface</replaceable></literal>-betingelsen velger pakker som kommer inn fra et bestemt nettverksgrensesnitt. <literal>-o <replaceable>interface</replaceable></literal> velger pakker som går ut via et spesifikt grensesnitt.

source: There are more specific conditions, depending on the generic conditions described above. For instance, the <literal>-p tcp</literal> condition can be complemented with conditions on the TCP ports, with clauses such as <literal>--source-port <replaceable>port</replaceable></literal> and <literal>--destination-port <replaceable>port</replaceable></literal>.
nb_no: Det er mer spesifikke betingelser, avhengig av de generelle betingelser som er beskrevet ovenfor. For eksempel <literal>-p tcp</literal>-betingelsen kan kompletteres med betingelser i TCP-portene, med klausuler som<literal>--source-port <replaceable>port</replaceable></literal> og <literal>--destination-port <replaceable>port</replaceable></literal>.

source: The <literal>--state <replaceable>state</replaceable></literal> condition matches the state of a packet in a connection (this requires the <command>ipt_conntrack</command> kernel module, for connection tracking). The <literal>NEW</literal> state describes a packet starting a new connection; <literal>ESTABLISHED</literal> matches packets belonging to an already existing connection, and <literal>RELATED</literal> matches packets initiating a new connection related to an existing one (which is useful for the <literal>ftp-data</literal> connections in the “active” mode of the FTP protocol).
nb_no: <literal>--state <replaceable>state</replaceable></literal>-betingelsen samsvarer med tilstanden til en pakke i en forbindelse (dette krever kjernemodulen <command>ipt_conntrack</command> for koblingssporing). <literal>NEW</literal> tilstanden beskriver en pakke som starter en ny forbindelse; <literal>ESTABLISHED</literal> samsvarer med pakker som tilhører en allerede eksisterende kobling, og <literal>RELATED</literal> samsvarer med pakker som initierer en ny tilkobling knyttet til en eksisterende (som er nyttig for <literal>ftp-data</literal>-forbindelsene i FTP-protokollens "aktivmodus").

source: The previous section lists available actions, but not their respective options. The <literal>LOG</literal> action, for instance, has the following options:
nb_no: Den forrige seksjonen viser tilgjengelige handlinger, men ikke de respektive alternativene.<literal>LOG</literal>-handlingen, har for eksempel de følgende valgene:

source: <literal>--log-level</literal>, with default value <literal>warning</literal>, indicates the <command>syslog</command> severity level;
nb_no: <literal>--log-level</literal>, med standardverdi <literal>warning</literal>, indikerer alvorlighetsgraden <command>syslog</command>;

source: <literal>--log-prefix</literal> allows specifying a text prefix to differentiate between logged messages;
nb_no: <literal>--log-prefix</literal> tillater å spesifisere en tekstforstavelse for å skille mellom loggede meldinger;

source: <literal>--log-tcp-sequence</literal>, <literal>--log-tcp-options</literal> and <literal>--log-ip-options</literal> indicate extra data to be integrated into the message: respectively, the TCP sequence number, TCP options, and IP options.
nb_no: <literal>--log-tcp-sequence</literal>, <literal>--log-tcp-options</literal> og <literal>--log-ip-options</literal> indikerer ekstra data som skal integreres i meldingen: henholdsvis TCP sekvensnummer, TCP-alternativer, og IP-alternativer.

source: The <literal>DNAT</literal> action provides the <literal>--to-destination <replaceable>address</replaceable>:<replaceable>port</replaceable></literal> option to indicate the new destination IP address and/or port. Similarly, <literal>SNAT</literal> provides <literal>--to-source <replaceable>address</replaceable>:<replaceable>port</replaceable></literal> to indicate the new source IP address and/or port.
nb_no: <literal>DNAT</literal> handlingen gir <literal>--to-destination <replaceable>address</replaceable>:<replaceable>port</replaceable></literal> valget for å indikere den nye destinasjonens IP adresse og/eller port. Tilsvarende, <literal>SNAT</literal> gir <literal>--to-source <replaceable>address</replaceable>:<replaceable>port</replaceable></literal> for å indikere den nye kildens IP-adresse og/eller port.

source: The <literal>REDIRECT</literal> action (only available if NAT is available) provides the <literal>--to-ports <replaceable>port(s)</replaceable></literal> option to indicate the port, or port range, where the packets should be redirected.
nb_no: <literal>REDIRECT</literal>-handlingen (bare hvis NAT er tilgjengelig) gir <literal>--to-ports <replaceable>port(s)</replaceable></literal>-valget for å angi porten, eller portområdet, dit pakkene skal omdirigeres.

source: Creating Rules
nb_no: Å lage regler

source: Each rule creation requires one invocation of <command>iptables</command>/<command>ip6tables</command>. Typing these commands manually can be tedious, so the calls are usually stored in a script so that the same configuration is set up automatically every time the machine boots. This script can be written by hand, but it can also be interesting to prepare it with a high-level tool such as <command>fwbuilder</command>.
nb_no: Hver regeletablering krever bruk av <command>iptables</command>/<command>ip6tables</command>. Å skrive disse kommandoene manuelt kan være kjedelig, så anropene lagres vanligvis i et skript slik at den samme konfigurasjonen blir satt opp automatisk hver gang maskinen starter. Dette skriptet kan skrives for hånd, men det kan også være interessant å forberede det med et høynivå verktøy som <command>fwbuilder</command>.

source: The principle is simple. In the first step, one needs to describe all the elements that will be involved in the actual rules:
nb_no: Prinsippet er enkelt. I det første trinnet, må man beskrive alle elementene som involveres i selve reglene:

source: the firewall itself, with its network interfaces;
nb_no: brannmuren selv, med sine nettverksgrensesnitt;

source: the networks, with their corresponding IP ranges;
nb_no: nettverkene, med sine tilhørende IP-serier;

source: the servers;
nb_no: tjenerne;

source: the ports belonging to the services hosted on the servers.
nb_no: portene som tilhører de tjenestene som ligger på tjenerne.

source: The rules are then created with simple drag-and-drop actions on the objects. A few contextual menus can change the condition (negating it, for instance). Then the action needs to be chosen and configured.
nb_no: Reglene blir deretter laget med enkle dra-og-slipp-handlinger på objektene. Noen kontekstmenyer kan endre betingelsen (nekte den, for eksempel). Deretter må handlingen velges og konfigureres.

source: As far as IPv6 is concerned, one can either create two distinct rulesets for IPv4 and IPv6, or create only one and let <command>fwbuilder</command> translate the rules according to the addresses assigned to the objects.
nb_no: Såvidt det gjelder IPv6, kan man enten lage to forskjellige regelsett for IPv4 og IPv6, eller bare lage ett og la <command>fwbuilder</command> oversette reglene i følge de adressene som er tildelt stedene.

source: Fwbuilder's main window
nb_no: Fwbuilders hovedvindu

source: <command>fwbuilder</command> can then generate a script configuring the firewall according to the rules that have been defined. Its modular architecture gives it the ability to generate scripts targeting different systems (<command>iptables</command> for Linux, <command>ipf</command> for FreeBSD and <command>pf</command> for OpenBSD).
nb_no: <command>fwbuilder</command> kan deretter generere et skript som konfigurerer brannmuren etter de regler som er angitt. Dens modulære arkitektur gir det muligheten til å generere skript rettet mot ulike systemer: <command>iptables</command> for Linux, <command>ipf</command> for FreeBSD og <command>pf</command> for OpenBSD.

source: Installing the Rules at Each Boot
nb_no: Å installere reglene ved hver oppstart

source: In other cases, the recommended way is to register the configuration script in an <literal>up</literal> directive of the <filename>/etc/network/interfaces</filename> file. In the following example, the script is stored under <filename>/usr/local/etc/arrakis.fw</filename>.
nb_no: I andre tilfeller er den anbefalte måten å registrere skriptet i en <literal>up</literal> directive of the <filename>/etc/network/interfaces</filename>-fil. I det følgende eksemplet er skriptet lagret under <filename>/usr/local/etc/arrakis.fw</filename>.

source: <filename>interfaces</filename> file calling firewall script
nb_no: <filename>interfaces</filename>-file som påkaller et brannmurskript

source: This obviously assumes that you are using <emphasis role="pkg">ifupdown</emphasis> to configure the network interfaces. If you are using something else (like <emphasis>NetworkManager</emphasis> or <emphasis>systemd-networkd</emphasis>), then refer to their respective documentation to find out ways to execute a script after the interface has been brought up.
nb_no: Dette forutsetter selvsagt at du bruker <emphasis role="pkg">ifupdown</emphasis> til å konfigurere nettverksgrensesnittet. Hvis du bruker noe annet (som <emphasis>NetworkManager</emphasis> eller <emphasis>systemd-networkd</emphasis>), henvis deretter til deres respektive dokumentasjon for å finne ut måter til å kjøre et skript etter at grensesnittet har tatt frem.

source: Supervision: Prevention, Detection, Deterrence
nb_no: Overvåking: Forebygging, avdekking, avskrekking

source: Monitoring is an integral part of any security policy for several reasons. Among them, that the goal of security is usually not restricted to guaranteeing data confidentiality, but it also includes ensuring availability of the services. It is therefore imperative to check that everything works as expected, and to detect in a timely manner any deviant behavior or change in quality of the service(s) rendered. Monitoring activity can help detecting intrusion attempts and enable a swift reaction before they cause grave consequences. This section reviews some tools that can be used to monitor several aspects of a Debian system. As such, it completes <xref linkend="sect.monitoring" />.
nb_no: Overvåking er en integrert del av enhvert sikkerhetsopplegg av flere grunner. Blant dem, at målet om sikkerhet er vanligvis ikke begrenset til å garantere datakonfidensialitet, men det inkluderer også å sikre tjenestenes tilgjengelighet. Det er derfor viktig å sjekke at alt fungerer som forventet, og å i tide oppdage avvikende atferd eller endring i kvaliteten på tjenesten(e) som blir levert. Å overvåke aktivitet kan bidra til å oppdage inntrengingsforsøk og muliggjøre en rask reaksjon før de forårsaker alvorlige konsekvenser. Denne delen vurderer noen verktøy som kan brukes til å overvåke flere aspekter av et Debian-systemet. Som sådan, fullfører den <xref linkend="sect.monitoring" />.

source: Monitoring Logs with <command>logcheck</command>
nb_no: Å overvåke logger med <command>logcheck</command>

source: The <command>logcheck</command> program monitors log files every hour by default. It sends unusual log messages in emails to the administrator for further analysis.
nb_no: <command>logcheck</command>-programmet overvåker loggfiler som standard hver time. Det sender uvanlige loggmeldinger i e-post til administratoren for videre analyse.

source: The list of monitored files is stored in <filename>/etc/logcheck/logcheck.logfiles</filename>; the default values work fine if the <filename>/etc/rsyslog.conf</filename> file has not been completely overhauled.
nb_no: Listen over overvåkede filer lagres i <filename>/etc/logcheck/logcheck.logfiles</filename>; standardverdiene fungerer fint hvis <filename>/etc/rsyslog.conf</filename>-filen ikke har blitt fullstendig overhalt.

source: <command>logcheck</command> can work in one of three more or less detailed modes: <emphasis>paranoid</emphasis>, <emphasis>server</emphasis> and <emphasis>workstation</emphasis>. The first one is <emphasis>very</emphasis> verbose, and should probably be restricted to specific servers such as firewalls. The second (and default) mode is recommended for most servers. The last one is designed for workstations, and is even terser (it filters out more messages).
nb_no: <command>logcheck</command> kan arbeide i en av tre mer eller mindre detaljerte modi:<emphasis>paranoid</emphasis>, <emphasis>server</emphasis> og <emphasis>workstation</emphasis>. Den først er <emphasis>very</emphasis> ordrik, og bør nok være begrenset til bestemte tjenere slike som brannmurer. Den andre (og standard) modus anbefales for de fleste tjenere. Den siste er beregnet for arbeidsstasjoner, og er mer finslipt (den filtrerer ut flere meldinger).

source: In all three cases, <command>logcheck</command> should probably be customized to exclude some extra messages (depending on installed services), unless the admin really wishes to receive hourly batches of long uninteresting emails. Since the message selection mechanism is rather complex, <filename>/usr/share/doc/logcheck-database/README.logcheck-database.gz</filename> is a required — if challenging — read.
nb_no: I alle tre tilfelle, bør nok <command>logcheck</command> være tilpasset for å utelukke noen ekstra meldinger (avhengig av installerte tjenester), med mindre admin virkelig hver time ønsker å motta grupper av lange uinteressante e-poster. Siden utvalgsmekanismen for meldinger er ganske komplisert, kreves <filename>/usr/share/doc/logcheck-database/README.logcheck-database.gz</filename> — hvis utfordrende — les.

source: The applied rules can be split into several types:
nb_no: De anvendte reglene kan deles inn i flere typer:

source: those that qualify a message as a cracking attempt (stored in a file in the <filename>/etc/logcheck/cracking.d/</filename> directory);
nb_no: de som kvalifiserer en melding som et inntrengningsforsøk (lagret i en fil i <filename>/etc/logcheck/cracking.d/</filename>-mappen);

source: those canceling such a qualification (<filename>/etc/logcheck/cracking.ignore.d/</filename>);
nb_no: de som de avbryter slik kvalifisering (<filename>/etc/logcheck/cracking.ignore.d/</filename>);

source: those classifying a message as a security alert (<filename>/etc/logcheck/violations.d/</filename>);
nb_no: de som klassifiserer en melding som et sikkerhetsvarsel (<filename>/etc/logcheck/violations.d/</filename>);

source: those canceling this classification (<filename>/etc/logcheck/violations.ignore.d/</filename>);
nb_no: de som avbryter denne klassifisering (<filename>/etc/logcheck/violations.ignore.d/</filename>);

source: finally, those applying to the remaining messages (considered as <emphasis>system events</emphasis>).
nb_no: til slutt, de som andvendes til de gjenstående budskapene (ansett som <emphasis>system events</emphasis>).

source: <emphasis>CAUTION</emphasis> Ignoring a message
nb_no: <emphasis>CAUTION</emphasis> Å ignorere et budskap

source: Any message tagged as a cracking attempt or a security alert (following a rule stored in a <filename>/etc/logcheck/violations.d/myfile</filename> file) can only be ignored by a rule in a <filename>/etc/logcheck/violations.ignore.d/myfile</filename> or <filename>/etc/logcheck/violations.ignore.d/myfile-<replaceable>extension</replaceable></filename> file.
nb_no: Alle meldinger merket som et inntrengingsforsøk eller en sikkerhetsadvarsel (etter en regel lagret i en <filename>/etc/logcheck/violations.d/myfile</filename>-fil) kan bare ignoreres med en regel i en <filename>/etc/logcheck/violations.ignore.d/myfile</filename> eller <filename>/etc/logcheck/violations.ignore.d/myfile-<replaceable>extension</replaceable></filename>-fil.
