Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: A system event is always signaled unless a rule in one of the <filename>/etc/logcheck/ignore.d.{paranoid,server,workstation}/</filename> directories states the event should be ignored. Of course, the only directories taken into account are those corresponding to verbosity levels equal or greater than the selected operation mode.
nb_no: En system hendelse signaliseres alltid med mindre en regel i en av <filename>/etc/logcheck/ignore.d.{paranoid,server,workstation}/</filename>-mappene fastslår at handlingen skal ignoreres. Selvfølgelig, de eneste mapper som tas i betraktning, er de som tilsvarer et detaljnivået likt eller større enn den valgte driftsmodus.

source: Monitoring Activity
nb_no: Overvåkingsaktivitet

source: In Real Time
nb_no: I sanntid

source: <command>top</command> is an interactive tool that displays a list of currently running processes. The default sorting is based on the current amount of processor use and can be obtained with the <keycap>P</keycap> key. Other sort orders include a sort by occupied memory (<keycap>M</keycap> key), by total processor time (<keycap>T</keycap> key) and by process identifier (<keycap>N</keycap> key). The <keycap>k</keycap> key allows killing a process by entering its process identifier. The <keycap>r</keycap> key allows <emphasis>renicing</emphasis> a process, i.e. changing its priority.
nb_no: <command>top</command> er et interaktivt verktøy som viser en liste over kjørende prosesser. Standard sortering er basert på gjeldende mengde prosessorbruk, og finnes med <keycap>P</keycap>-tasten. Andre sorteringsordrer inkluderer benyttet minne (<keycap>M</keycap> key), samlet prosessortid (<keycap>T</keycap> key) og etter prosessidentifiserer (<keycap>N</keycap> key). <keycap>k</keycap>-tasten tillater å stanse en prosess ved å gå til prosessidentifisereren. <keycap>r</keycap>-tasten tillater <emphasis>renicing</emphasis> en prosess, det betyr å endre dens prioritet.

source: When the system seems to be overloaded, <command>top</command> is a great tool to see which processes are competing for processor time or consume too much memory. In particular, it is often interesting to check if the processes consuming resources match the real services that the machine is known to host. An unknown process running as the www-data user should really stand out and be investigated, since it's probably an instance of software installed and executed on the system through a vulnerability in a web application.
nb_no: Når systemet ser ut til å være overbelastet, er <command>top</command> et flott verktøy for å se hvilke prosesser som konkurrerer om prosessortid eller bruker for mye minne. Spesielt er det ofte interessant å sjekke om de prosesser som bruker ressurser samsvarer med reelle tjenester som maskinen er kjent for å være vert for. En ukjent prosess som kjører som www-databruker skal virkelig være synlig og undersøkes, da den sannsynligvis er et tilfelle av at programvare er installert og kjørt på systemet via en sårbarhet i en nett-applikasjon.

source: <command>top</command> is a very flexible tool and its manual page gives details on how to customize its display and adapt it to one's personal needs and habits.
nb_no: <command>top</command> er et svært fleksibelt verktøy og den tilhørende manuelle siden informerer om hvordan man tilpasser skjermen til personlige behov og vaner.

source: The <command>gnome-system-monitor</command> graphical tool is similar to <command>top</command> and it provides roughly the same features.
nb_no: <command>gnome-system-monitor</command>-grafiske verktøy ligner <command>top</command> og gir grovt sett de samme egenskapene.

source: History
nb_no: Historie

source: Processor load, network traffic and free disk space are information that are constantly varying. Keeping a history of their evolution is often useful in determining exactly how the computer is used.
nb_no: Prosessorbelastning, nettverkstrafikk og ledig diskplass er informasjon som stadig varierer. Å beholde en historie med hvordan de endres er ofte nyttig for å bestemme nøyaktig hvordan datamaskinen brukes.

source: There are many dedicated tools for this task. Most can fetch data via SNMP (<emphasis>Simple Network Management Protocol</emphasis>) in order to centralize this information. An added benefit is that this allows fetching data from network elements that may not be general-purpose computers, such as dedicated network routers or switches.
nb_no: Det finnes mange øremerkede verktøy for denne oppgaven. De fleste kan hente data via SNMP (<emphasis>Simple Network Management Protocol</emphasis>) for å sentralisere denne informasjonen. En ekstra fordel er at dette gjør at henting av data fra nettverkselementer som kanskje ikke er datamaskiner med et generelt formål, som øremerkede nettverksrutere eller brytere.

source: This book deals with Munin in some detail (see <xref linkend="sect.munin" />) as part of <xref linkend="advanced-administration" xrefstyle="select: label quotedtitle" />. Debian also provides a similar tool, <emphasis role="pkg">cacti</emphasis>. Its deployment is slightly more complex, since it is based solely on SNMP. Despite having a web interface, grasping the concepts involved in configuration still requires some effort. Reading the HTML documentation (<filename>/usr/share/doc/cacti/html/index.html</filename>) should be considered a prerequisite.
nb_no: I noe detalj omhandler denne boken Munin (see <xref linkend="sect.munin" />) som en del av <xref linkend="advanced-administration" xrefstyle="select: label quotedtitle" />. Debian leverer også et lignende verktøy, <emphasis role="pkg">cacti</emphasis>. Utplasseringen er litt mer komplisert, siden det kun er basert på SNMP. Til tross for et net-grensesnitt, kreves det litt innsats å få tak på begrepene som inngår i konfigurasjonen. Å lese HTML-dokumentasjon (<filename>/usr/share/doc/cacti/html/index.html</filename>) må betraktes som en forutsetning.

source: <command>mrtg</command> (in the similarly-named package) is an older tool. Despite some rough edges, it can aggregate historical data and display them as graphs. It includes a number of scripts dedicated to collecting the most commonly monitored data such as processor load, network traffic, web page hits, and so on.
nb_no: <command>mrtg</command> (i pakken med tilsvarende navn) er et eldre verktøy. Til tross for noen grove kanter, kan det samle historiske data og vise dem som grafer. Det inkluderer en rekke skript øremerket til å samle de mest overvåkede data som prosessorbelastning, nettverkstrafikk, nettsidetreff, og så videre.

source: The <emphasis role="pkg">mrtg-contrib</emphasis> and <emphasis role="pkg">mrtgutils</emphasis> packages contain example scripts that can be used directly.
nb_no: <emphasis role="pkg">mrtg-contrib</emphasis> og <emphasis role="pkg">mrtgutils</emphasis>-pakkene inneholder eksempelskripter som kan brukes direkte.

source: Detecting Changes
nb_no: Å finne endringer

source: Once the system is installed and configured, and barring security upgrades, there's usually no reason for most of the files and directories to evolve, data excepted. It is therefore interesting to make sure that files actually do not change: any unexpected change would therefore be worth investigating. This section presents a few tools able to monitor files and to warn the administrator when an unexpected change occurs (or simply to list such changes).
nb_no: Når systemet er installert og konfigurert, og sikkerhetsoppgraderinger oppdatert, er det vanligvis ingen grunn til å utvikle videre de fleste filer og kataloger, data unntatt. Det er derfor interessant å sørge for at filene faktisk ikke endres: Alle uventede endringer vil det derfor være verdt å undersøke. Denne delen presenterer noen verktøy som er i stand til å overvåke filer og advare administratoren når en uventet endring skjer (eller rett og slett for å liste slike endringer).

source: Auditing Packages with <command>dpkg --verify</command>
nb_no: Gjennomgå pakker med <command>dpkg --verify</command>

source: <emphasis>GOING FURTHER</emphasis> Protecting against upstream changes
nb_no: <emphasis>GOING FURTHER</emphasis> Å beskytte mot oppstrømsforandringer

source: <command>dpkg --verify</command> is useful in detecting changes to files coming from a Debian package, but it will be useless if the package itself is compromised, for instance if the Debian mirror is compromised. Protecting against this class of attacks involves using APT's digital signature verification system (see <xref linkend="sect.package-authentication" />), and taking care to only install packages from a certified origin.
nb_no: <command>dpkg --verify</command> er nyttig for å oppdage endringer i filer som kommer fra en Debian-pakke, men vil være ubrukelig hvis pakken selv er kompromittert, for eksempel hvis Debian-speilet er kompromittert. Å beskytte mot denne klassen av angrep omfatter å bruke APTs digitale system for signaturverifisering (se <xref linkend="sect.package-authentication" />), og passe på å bare installere pakker med en sertifisert opprinnelse.

source: <command>dpkg --verify</command> (or <command>dpkg -V</command>) is an interesting tool since it allows finding what installed files have been modified (potentially by an attacker), but this should be taken with a grain of salt. To do its job it relies on checksums stored in dpkg's own database which is stored on the hard disk (they can be found in <filename>/var/lib/dpkg/info/<replaceable>package</replaceable>.md5sums</filename>); a thorough attacker will therefore update these files so they contain the new checksums for the subverted files.
nb_no: <command>dpkg --verify</command> (eller <command>dpkg -V</command>) er et interessant verktøy, siden det tillater å finne hvilke installerte filer som har blitt endret (potensielt av en angriper), men dette bør tas med en klype salt. For å gjøre jobben sin er den avhengig av sjekkesummer lagret i dpkgs egen database lagret på harddisken (de kan finnes i <filename>/var/lib/dpkg/info/<replaceable>package</replaceable>.md5sums</filename>); Derfor vil en grundig angriper oppdatere disse filene slik at de inneholder de nye kontrollsummene for nedbrutte filer.

source: <emphasis>BACK TO BASICS</emphasis> File fingerprint
nb_no: <emphasis>BACK TO BASICS</emphasis> Fil fingeravtrykk

source: As a reminder: a fingerprint is a value, often a number (even though in hexadecimal notation), that contains a kind of signature for the contents of a file. This signature is calculated with an algorithm (MD5 or SHA1 being well-known examples) that more or less guarantee that even the tiniest change in the file contents implies a change in the fingerprint; this is known as the “avalanche effect”. This allows a simple numerical fingerprint to serve as a litmus test to check whether the contents of a file have been altered. These algorithms are not reversible; in other words, for most of them, knowing a fingerprint doesn't allow finding the corresponding contents. Recent mathematical advances seem to weaken the absoluteness of these principles, but their use is not called into question so far, since creating different contents yielding the same fingerprint still seems to be quite a difficult task.
nb_no: Som en påminnelse: Et fingeravtrykk er en verdi, ofte et tall (selv om det i heksadesimal notasjon), som inneholder en slags signatur for innholdet i en fil. Denne signaturen er beregnet med en algoritme (MD5 eller SHA1 blir godt kjent eksempler) som mer eller mindre garanterer at selv den minste endring i filinnholdet innebærer en endring i fingeravtrykket; kjent som skredeffekten (“avalanche effect”). Dette gjør at et enkelt tallfestet fingeravtrykk tjener som en lakmustest for å sjekke om innholdet i en fil har blitt endret. Disse algoritmene er ikke reverserbare; med andre ord, for de fleste, at man vet at et fingeravtrykk ikke tillater å finne tilbake til det tilhørende innholdet. Nye matematiske fremskritt ser ut til å svekke hvor absolutt disse prinsippene er, men det er ikke stilt spørsmåltegn ved bruken så langt, siden det å lage ulikt innhold ut fra samme fingeravtrykk fortsatt synes å være en ganske vanskelig oppgave.

source: Running <command>dpkg -V</command> will verify all installed packages and will print out a line for each file with a failing test. The output format is the same as the one of <command>rpm -V</command> where each character denotes a test on some specific meta-data. Unfortunately <command>dpkg</command> does not store the meta-data needed for most tests and will thus output question marks for them. Currently only the checksum test can yield a "5" on the third character (when it fails).
nb_no: Å kjøre <command>dpkg -V</command> vil bekrefte alle installerte pakker, og vil skrive ut en linje for hver fil med en sviktende test. Utgangsformatet er det samme som et fra <command>rpm -V</command> hvor hver figur betegner en test med noen spesifikke metadata. Dessverre <command>dpkg</command> lagrer ikke meta-data som trengs for de fleste testene, og vil dermed gi spørsmålstegn for dem. Foreløpig kan bare sjekksumtesten levere en "5"-er på den tredje tegnet (når den feiler).

source: In the sample above, dpkg reports a change to SSH's service file that the administrator made to the packaged file instead of using an appropriate <filename>/etc/systemd/system/ssh.service</filename> override (which would be stored below <filename>/etc</filename> like any configuration change should be). It also lists multiple configuration files (identified by the "c" letter on the second field) that had been legitimately modified.
nb_no: I eksempelet ovenfor, rapporterer dpkg en endring i SSH-tjenestefil som administratoren har gjort i den pakkede filen i stedet for å bruke den hensiktsmessige <filename>/etc/systemd/system/ssh.service</filename>-overstyring (som ville bli lagret under <filename>/etc</filename> som alle konfigurasjonsendringer skal). Den viser også flere konfigurasjonsfiler (identifisert av "c" bokstaven i det andre feltet) som er legitimt modifisert.

source: Auditing Packages: <command>debsums</command> and its Limits
nb_no: Overvåkingspakker: <command>debsums</command> og dens grenser

source: <command>debsums</command> is the ancestor of <command>dpkg -V</command> and is thus mostly obsolete. It suffers from the same limitations than dpkg. Fortunately, some of the limitations can be worked-around (whereas dpkg does not offer similar work-arounds).
nb_no: <command>debsums</command> er stamfaren til <command>dpkg -V</command> og er dermed stort sett foreldet. Den lider av de samme begrensningene som dpkg. Heldigvis, noen av begrensningene kan man komme rundt (mens dpkg ikke tilbyr tilsvarende work-arounds).

source: Since the data on the disk cannot be trusted, <command>debsums</command> offers to do its checks based on <filename>.deb</filename> files instead of relying on dpkg's database. To download trusted <filename>.deb</filename> files of all the packages installed, we can rely on APT's authenticated downloads. This operation can be slow and tedious, and should therefore not be considered a proactive technique to be used on a regular basis.
nb_no: Since the data on the disk cannot be trusted, <command>debsums</command> offers to do its checks based on <filename>.deb</filename> files instead of relying on dpkg's database. To download trusted <filename>.deb</filename>-filer for alle installerte pakker, kan vi stole på APTs klarerte nedlastinger. Denne operasjonen kan være treg og omstendelig, og bør derfor ikke anses som en proaktiv teknikk som skal brukes på jevnlig.

source: Note that this example uses the <command>grep-status</command> command from the <emphasis role="pkg">dctrl-tools</emphasis> package, which is not installed by default.
nb_no: Mer at dette eksemplet bruker <command>grep-status</command>-kommandoen fra <emphasis role="pkg">dctrl-tools</emphasis>-pakken, som ikke er installert som standard.

source: Monitoring Files: AIDE
nb_no: Å overvåke filer: AIDE

source: The AIDE tool (<emphasis>Advanced Intrusion Detection Environment</emphasis>) allows checking file integrity, and detecting any change against a previously recorded image of the valid system. This image is stored as a database (<filename>/var/lib/aide/aide.db</filename>) containing the relevant information on all files of the system (fingerprints, permissions, timestamps and so on). This database is first initialized with <command>aideinit</command>; it is then used daily (by the <filename>/etc/cron.daily/aide</filename> script) to check that nothing relevant changed. When changes are detected, AIDE records them in log files (<filename>/var/log/aide/*.log</filename>) and sends its findings to the administrator by email.
nb_no: AIDE-verktøyet (<emphasis>Advanced Intrusion Detection Environment</emphasis>) kan sjekke filens integritet, og oppdager alle endringer opp mot et tidligere innspilt bilde av systemet. Dette bildet er lagret som en database (<filename>/var/lib/aide/aide.db</filename>) som inneholder relevant informasjon om alle filene i systemet (fingeravtrykk, tillatelser, tidsstempler, og så videre). Denne databasen blir først initialisert med <command>aideinit</command>; og er så brukt daglig (med <filename>/etc/cron.daily/aide</filename> skriptet) for å kontrollere om ingenting relevant endret. Når det oppdages endringer, registrerer AIDE dem i loggfiler (<filename>/var/log/aide/*.log</filename>) og sender sine funn til administratoren med e-post.

source: <emphasis>IN PRACTICE</emphasis> Protecting the database
nb_no: <emphasis>IN PRACTICE</emphasis> Å beskytte databasen

source: Since AIDE uses a local database to compare the states of the files, the validity of its results is directly linked to the validity of the database. If an attacker gets root permissions on a compromised system, they will be able to replace the database and cover their tracks. A possible workaround would be to store the reference data on read-only storage media.
nb_no: Ettersom AIDE bruker en lokal database for å sammenligne tilstanden til filene, er gyldigheten av resultatene direkte knyttet til databasens gyldighet. Hvis en angriper får rot-rettigheter til et kompromittert system, vil denne være i stand til å skifte ut databasen og dekke sine spor. En mulig løsning ville være å lagre referansedata på skrivebeskyttede lagringsmedier .

source: Many options in <filename>/etc/default/aide</filename> can be used to tweak the behavior of the <emphasis role="pkg">aide</emphasis> package. The AIDE configuration proper is stored in <filename>/etc/aide/aide.conf</filename> and <filename>/etc/aide/aide.conf.d/</filename> (actually, these files are only used by <command>update-aide.conf</command> to generate <filename>/var/lib/aide/aide.conf.autogenerated</filename>). Configuration indicates which properties of which files need to be checked. For instance, the contents of log files changes routinely, and such changes can be ignored as long as the permissions of these files stay the same, but both contents and permissions of executable programs must be constant. Although not very complex, the configuration syntax is not fully intuitive, and reading the <citerefentry><refentrytitle>aide.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> manual page is therefore recommended.
nb_no: Mange valg i <filename>/etc/default/aide</filename> kan bli brukt til å justere handlingene til <emphasis role="pkg">aide</emphasis>-pakken. AIDE-oppsettet er lagret i <filename>/etc/aide/aide.conf</filename> og <filename>/etc/aide/aide.conf.d/</filename> (disse filene er faktisk bare brukt av <command>update-aide.conf</command> for å generere <filename>/var/lib/aide/aide.conf.autogenerated</filename>). Konfigurasjon indikerer hvilke egenskaper ved hvilke filer som må sjekkes. For eksempel kan innholdet i loggfiler endres rutinemessig, og slike endringer kan ignoreres så lenge rettighetene til disse filene forbli den samme, men både innhold og tillatelser for kjørbare programmer må være konstante. Selv om de ikke er veldig kompliserte, er ikke konfigurasjons-syntaksen helt intuitiv, og lese <citerefentry><refentrytitle>aide.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> manualside er derfor anbefalt.

source: A new version of the database is generated daily in <filename>/var/lib/aide/aide.db.new</filename>; if all recorded changes were legitimate, it can be used to replace the reference database.
nb_no: En ny versjon av databasen genereres hver dag i <filename>/var/lib/aide/aide.db.new</filename>; hvis alle registrerte endringer var legitime, kan den brukes til å erstatte referansedatabasen.

source: <emphasis>ALTERNATIVE</emphasis> Tripwire and Samhain
nb_no: <emphasis>ALTERNATIVE</emphasis> Tripwire og Samhain

source: Tripwire is very similar to AIDE; even the configuration file syntax is almost the same. The main addition provided by <emphasis role="pkg">tripwire</emphasis> is a mechanism to sign the configuration file, so that an attacker cannot make it point at a different version of the reference database.
nb_no: Tripwire er veldig lik AIDE; Selv konfigurasjonsfilen syntaksen er nesten det samme. Hovedtillegget, levert fra <emphasis role="pkg">tripwire</emphasis> er en mekanisme til å signere konfigurasjonsfilen, slik at en angriper ikke kan få den til å peke til en annen versjon av referansedatabasen.

source: Samhain also offers similar features, as well as some functions to help detecting rootkits (see the sidebar <xref linkend="sidebar.the-checksecurity-and-chkrootkit-rkhunter-packages" />). It can also be deployed globally on a network, and record its traces on a central server (with a signature).
nb_no: Samhain tilbyr også lignende funksjoner, samt noen funksjoner for å hjelpe til med å oppdage rootkit (se sidepanelet <xref linkend="sidebar.the-checksecurity-and-chkrootkit-rkhunter-packages" />). Den kan også distribueres globalt i et nettverk, og registrere sine spor på en sentral tjener (med en signatur).

source: The first of these packages contains several small scripts performing basic checks on the system (empty passwords, new setuid files, and so on) and warning the administrator if required. Despite its explicit name, an administrator should not rely solely on it to make sure a Linux system is secure.
nb_no: Den første av disse pakkene inneholder flere små skript som utfører grunnleggende kontroller på systemet (tomme passord, nye setuid-filer og så videre) og advarer administratoren hvis nødvendig. Til tross for sitt eksplisitte navn, bør en administrator ikke stole utelukkende på det for å være sikker på at et Linux-system er trygt.

source: The <emphasis role="pkg">chkrootkit</emphasis> and <emphasis role="pkg">rkhunter</emphasis> packages allow looking for <emphasis>rootkits</emphasis> potentially installed on the system. As a reminder, these are pieces of software designed to hide the compromise of a system while discreetly keeping control of the machine. The tests are not 100% reliable, but they can usually draw the administrator's attention to potential problems.
nb_no: <emphasis role="pkg">chkrootkit</emphasis> og <emphasis role="pkg">rkhunter</emphasis>-pakkene tillater at det ses etter om <emphasis>rootkits</emphasis> potensielt er installert i systemet. Som en påminnelse, disse er biter av programvare er utviklet for å skjule kompromittering av et system og samtidig å holde kontrollen over maskinen. Testene er ikke 100 % pålitelige, men de kan som regel trekke administratorens oppmerksomhet til potensielle problemer.

source: Detecting Intrusion (IDS/NIDS)
nb_no: Å avdekke inntrengning (IDS/NIDS)

source: <emphasis>BACK TO BASICS</emphasis> Denial of service
nb_no: <emphasis>BACK TO BASICS</emphasis> Tjenestenektangrep
