Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: Firewall
nb_no: Brannmur

source: Netfilter
nb_no: Nettfilter

source: Security
nb_no: Sikkerhet

source: An information system can have a varying level of importance depending on the environment. In some cases, it is vital to a company's survival. It must therefore be protected from various kinds of risks. The process of evaluating these risks, defining and implementing the protection is collectively known as the “security process”.
nb_no: Et informasjonssystem kan ha en varierende viktighet som følge av miljøfaktorer. Noen ganger kan det være livsviktig for bedriftens overlevelse, og må derfor beskyttes mot forskjellige former for risiko. Prosessen med å evaluere disse risikoene, definere og implementere beskyttelsesmekanismer kalles med et fellesord «sikkerhetsprosessen».

source: Defining a Security Policy
nb_no: Å definere et sikkerhetsopplegg

source: <emphasis>CAUTION</emphasis> Scope of this chapter
nb_no: <emphasis>FORSIKTIG</emphasis> Hensikten med dette kapittelet

source: Security is a vast and very sensitive subject, so we cannot claim to describe it in any kind of comprehensive manner in the course of a single chapter. We will only delineate a few important points and describe some of the tools and methods that can be of use in the security domain. For further reading, literature abounds, and entire books have been devoted to the subject. An excellent starting point would be <citetitle>Linux Server Security</citetitle> by Michael D. Bauer (published by O'Reilly).
nb_no: Datasikkerhet (eng: security) er et stort og følsomt tema, som ikke på langt nær kan beskrives fullstendig i bare ett kapittel. Vi vil bare framheve noen få viktige punkter. og beskrive noen av verktøyene og metodene som kan nyttes på dette feltet. For videre lesning, mangler det ikke på bøker øremerket til temaet. Et godt sted å starte kan være <citetitle>Linux Server Security</citetitle> av Michael D. Bauer (publisert av O'Reilly).

source: The very first thing to determine is therefore the goal. A good approach to help with that determination starts with the following questions:
nb_no: Den absolutt første tingen å avgjøre er derfor målet. En god tilnærming til å hjelpe til med denne avgjørelsen er å starte med disse spørsmålene:

source: <emphasis>What</emphasis> are we trying to protect? The security policy will be different depending on whether we want to protect computers or data. In the latter case, we also need to know which data.
nb_no: <emphasis>Hva</emphasis> prøver man å beskytte? Sikkerhetsopplegget vil være forskjellig avhengig om man vil beskytte maskiner eller data. I sistnevnte tilfelle må vi også vite hvilke data.

source: What are we trying to protect <emphasis>against</emphasis>? Is it leakage of confidential data? Accidental data loss? Revenue loss caused by disruption of service?
nb_no: Hva prøver vi å beskytte <emphasis>mot</emphasis>? Er det lekkasje av sensitive data? Tap av data? Tap av inntekt som følge av forstyrrelser i tjenesten?

source: Also, <emphasis>who</emphasis> are we trying to protect against? Security measures will be quite different for guarding against a typo by a regular user of the system than they would be when protecting against a determined attacker group.
nb_no: Dessuten, <emphasis>hvem</emphasis> prøver vi vi å beskytte mot? Sikkerhetstiltakene vil variere stort mellom det å beskytte mot skrivefeil fra brukeren av systemet, og angrep fra motiverte grupper utenfra.

source: The term “risk” is customarily used to refer collectively to these three factors: what to protect, what needs to be prevented from happening, and who will try to make it happen. Modeling the risk requires answers to these three questions. From this risk model, a security policy can be constructed, and the policy can be implemented with concrete actions.
nb_no: Ordet «risiko», i sikkerhetsøyemed, brukes gjerne som samlebegrep for disse tre faktorene: Hva som må beskyttes, hva som må hindres fra å skje, og hvem som det må beskyttes mot. Å modellere risikoen krever svar på disse tre spørsmålene. Utfra en slik risikomodell, kan et sikkerhetsopplegg konstrueres, og dette kan implementeres gjennom konkrete tiltak.

source: <emphasis>NOTE</emphasis> Permanent questioning
nb_no: <emphasis>NB</emphasis> Bestående spørsmål

source: Bruce Schneier, a world expert in security matters (not only computer security) tries to counter one of security's most important myths with a motto: “Security is a process, not a product”. Assets to be protected change in time, and so do threats and the means available to potential attackers. Even if a security policy has initially been perfectly designed and implemented, one should never rest on one's laurels. The risk components evolve, and the response to that risk must evolve accordingly.
nb_no: Bruce Schneier, en verdenskjent sikkerhetsekspert (ikke bare på datasikkerhet), prøver å avlive en av de største mytene innen sikkerhet ved å si: «Sikkerhet er en prosess, ikke et produkt». Verdier som må beskyttes endrer seg over tid; det samme gjør truslene og tilgjengelige ressurser for mulige angripere. Selv om et sikkerhetsopplegg opprinnelig er perfekt konstruert og implementert, kan man ikke hvile på sine laurbær. Risikomomentene endrer seg, og da må tiltakene henge med.

source: Extra constraints are also worth taking into account, as they can restrict the range of available policies. How far are we willing to go to secure a system? This question has a major impact on the policy to implement. The answer is too often only defined in terms of monetary costs, but the other elements should also be considered, such as the amount of inconvenience imposed on system users or performance degradation.
nb_no: Andre begrensninger er også verdt å tenke på, ettersom de kan sette grenser for tilgjengelig sikkerhetsopplegg. Hvor langt er man villig til å gå for å sikre systemet? Dette spørsmålet har store konsekvenser for hva som skal implementeres. Det besvares altfor ofte kun utfra økonomi, selv om andre kriterier også bør tas i betraktning, som ulemper som påføres brukeren, og tap av ytelse.

source: Once the risk has been modeled, one can start thinking about designing an actual security policy.
nb_no: Når risikoen først er modellert, kan man begynne å tenke på å konstruere et faktisk sikkerhetsopplegg.

source: <emphasis>NOTE</emphasis> Extreme policies
nb_no: <emphasis>NB</emphasis> Ekstrem politikk

source: There are cases where the choice of actions required to secure a system is extremely simple.
nb_no: Det er tilfeller hvor valget av tiltak som kreves for å sikre et system er ekstremt enkle.

source: For instance, if the system to be protected only comprises a second-hand computer, the sole use of which is to add a few numbers at the end of the day, deciding not to do anything special to protect it would be quite reasonable. The intrinsic value of the system is low. The value of the data is zero since they are not stored on the computer. A potential attacker infiltrating this “system” would only gain an unwieldy calculator. The cost of securing such a system would probably be greater than the cost of a breach.
nb_no: For eksempel, hvis systemet som skal sikres bare består av en gammel brukt maskin, med sitt ene formål å legge sammen noen tall på slutten av dagen, ville det antakelig være helt legitimt å ikke gjøre noen ting – verdien som ligger i systemet er lav, og det er ingen verdi i dataene, ettersom de ikke lagres på maskinen. En potensiell angriper ville bare få tilgang til en uhåndterlig kalkulator. Kostnaden ved å sikre et slikt system ville sannsynligvis oppveie kostnaden av et eventuelt tap.

source: Extreme though these examples may seem, they would nevertheless be an adequate response to defined risks, insofar as they are the outcome of a thought process that takes into account the goals to reach and the constraints to fulfill. When coming from a reasoned decision, no security policy is less respectable than any other.
nb_no: Ekstreme som de er, disse eksemplene ville være adekvate responser for sine definerte risikoer, i den grad de er produktet av en tankeprosess som har tatt hensyn til målene som skal oppnås og begrensningene som må oppfylles. Så lenge den kommer fra en velinformert rasjonell beslutning, er intet sikkerhetsopplegg mindre respektabelt enn et annet.

source: In most cases, the information system can be segmented in consistent and mostly independent subsets. Each subsystem will have its own requirements and constraints, and so the risk assessment and the design of the security policy should be undertaken separately for each. A good principle to keep in mind is that a short and well-defined perimeter is easier to defend than a long and winding frontier. The network organization should also be designed accordingly: the sensitive services should be concentrated on a small number of machines, and these machines should only be accessible via a minimal number of check-points; securing these check-points will be easier than securing all the sensitive machines against the entirety of the outside world. It is at this point that the usefulness of network filtering (including by firewalls) becomes apparent. This filtering can be implemented with dedicated hardware, but a possibly simpler and more flexible solution is to use a software firewall such as the one integrated in the Linux kernel.
nb_no: I de fleste tilfeller kan informasjonssystemet segmenteres i konsistente og stort sett uavhengige subsett. Hvert subsystem vil ha sine egne krav og begrensninger, så risikovurderingen og utformingen av sikkerhetsopplegget bør gjøres separat for hvert subsystem. Et godt prinsipp å huske på er at en kort og veldefinert forsvarslinje er enklere å forsvare enn en lang og buktende en. Nettverksorganisasjonen bør også utformes tilsvarende: sensitive tjenester bør konsentreres på et lite antall maskiner, og disse maskinene bør bare være tilgjengelige via et minimalt antall innfallsporter; beskytting av disse innfallsportene vil være enklere enn å beskytte alle de sensitive maskinene mot den store utenomverdenen. Det er her nettverksfiltrering (inkludert brannmurer) kommer inn. Denne filtreringen kan implementeres med dedikert maskinvare, men en mulig enklere og mer fleksibel løsning er å bruke en programvarebrannmur, som den som er integrert i Linux-kjernen.

source: Firewall or Packet Filtering
nb_no: Brannmur eller pakkefiltrering

source: <primary>firewall</primary>
nb_no: <primary>brannmur</primary>

source: <primary>packet filter</primary>
nb_no: <primary>pakkefilter</primary>

source: <primary>packet</primary><secondary>IP</secondary>
nb_no: <primary>pakke</primary><secondary>IP</secondary>

source: A <emphasis>firewall</emphasis> is a piece of computer equipment with hardware and/or software that sorts the incoming or outgoing network packets (coming to or from a local network) and only lets through those matching certain predefined conditions.
nb_no: En <emphasis>brannmur</emphasis> er et stykke datautstyr med maskinvare og/eller programvare som sorterer innkommende og utgående nettverkspakker (som kommer til eller fra et lokalt nettverk) og bare slipper gjennom de som samsvarer med visse forhåndsbestemte betingelser.

source: A firewall is a filtering network gateway and is only effective on packets that must go through it. Therefore, it can only be effective when going through the firewall is the only route for these packets.
nb_no: En brannmur er en nettverksport for filtrering, og er bare effektiv på pakker som må gå gjennom den. Den kan derfor bare være effektiv når den eneste ruten for disse pakkene er gjennom brannmuren.

source: The lack of a standard configuration (and the “process, not product” motto) explains the lack of a turn-key solution. There are, however, tools that make it simpler to configure the <emphasis>netfilter</emphasis> firewall, with a graphical representation of the filtering rules. <command>fwbuilder</command> is undoubtedly among the best of them.
nb_no: Mangelen på en standard konfigurasjon (og «prosess, ikke produkt»-mottoet) forklarer mangelen av en nøkkelferdig løsning. Det fins derimot verktøy som gjør det enklere å konfigurere <emphasis>netfilter</emphasis>-brannmuren, med en grafisk representasjon av filter-reglene. <command>fwbuilder</command> er utvilsomt blant de beste av dem.

source: The Linux kernel embeds the <emphasis>netfilter</emphasis> firewall. It can be controlled from user space with the <command>iptables</command> and <command>ip6tables</command> commands. The difference between these two commands is that the former acts on the IPv4 network, whereas the latter acts on IPv6. Since both network protocol stacks will probably be around for many years, both tools will need to be used in parallel.
nb_no: Linux-kjernen inneholder <emphasis>netfilter</emphasis>-brannmuren. Den kan kontrolleres fra brukerrommet med kommandoen <command>iptables</command>- og <command>ip6tables</command>-kommandoene. Forskjellen mellom disse er at den første betjener IPv4-nettverket, mens den siste betjener IPv6. Siden begge nettverksprotokollene sannsynligvis vil fortsette å eksistere i årevis, vil begge verktøyene måtte brukes i parallell.

source: <emphasis>netfilter</emphasis> uses four distinct tables which store rules regulating three kinds of operations on packets:
nb_no: <emphasis>netfilter</emphasis> bruker fire forskjellige tabeller for regler om tre typer pakke-operasjoner:

source: <literal>nat</literal> concerns translation of source or destination addresses and ports of packages;
nb_no: <literal>nat</literal> for oversetting av kilde- eller destinasjons-adresser og porter på pakker;

source: The <literal>filter</literal> table has three standard chains:
nb_no: <literal>filter</literal>-tabellen har tre standardkjeder:

source: <literal>INPUT</literal>: concerns packets whose destination is the firewall itself;
nb_no: <literal>INPUT</literal>: gjelder pakker der destinasjon er brannmuren selv;

source: <literal>OUTPUT</literal>: concerns packets emitted by the firewall;
nb_no: <literal>OUTPUT</literal>: gjelder pakker som er sendt ut fra brannmuren;

source: <literal>FORWARD</literal>: concerns packets transiting through the firewall (which is neither their source nor their destination).
nb_no: <literal>FORWARD</literal>: gjelder pakker i transitt gjennom brannmuren (som verken er kilden eller destinasjon deres).

source: The <literal>nat</literal> table also has three standard chains:
nb_no: The <literal>nat</literal>-tabellen har også tre standardkjeder:

source: <literal>PREROUTING</literal>: to modify packets as soon as they arrive;
nb_no: <literal>PREROUTING</literal>: å endre pakker så snart de ankommer;

source: <literal>POSTROUTING</literal>: to modify packets when they are ready to go on their way;
nb_no: <literal>POSTROUTING</literal>: å modifisere pakker når de er klare til utsendelse;

source: <literal>OUTPUT</literal>: to modify packets generated by the firewall itself.
nb_no: <literal>OUTPUT</literal>: å modifisere pakker som genereres av selve brannmuren.

source: How <emphasis>netfilter</emphasis> chains are called
nb_no: Hvordan <emphasis>netfilter</emphasis>-kjeder påkalles

source: Each chain is a list of rules; each rule is a set of conditions and an action to execute when the conditions are met. When processing a packet, the firewall scans the appropriate chain, one rule after another; when the conditions for one rule are met, it “jumps” (hence the <literal>-j</literal> option in the commands) to the specified action to continue processing. The most common behaviors are standardized, and dedicated actions exist for them. Taking one of these standard actions interrupts the processing of the chain, since the packet's fate is already sealed (barring an exception mentioned below):
nb_no: Hver kjede er en liste med regler; Hver regel er et sett av betingelser og en handling som skal utføres når vilkårene er oppfylt. Ved behandling av en pakke, skanner brannmur den riktige kjeden, en regel etter den andre; når vilkårene for en regel er oppfylt, "hopper" det (derav <literal>-j</literal>-alternativet i kommandoene) til det angitte tiltak for å fortsette prosessen. De vanligste handlingene er standardisert, med foreliggende øremerkede handlinger. Å ta én av disse standardhandlingene forstyrrer prosessen for kjeden, fordi pakkens skjebne allerede er fastsatt (sperring et unntak som er nevnt nedenfor):

source: ICMP (<emphasis>Internet Control Message </emphasis>Protocol) is the protocol used to transmit complementary information on communications. It allows testing network connectivity with the <command>ping</command> command (which sends an ICMP <emphasis>echo request</emphasis> message, which the recipient is meant to answer with an ICMP <emphasis>echo reply</emphasis> message). It signals a firewall rejecting a packet, indicates an overflow in a receive buffer, proposes a better route for the next packets in the connection, and so on. This protocol is defined by several RFC documents; the initial RFC777 and RFC792 were soon completed and extended. <ulink type="block" url="http://www.faqs.org/rfcs/rfc777.html" /> <ulink type="block" url="http://www.faqs.org/rfcs/rfc792.html" />
nb_no: ICMP (<emphasis>Internet Control Message </emphasis>Protocol) er protokollen som brukes til å overføre utfyllende informasjon om kommunikasjon. Den tillater testing nettverkstilkobling med <command>ping</command>-kommandouen (som sender et ICMP <emphasis>echo request</emphasis>-budskap, som det er ment at mottakeren skal svare med et ICMP <emphasis>echo reply</emphasis>-budskap). Det signaliserer at en brannmur avviser en pakke, indikerer en mottaksbuffer er overfylt, foreslår en bedre rute for de neste pakkene i forbindelsen, og så videre. Denne protokollen er definert i flere RFC dokumenter; de opprinnelige RFC777 og RFC792 ble snart fullført og utvidet. <ulink type="block" url="http://www.faqs.org/rfcs/rfc777.html" /> <ulink type="block" url="http://www.faqs.org/rfcs/rfc792.html" />

source: For reference, a receive buffer is a small memory zone storing data between the time it arrives from the network and the time the kernel handles it. If this zone is full, new data cannot be received, and ICMP signals the problem, so that the emitter can slow down its transfer rate (which should ideally reach an equilibrium after some time).
nb_no: For referanse, en mottaksbuffer er en liten minnesone som lagrer data fra den tiden den kommer fra nettverket og til den tid kjernen håndterer den. Hvis denne sonen er full, kan nye data ikke mottas, og ICMP signaliserer problemet, slik at senderen kan bremse ned sin overføringshastighet (som bør ideelt sett nå en likevekt etter en tid).

source: Note that although an IPv4 network can work without ICMP, ICMPv6 is strictly required for an IPv6 network, since it combines several functions that were, in the IPv4 world, spread across ICMPv4, IGMP (<emphasis>Internet Group Membership Protocol</emphasis>) and ARP (<emphasis>Address Resolution Protocol</emphasis>). ICMPv6 is defined in RFC4443. <ulink type="block" url="http://www.faqs.org/rfcs/rfc4443.html" />
nb_no: Merk at selv om et IPv4-nettverk kan fungere uten ICMP, er ICMPv6 strengt nødvendig for et IPv6-nettverk, siden det kombinerer flere funksjoner som var i IPv4-verdenen, spredt over ICMPv4, IGMP( <emphasis>Internet Group Membership Protocol</emphasis>) og ARP (<emphasis>Address Resolution Protocol</emphasis>). ICMPv6 er definert i RFC4443. <ulink type="block" url="http://www.faqs.org/rfcs/rfc4443.html" />

source: <literal>ACCEPT</literal>: allow the packet to go on its way;
nb_no: <literal>ACCEPT</literal>: tillater pakken å fortsette på sin vei;

source: <literal>REJECT</literal>: reject the packet with an ICMP error packet (the <literal>--reject-with <replaceable>type</replaceable></literal> option to <command>iptables</command> allows selecting the type of error);
nb_no: <literal>REJECT</literal>: avviser pakken med en ICMP-feilpakke (<literal>--reject-with <replaceable>type</replaceable></literal>-valgeet til <command>iptables</command> tillater å velge typen feil);

source: <literal>DROP</literal>: delete (ignore) the packet;
nb_no: <literal>DROP</literal>: slette (ignorere) pakken;

source: <literal>LOG</literal>: log (via <command>syslogd</command>) a message with a description of the packet; note that this action does not interrupt processing, and the execution of the chain continues at the next rule, which is why logging refused packets requires both a LOG and a REJECT/DROP rule;
nb_no: <literal>LOG</literal>: logg (via <command>syslogd</command>) en melding med en beskrivelse av pakken. Merk at denne handlingen ikke avbryter prosessen, og kjøringen av kjeden fortsetter med den neste regelen, som er grunnen til at logging av avslåtte pakker krever både en LOG- og en REJECT/DROP-regel;

source: <literal>ULOG</literal>: log a message via <command>ulogd</command>, which can be better adapted and more efficient than <command>syslogd</command> for handling large numbers of messages; note that this action, like LOG, also returns processing to the next rule in the calling chain;
nb_no: <literal>ULOG</literal>: logger et budskap via <command>ulogd</command>, som kan tilpasses bedre og mer effektiv enn <command>syslogd</command> for håndtering av et stort antall meldinger. Merk at denne handlingen, slik som LOG, også returnerer prosessen til den neste regelen i påkallingskjeden;

source: <replaceable>chain_name</replaceable>: jump to the given chain and evaluate its rules;
nb_no: <replaceable>chain_name</replaceable>: hopper til den gitte kjeden og evaluerer dens regler,

source: <literal>RETURN</literal>: interrupt processing of the current chain, and return to the calling chain; in case the current chain is a standard one, there's no calling chain, so the default action (defined with the <literal>-P</literal> option to <command>iptables</command>) is executed instead;
nb_no: <literal>RETURN</literal>: avbryter prossesen til den gjeldende kjeden, og går tilbake til den anropende kjeden; i tilfelle den aktuelle kjeden er standard, er det ingen påkallingskjede, slik at standardhandlingen (definert med <literal>-P</literal>-valget til <command>iptables</command>) kjøres i stedet;

source: <literal>SNAT</literal> (only in the <literal>nat</literal> table): apply <emphasis>Source NAT</emphasis> (extra options describe the exact changes to apply);
nb_no: <literal>SNAT</literal> (bare i <literal>nat</literal>-tabellen): bruk <emphasis>Source NAT</emphasis> (ekstra alternativer beskriver nøyaktig de endringene som skal brukes);

source: <literal>DNAT</literal> (only in the <literal>nat</literal> table): apply <emphasis>Destination NAT</emphasis> (extra options describe the exact changes to apply);
nb_no: <literal>DNAT</literal> (bare i <literal>nat</literal>-tabellen): bruk <emphasis>Destination NAT</emphasis> (ekstra alternativer beskriver nøyaktig de endringene som skal brukes);

source: <literal>MASQUERADE</literal> (only in the <literal>nat</literal> table): apply <emphasis>masquerading</emphasis> (a special case of <emphasis>Source NAT</emphasis>);
nb_no: <literal>MASQUERADE</literal> (bare i <literal>nat</literal>-tabellen): bruk <emphasis>masquerading</emphasis> (et spesialtilfelle av <emphasis>Source NAT</emphasis>);
