Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: A “denial of service” attack has only one goal: to make a service unavailable. Whether such an attack involves overloading the server with queries or exploiting a bug, the end result is the same: the service is no longer operational. Regular users are unhappy, and the entity hosting the targeted network service suffers a loss in reputation (and possibly in revenue, for instance if the service was an e-commerce site).
nb_no: Et "tjenestenektangrep" har bare ett mål: Å gjøre en tjeneste utilgjengelig. Enten et slikt angrep innebærer å overbelaste tjeneren med henvendelser eller utnytte en feil, er sluttresultatet det samme: tjenesten er ikke lenger i drift. Vanlige brukere er misfornøyd, og enhetens vertsoppgaver nettverkstjenesten som rammes, lider et tap i omdømme (og muligens i inntekter, for eksempel hvis tjenesten var en e-handel).

source: Such an attack is sometimes “distributed”; this usually involves overloading the server with large numbers of queries coming from many different sources so that the server becomes unable to answer the legitimate queries. These types of attacks have gained well-known acronyms: <acronym>DDoS</acronym> and <acronym>DoS</acronym> (depending on whether the denial of service attack is distributed or not).
nb_no: Et slikt angrep er ofte "distribuert": Dette innebærer vanligvis å overbelaste tjeneren med et stort antall henvendelser som kommer fra mange forskjellige kilder, slik at tjeneren blir ute av stand til å svare på legitime henvendelser. Disse typer angrep har fått kjente forkortelser: <acronym>DDoS</acronym> og <acronym>DoS</acronym> (avhengig av om tjenestenektangrepet er distribuert eller ikke).

source: <command>suricata</command> (in the Debian package of the same name) is a NIDS — a <emphasis>Network Intrusion Detection System</emphasis>. Its function is to listen to the network and try to detect infiltration attempts and/or hostile acts (including denial of service attacks). All these events are logged in multiple files in <filename>/var/log/suricata</filename>. There are third party tools (Kibana/logstash) to better browse all the data collected. <ulink type="block" url="http://suricata-ids.org" /> <ulink type="block" url="https://www.elastic.co/products/kibana" />
nb_no: <command>suricata</command> (i Debian-pakken med samme navn) er et NIDS — et <emphasis>Network Intrusion Detection System</emphasis>. Oppgaven er å lytte til nettverket og prøve å oppdage infiltrasjonsforsøk og/ eller fiendtlige handlinger (inkludert tjenestenektangrep). Alle disse hendelsene blir logget i flere filer i <filename>/var/log/suricata</filename>. Det er tredjepartsverktøy (Kibana/logstash) som bedre kan søke igjennom alle innsamlede data. <ulink type="block" url="http://suricata-ids.org" /> <ulink type="block" url="https://www.elastic.co/products/kibana" />

source: <emphasis>CAUTION</emphasis> Range of action
nb_no: <emphasis>CAUTION</emphasis> Handlingsrom

source: The effectiveness of <command>suricata</command> is limited by the traffic seen on the monitored network interface. It will obviously not be able to detect anything if it cannot observe the real traffic. When plugged into a network switch, it will therefore only monitor attacks targeting the machine it runs on, which is probably not the intention. The machine hosting <command>suricata</command> should therefore be plugged into the “mirror” port of the switch, which is usually dedicated to chaining switches and therefore gets all the traffic.
nb_no: Effektiviteten til <command>suricata</command> er begrenset av trafikken som sees på det overvåkede nettverksgrensesnittet. Det vil åpenbart ikke være i stand til å oppdage noe, hvis det ikke kan observere den virkelige trafikken. Koblet til en nettverksvitsj, vil det derfor kun overvåke angrep mot maskinen det kjører på, som sannsynligvis ikke er intensjonen. Maskinens vertsoppgaver <command>suricata</command> bør derfor plugges til bryterens "speil"-port, som vanligvis er øremerket for kjedede brytere, og som derfor får all trafikk.

source: Configuring suricata involves reviewing and editing <filename>/etc/suricata/suricata-debian.yaml</filename>, which is very long because each parameter is abundantly commented. A minimal configuration requires describing the range of addresses that the local network covers (<literal>HOME_NET</literal> parameter). In practice, this means the set of all potential attack targets. But getting the most of it requires reading it in full and adapting it to the local situation.
nb_no: Å sette opp suricata innebærer å gjennomgå og redigere <filename>/etc/suricata/suricata-debian.yaml</filename>, som er veldig lang fordi hvert parameter er rikelig kommentert. En minimal konfigurasjon krever beskrivelse av området med adresser som det lokale nettverket dekker (<literal>HOME_NET</literal> parameter). I praksis betyr dette hele settet med mulige angrepsmål. Men å få det meste ut av den, krever å lese den i sin helhet og tilpasse den til den lokale situasjonen.

source: On top of this, you should also edit <filename>/etc/default/suricata</filename> to define the network interface to monitor and to enable the init script (by setting <literal>RUN=yes</literal>). You might also want to set <literal>LISTENMODE=pcap</literal> because the default <literal>LISTENMODE=nfqueue</literal> requires further configuration to work properly (the netfilter firewall must be configured to pass packets to some user-space queue handled by suricata via the <literal>NFQUEUE</literal> target).
nb_no: På toppen av dette, må du også redigere <filename>/etc/default/suricata</filename> for å definere nettverksgrensesnittet som skal overvåke og å aktivere init script-et (ved å sette <literal>RUN=yes</literal>). Du kan også ønske å sette <literal>LISTENMODE=pcap</literal> fordi standard <literal>LISTENMODE=nfqueue</literal> krever ytterligere konfigurasjon for å fungere riktig (nettfilter brannmuren må konfigureres til å videresende pakker til en brukerområde-kø som håndteres av suricata via <literal>NFQUEUE</literal>-målet).

source: To detect bad behaviour, <command>suricata</command> needs a set of monitoring rules: you can find such rules in the <emphasis role="pkg">snort-rules-default</emphasis> package. <command>snort</command> is the historical reference in the IDS ecosystem and <command>suricata</command> is able to reuse rules written for it. Unfortunately that package is missing from <emphasis role="distribution">Debian Jessie</emphasis> and should be retrieved from another Debian release like <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>.
nb_no: For å oppdage feilaktig oppførsel, trenger <command>suricata</command> et sett med overvåkingsregler: Du kan finne slike regler i <emphasis role="pkg">snort-rules-default</emphasis>-pakken. <command>snort</command> er den historiske referansen i IDS-økosystemet og <command>suricata</command> kan gjenbruke regler skrevet for den. Dessverre mangler denne pakken i <emphasis role="distribution">Debian Jessie</emphasis>, og bør hentes fra en annen Debian utgivelse som <emphasis role="distribution">Testing</emphasis> eller <emphasis role="distribution">Unstable</emphasis>.

source: Alternatively, <command>oinkmaster</command> (in the package of the same name) can be used to download Snort rulesets from external sources.
nb_no: Alternativt kan, <command>oinkmaster</command> (i pakken med samme navn) brukes til å laste ned Snort regelsett fra eksterne kilder.

source: Prelude brings centralized monitoring of security information. Its modular architecture includes a server (the <emphasis>manager</emphasis> in <emphasis role="pkg">prelude-manager</emphasis>) which gathers alerts generated by <emphasis>sensors</emphasis> of various types.
nb_no: Prelude leverer sentralisert overvåking av sikkerhetsinformasjon. Den modulære arkitekturen inkluderer en tjener (<emphasis>manager</emphasis> i <emphasis role="pkg">prelude-manager</emphasis>) som samler varsler generert av <emphasis>sensors</emphasis> av ulike typer.

source: Suricata can be configured as such a sensor. Other possibilities include <emphasis>prelude-lml</emphasis> (<emphasis>Log Monitor Lackey</emphasis>) which monitors log files (in a manner similar to <command>logcheck</command>, described in <xref linkend="sect.logcheck" />).
nb_no: Suricata kan konfigureres som en slik sensor. Andre muligheter inkluderer <emphasis>prelude-lml</emphasis> (<emphasis>Log Monitor Lackey</emphasis>) som overvåker loggfiler (på en måte som svarer til <command>logcheck</command>, beskrevet i <xref linkend="sect.logcheck" />).

source: Introduction to AppArmor
nb_no: Introduksjon til AppArmor

source: Principles
nb_no: Prinsipper

source: AppArmor is a <emphasis>Mandatory Access Control</emphasis> (MAC) system built on Linux's LSM (<emphasis>Linux Security Modules</emphasis>) interface. In practice, the kernel queries AppArmor before each system call to know whether the process is authorized to do the given operation. Through this mechanism, AppArmor confines programs to a limited set of resources.
nb_no: AppArmor er et <emphasis>Mandatory Access Control</emphasis> (MAC) system som bygger på Linux's LSM (<emphasis>Linux Security Modules</emphasis>) grensesnitt. I praksis spør kjernen AppArmor før hver system kaller for å få vite om prosessen er autorisert til utføre den gitte operasjonen. Gjennom denne mekanismen, begrenser AppArmor programmer til et begrenset sett med ressurser.

source: AppArmor applies a set of rules (known as “profile”) on each program. The profile applied by the kernel depends on the installation path of the program being executed. Contrary to SELinux (discussed in <xref linkend="sect.selinux" />), the rules applied do not depend on the user. All users face the same set of rules when they are executing the same program (but traditional user permissions still apply and might result in different behaviour!).
nb_no: AppArmor anvender et sett med regler (kjent som "profil") på hvert program. Profilen som kjernen bruker avhenger av installasjonsbanen til programmet som kjøres. I motsetning til SELinux (omtalt i <xref linkend="sect.selinux" />), er ikke reglene som brukes avhengig av brukeren. Alle brukere står overfor samme regelverk når de utfører samme program (men tradisjonelle brukertillatelser gjelder fortsatt, og kan resultere i ulik atferd!).

source: AppArmor profiles are stored in <filename>/etc/apparmor.d/</filename> and they contain a list of access control rules on resources that each program can make use of. The profiles are compiled and loaded into the kernel by the <command>apparmor_parser</command> command. Each profile can be loaded either in enforcing or complaining mode. The former enforces the policy and reports violation attempts, while the latter does not enforce the policy but still logs the system calls that would have been denied.
nb_no: AppArmor profiler er lagret i <filename>/etc/apparmor.d/</filename> og de inneholder en liste med Hver profil kan legges enten i håndheve eller klagende modus. Den tidligere håndhever politikk og rapporterer brudd forsøk, mens sistnevnte ikke håndheve politikken, men likevel logger systemkall som ville ha blitt nektet. for ressurser som hvert program kan gjøre bruk av. Profilene er kompilert og lastet inn i kjernen av <command>apparmor_parser</command>-kommandoen. Hver profil kan legges enten i håndhevings- eller klage-modus. Den første håndhever politikk og rapporterer krenkingsforsøk, mens sistnevnte ikke håndhever policyen, men likevel logger systempåkallinger som ville ha blitt nektet.

source: Enabling AppArmor and managing AppArmor profiles
nb_no: Å aktivere AppArmor og håndtere AppArmor profiler

source: AppArmor support is built into the standard kernels provided by Debian. Enabling AppArmor is thus just a matter of installing a few packages and adding some parameters to the kernel command line:
nb_no: AppArmor støtte er bygget inn i Debians standard kjerner. Å aktivere AppArmor er dermed bare et spørsmål om å installere noen få pakker og legge noen parametere til kjernens kommandolinje:

source: After a reboot, AppArmor is now functional and <command>aa-status</command> will confirm it quickly:
nb_no: Etter en omstart virker AppArmor, og <command>aa-status</command> vil raskt bekrefte det:

source: <emphasis>NOTE</emphasis> More AppArmor profiles
nb_no: <emphasis>NOTE</emphasis> Flere AppArmor profiler

source: The <emphasis role="pkg">apparmor-profiles</emphasis> package contains profiles managed by the upstream AppArmor community. To get even more profiles you can install <emphasis role="pkg">apparmor-profiles-extra</emphasis> which contains profiles developed by Ubuntu and Debian.
nb_no: <emphasis role="pkg">apparmor-profiles</emphasis>-pakken inneholder profiler som forvaltes av oppstrøms AppArmor community. For å få enda flere profiler du kan installere <emphasis role="pkg">apparmor-profiles-extra</emphasis> med profiler utviklet av Ubuntu og Debian.

source: The state of each profile can be switched between enforcing and complaining with calls to <command>aa-enforce</command> and <command>aa-complain</command> giving as parameter either the path of the executable or the path to the policy file. Additionaly a profile can be entirely disabled with <command>aa-disable</command> or put in audit mode (to log accepted system calls too) with <command>aa-audit</command>.
nb_no: Tilstanden for hver profil kan veksle mellom håndheving og klager med anrop til <command>aa-enforce</command> og <command>aa-complain</command> som gir som parameter enten banen til den kjørbare filen eller til policy-filen. I tillegg kan en profil helt deaktiveres <command>aa-disable</command> eller sette in revisjonsmodus (for å logge aksepterte systemanrop også) med <command>aa-audit</command>.

source: Creating a new profile
nb_no: Å lage en ny profil

source: Even though creating an AppArmor profile is rather easy, most programs do not have one. This section will show you how to create a new profile from scratch just by using the target program and letting AppArmor monitor the system call it makes and the resources it accesses.
nb_no: Selv om å opprette en AppArmor profil er ganske enkelt, mangler de fleste programmer en. Denne seksjonen vil vise deg hvordan du oppretter en ny profil fra bunnen av bare ved hjelp av målprogrammet og la AppArmor overvåke system-anropene det lager og ressursene det har tilgang til.

source: The most important programs that need to be confined are the network facing programs as those are the most likely targets of remote attackers. That is why AppArmor conveniently provides an <command>aa-unconfined</command> command to list the programs which have no associated profile and which expose an open network socket. With the <literal>--paranoid</literal> option you get all unconfined processes that have at least one active network connection.
nb_no: De viktigste programmene trenger beskyttelse er nettverket som vender mot programmer, ettersom de er de mest sannsynlige mål for eksterne angripere. Det er derfor AppArmor beleilig nok tilbyr en <command>aa-unconfined</command>-kommando for å liste programmer som ikke har noen tilknyttet profil og som eksponerer en åpent nettverk socket. Med <literal>--paranoid</literal>-alternativet får du alle ubeskyttede prosesser med minst én aktiv nettverkstilkobling.

source: In the following example, we will thus try to create a profile for <command>/sbin/dhclient</command>. For this we will use <command>aa-genprof dhclient</command>. It will invite you to use the application in another window and when done to come back to <command>aa-genprof</command> to scan for AppArmor events in the system logs and convert those logs into access rules. For each logged event, it will make one or more rule suggestions that you can either approve or further edit in multiple ways:
nb_no: I følgende eksempel, vil vi derfor forsøke å opprette en profil for <command>/sbin/dhclient</command>. Til dette vil vi bruke <command>aa-genprof dhclient</command>. Den vil invitere deg til å bruke programmet i et annet vindu, og når du er ferdig å komme tilbake til <command>aa-genprof</command> for å søke etter AppArmor-hendelser i systemloggene og konvertere disse loggene til adgangsregler. For hver logget hendelse, vil den lage ett eller flere regelforslag som du enten kan godkjenne eller redigere videre på flere måter:

source: Note that the program does not display back the control characters that you type but for the clarity of the explanation I have included them in the previous transcript.
nb_no: Merk at programmet ikke viser tilbake kontrolltegnene du skriver, men for klarheten i forklaringen har jeg tatt med dem med i forrige utskriften.

source: The first event detected is the execution of another program. In that case, you have multiple choices: you can run the program with the profile of the parent process (the “Inherit” choice), you can run it with its own dedicated profile (the “Profile” and the “Named” choices, differing only by the possibility to use an arbitrary profile name), you can run it with a sub-profile of the parent process (the “Child” choice), you can run it without any profile (the “Unconfined” choice) or you can decide to not run it at all (the “Deny” choice).
nb_no: Den første oppdagede hendelsen er kjøring av et annet program. I så fall har du flere valg: Du kan kjøre programmet med profilen til den overordnede prosessen ("Inhernt"-valget), du kan kjøre den med sin egen dedikerte profil ("Profil"- og "Named"-valgene, som bare avviker i muligheten til å bruke et vilkårlig profilnavn), du kan kjøre den med en under-profilen til den overordnede prosessen ("Child"-valget), du kan kjøre den uten profil ("Unconfined"-valget), eller du kan bestemme deg for å ikke kjøre i det hele tatt ("Deny"-valget).

source: Note that when you opt to run it under a dedicated profile that doesn't exist yet, the tool will create the missing profile for you and will make rule suggestions for that profile in the same run.
nb_no: Merk at når du velger å kjøre den under en øremerket profil som ikke finnes ennå, vil verktøyet opprette den manglende profilen for deg og lager regelforslag for den profilen i det samme løpet.

source: At the kernel level, the special powers of the root user have been split in “capabilities”. When a system call requires a specific capability, AppArmor will verify whether the profile allows the program to make use of this capability.
nb_no: På kjerne nivå, er de spesielle rettighetene til rotbrukeren delt etter "kvalifikasjoner". Når en systempåkalling krever en bestemt kvalifikasjon, vil AppArmor verifisere om profilen tillater programmet å bruke denne muligheten.

source: Here the program seeks read permissions for <filename>/etc/nsswitch.conf</filename>. <command>aa-genprof</command> detected that this permission was also granted by multiple “abstractions” and offers them as alternative choices. An abstraction provides a reusable set of access rules grouping together multiple resources that are commonly used together. In this specific case, the file is generally accessed through the nameservice related functions of the C library and we type “3” to first select the “#include &lt;abstractions/nameservice&gt;” choice and then “A” to allow it.
nb_no: Her søker programmet lesetillatelse for <filename>/etc/nsswitch.conf</filename>. <command>aa-genprof</command> oppdaget at denne tillatelsen ble også gitt av flere "abstraksjoner", og tilbyr dem som alternative valg. En abstraksjon tilbyr et gjenbrukbar sett tilgangsregler som grupperer sammen flere ressurser som ofte brukes sammen. I dette konkrete tilfellet, blir filen vanligvis nådd gjennom navnetjenestens relaterte funksjoner i C-biblioteket, og vi skriver "3" for å først å velge "#include &lt;abstractions/nameservice&gt;”-valget og så “A” for å tillate det.

source: The program wants to create the <filename>/run/dhclient-eth0.pid</filename> file. If we allow the creation of this specific file only, the program will not work when the user will use it on another network interface. Thus we select “New” to replace the filename with the more generic “/run/dhclient*.pid” before recording the rule with “Allow”.
nb_no: Programmet vil opprette <filename>/run/dhclient-eth0.pid</filename> filen. Hvis vi bare tillater å opprette denne bestemte filen, vil programmet ikke fungerer når brukeren skal bruke det i et annet nettverksgrensesnitt. Derfor kan vi velge "New" for å erstatte filnavnet med det mer generiske “/run/dhclient*.pid” før regelen spilles inn med “Allow”.

source: Notice that this access request is not part of the dhclient profile but of the new profile that we created when we allowed <filename>/usr/lib/NetworkManager/nm-dhcp-helper</filename> to run with its own profile.
nb_no: Legg merke til at denne tilgangsforespørselen er ikke en del av dhclient profilen, men av den nye profilen som vi laget når vi tillot <filename>/usr/lib/NetworkManager/nm-dhcp-helper</filename> å kjøre med sin egen profil.

source: After having gone through all the logged events, the program offers to save all the profiles that were created during the run. In this case, we have two profiles that we save at once with “Save” (but you can save them individually too) before leaving the program with “Finish”.
nb_no: Etter å ha gått gjennom alle de loggede hendelsene, tilbyr programmet å lagre alle profilene som ble opprettet under kjøringen. I dette tilfellet har vi to profiler som vi sparer med én gang med "Save" (men du kan lagre dem enkeltvis også) før du forlater programmet med "Finish".

source: <command>aa-genprof</command> is in fact only a smart wrapper around <command>aa-logprof</command>: it creates an empty profile, loads it in complain mode and then run <command>aa-logprof</command> which is a tool to update a profile based on the profile violations that have been logged. So you can re-run that tool later to improve the profile that you just created.
nb_no: <command>aa-genprof</command> er i realiteten bare et smart omslag rundt <command>aa-logprof</command>: Den skaper en tom profil, laster den inn klagemodus, og kjører deretter <command>aa-logprof</command>, som er et verktøy for å oppdatere en profil basert på profilovertredelsen som har blitt logget. Så du kan kjøre dette verktøyet igjen senere for å forbedre profilen du nettopp opprettet.

source: If you want the generated profile to be complete, you should use the program in all the ways that it is legitimately used. In the case of dhclient, it means running it via Network Manager, running it via ifupdown, running it manually, etc. In the end, you might get a <filename>/etc/apparmor.d/sbin.dhclient</filename> close to this:
nb_no: Hvis du vil ha den genererte profilen komplett, bør du bruke programmet på alle måter det legitimt å bruke det. Med dhclient, betyr det å kjøre den via Network Manager, å kjører den via ifupdown, å kjøre den manuelt, etc. Til slutt, kan du få en <filename>/etc/apparmor.d/sbin.dhclient</filename> nær denne:

source: Introduction to SELinux
nb_no: Introduksjon til SELinux

source: SELinux (<emphasis>Security Enhanced Linux</emphasis>) is a <emphasis>Mandatory Access Control</emphasis> system built on Linux's LSM (<emphasis>Linux Security Modules</emphasis>) interface. In practice, the kernel queries SELinux before each system call to know whether the process is authorized to do the given operation.
nb_no: SELinux (<emphasis>Security Enhanced Linux</emphasis>) er et <emphasis>Mandatory Access Control</emphasis>-system som bygger på Linux sin LSM (<emphasis>Linux Security Modules</emphasis>)-grensesnitt. I praksis spør kjernen SELinux før hver systempåkalling for å vite om prosessen er autorisert til å gjøre den gitte operasjonen.
