Repository: Debian-VN/debian-handbook
Catalog: */14_security.po
Languages: nb_no

source: <command>semanage user -l</command> lists the mapping between SELinux user identities and allowed roles. Adding a new identity requires to define both the corresponding roles and a labeling prefix which is used to assign a type to personal files (<filename>/home/<replaceable>user</replaceable>/*</filename>). The prefix must be picked among <literal>user</literal>, <literal>staff</literal>, and <literal>sysadm</literal>. The “<literal>staff</literal>” prefix results in files of type “<literal>staff_home_dir_t</literal>”. Creating a new SELinux user identity is done with <command>semanage user -a -R <replaceable>roles</replaceable> -P <replaceable>prefix</replaceable> <replaceable>identity</replaceable></command>. Finally, you can remove an SELinux user identity with <command>semanage user -d <replaceable>identity</replaceable></command>.
nb_no: <command>semanage user -l</command> viser adresseringen mellom SELinux-brukeridentiteter og tillatte roller. Å legge til en ny identitet krever å definere både de tilsvarende rollene og en merkingsforstavelse som brukes til å tilordne en type til personlige filer (<filename>/home/<replaceable>user</replaceable>/*</filename>). Forstavelosen må velges mellom <literal>user</literal>, <literal>staff</literal>, og <literal>sysadm</literal>. “<literal>staff</literal>”-forstavelsen resulterer i filer av typen “<literal>staff_home_dir_t</literal>”. Å lage en ny SELinux-brukeridentitet gjøres med <command>semanage user -a -R <replaceable>roles</replaceable> -P <replaceable>prefix</replaceable> <replaceable>identity</replaceable></command>. Til slutt, du kan fjerne en SELinux-brukeridentitet med <command>semanage user -d <replaceable>identity</replaceable></command>.

source: Managing File Contexts, Ports and Booleans
nb_no: Å håndtere filkontekster, porter og boolske verdier

source: Each SELinux module provides a set of file labeling rules, but it is also possible to add custom labeling rules to cater to a specific case. For example, if you want the web server to be able to read files within the <filename>/srv/www/</filename> file hierarchy, you could execute <command>semanage fcontext -a -t httpd_sys_content_t "/srv/www(/.*)?"</command> followed by <command>restorecon -R /srv/www/</command>. The former command registers the new labeling rules and the latter resets the file types according to the current labeling rules.
nb_no: Hver SELinux-modul har et sett av filmerkingsregler, men det er også mulig å legge til egendefinerte regler for merking for å ta hensyn til et bestemt tilfelle. For eksempel, hvis du vil at nett-tjeneren, for å kunne lese filene i <filename>/srv/www/</filename>-filhierarkiet, kan du kjøre <command>semanage fcontext -a -t httpd_sys_content_t "/srv/www(/.*)?"</command> fulgt av <command>restorecon -R /srv/www/</command>. Førstnevnte kommando registrerer nye regler for merking, og sistnevnte tilbakestiller filtypene etter gjeldende regler for merking.

source: Similarly, TCP/UDP ports are labeled in a way that ensures that only the corresponding daemons can listen to them. For instance, if you want the web server to be able to listen on port 8080, you should run <command>semanage port -m -t http_port_t -p tcp 8080</command>.
nb_no: Tilsvarende er TCP/UDP-portene merket på en måte som sikrer at bare de tilsvarende nissene kan lytte til dem. For eksempel, hvis du vil at nett-tjeneren skal kunne lytte på port 8080, bør du kjøre <command>semanage port -m -t http_port_t -p tcp 8080</command>.

source: Some SELinux modules export boolean options that you can tweak to alter the behavior of the default rules. The <command>getsebool</command> utility can be used to inspect those options (<command>getsebool <replaceable>boolean</replaceable></command> displays one option, and <command>getsebool -a</command> them all). The <command>setsebool <replaceable>boolean</replaceable> <replaceable>value</replaceable></command> command changes the current value of a boolean option. The <literal>-P</literal> option makes the change permanent, it means that the new value becomes the default and will be kept across reboots. The example below grants web servers an access to home directories (this is useful when users have personal websites in <filename>~/public_html/</filename>).
nb_no: Noen SELinux-moduler eksporterer boolske valg som du kan justere for å endre gjøremålene til standardreglene. <command>getsebool</command>-verktøyet kan brukes til å inspisere disse valgene (<command>getsebool <replaceable>boolean</replaceable></command> viser ett valg, og <command>getsebool -a</command> alle). <command>setsebool <replaceable>boolean</replaceable> <replaceable>value</replaceable></command>-kommandoen endrer den gjeldende verdien av et boolsk alternativ. <literal>-P</literal>-valget gjør endringen permanent, det betyr at den nye verdien blir standard og blir beholdt etter restart. Eksempelet nedenfor gir nett-tjenere tilgang til hjemmeområder (dette er nyttig når brukerne har personlige nettsteder i <filename>~/public_html/</filename>).

source: Adapting the Rules
nb_no: Å tilpasse reglene

source: Since the SELinux policy is modular, it might be interesting to develop new modules for (possibly custom) applications that lack them. These new modules will then complete the <emphasis>reference policy</emphasis>.
nb_no: Siden SELinux-opplegget er modulbasert, kan det være interessant å utvikle nye moduler for (muligens tilpassede) programmer som mangler dem. Disse nye modulene vil da komplettere <emphasis>reference policy</emphasis>.

source: To create new modules, the <emphasis role="pkg">selinux-policy-dev</emphasis> package is required, as well as <emphasis role="pkg">selinux-policy-doc</emphasis>. The latter contains the documentation of the standard rules (<filename>/usr/share/doc/selinux-policy-doc/html/</filename>) and sample files that can be used as templates to create new modules. Install those files and study them more closely:
nb_no: For å lage nye moduler, kreves <emphasis role="pkg">selinux-policy-dev</emphasis>-pakken så vel som <emphasis role="pkg">selinux-policy-doc</emphasis>. Den siste inneholder dokumentasjonen om standardreglene (<filename>/usr/share/doc/selinux-policy-doc/html/</filename>) og eksempelfiler som kan brukes som maler for å lage nye moduler. Installer disse filene og studer dem nærmere:

source: The <filename>.te</filename> file is the most important one. It defines the rules. The <filename>.fc</filename> file defines the “file contexts”, that is the types assigned to files related to this module. The data within the <filename>.fc</filename> file are used during the file labeling step. Finally, the <filename>.if</filename> file defines the interface of the module: it is a set of “public functions” that other modules can use to properly interact with the module that you're creating.
nb_no: <filename>.te</filename>-filen er den viktigste. Den definerer reglene. <filename>.fc</filename>-filen definerer "filkonteksten", det er typene som er tilordnet filer knyttet til denne modulen. Dataene innenfor <filename>.fc</filename>-filen brukes under filemerkingstrinnet. Endelig definerer <filename>.if</filename>-filen modulens grensesnittet: Det er et sett med "offentlige funksjoner" som andre moduler kan bruke til en riktig samhandling med modulen du oppretter.

source: Writing a <filename>.fc</filename> file
nb_no: Å skrive en <filename>.fc</filename>-fil

source: Reading the below example should be sufficient to understand the structure of such a file. You can use regular expressions to assign the same security context to multiple files, or even an entire directory tree.
nb_no: Å lese eksemplet nedenfor bør være tilstrekkelig til å forstå strukturen i en slik fil. Du kan bruke vanlige uttrykk for å tilordne den samme sikkerhetskonteksten til flere filer, eller til og med til et helt katalogtre.

source: Writing a <filename>.if</filename> File
nb_no: Å skrive en <filename>.if</filename>-fil

source: In the sample below, the first interface (“<literal>myapp_domtrans</literal>”) controls who can execute the application. The second one (“<literal>myapp_read_log</literal>”) grants read rights on the application's log files.
nb_no: I eksemplet nedenfor, det første grensesnittet (“<literal>myapp_domtrans</literal>”) kontrollerer hvem som kan kjøre programmet. Det andre (“<literal>myapp_read_log</literal>”) gir leserettigheter til programmets logg filer.

source: Each interface must generate a valid set of rules which can be embedded in a <filename>.te</filename> file. You should thus declare all the types that you use (with the <literal>gen_require</literal> macro), and use standard directives to grant rights. Note, however, that you can use interfaces provided by other modules. The next section will give more explanations about how to express those rights.
nb_no: Hvert grensesnitt må generere et gyldig sett med regler som kan legges inn i en <filename>.te</filename>-fil. Du bør derfor formidle alle typene du bruker (med <literal>gen_require</literal>-makro), og bruke standard-direktiver for å gi rettigheter. Vær imidlertid oppmerksom på at du kan bruke grensesnitt som tilbys av andre moduler. Den neste seksjonen vil gi flere forklaringer om hvordan disse rettighetene skal uttrykkes.

source: <filename>example.if</filename> File
nb_no: <filename>example.if</filename> fil

source: <emphasis>DOCUMENTATION</emphasis> Explanations about the <emphasis>reference policy</emphasis>
nb_no: <emphasis>DOCUMENTATION</emphasis> Forklaringer om <emphasis>reference policy</emphasis>

source: The <emphasis>reference policy</emphasis> evolves like any free software project: based on volunteer contributions. The project is hosted by Tresys, one of the most active companies in the SELinux field. Their wiki contains explanations on how the rules are structured and how you can create new ones. <ulink type="block" url="https://github.com/TresysTechnology/refpolicy/wiki/GettingStarted" />
nb_no: <emphasis>reference policy</emphasis> utvikler seg som alle fri programvare-prosjekt: basert på frivillige bidrag. Tresys er vert for prosjektet, en av de mest aktive selskapene på SELinux-feltet. Wikien deres har forklaringer på hvordan reglene er strukturert og hvordan du kan lage nye. <ulink type="block" url="https://github.com/TresysTechnology/refpolicy/wiki/GettingStarted" />

source: Writing a <filename>.te</filename> File
nb_no: Å skrive en <filename>.te</filename>-fil

source: Have a look at the <filename>example.te</filename> file:
nb_no: Se på <filename>example.te</filename>-filen:

source: <emphasis>GOING FURTHER</emphasis> The <command>m4</command> macro language
nb_no: <emphasis>GOING FURTHER</emphasis> The <command>m4</command> makrospråk

source: To properly structure the policy, the SELinux developers used a macro-command processor. Instead of duplicating many similar <emphasis>allow</emphasis> directives, they created “macro functions” to use a higher-level logic, which also results in a much more readable policy.
nb_no: For å strukturere opplegget riktig, brukte SELinux-utviklerne en makro-kommando-prosessor. I stedet for å duplisere mange lignende <emphasis>allow</emphasis>-direktiver, laget de "makrofunksjoner " for å bruke en høyere-nivå logikk, som også resulterer i en mye mer lesbart opplegg.

source: In practice, <command>m4</command> is used to compile those rules. It does the opposite operation: it expands all those high-level directives into a huge database of <emphasis>allow</emphasis> directives.
nb_no: I praksis blir <command>m4</command> brukt til å sette sammen disse reglene. Den gjør den motsatte operasjonen: det utvider alle disse høyt nivå direktivene inn i en stor database med <emphasis>allow</emphasis>-direktiver.

source: The SELinux “interfaces” are only macro functions which will be substituted by a set of rules at compilation time. Likewise, some rights are in fact sets of rights which are replaced by their values at compilation time.
nb_no: SELinux-"grensesnittene" er bare makrofunksjoner som vil bli erstattet av et sett med regler på kompileringstidspunktet. På samme måte er noen rettigheter er faktisk sett av rettigheter som er byttet ut med sine verdier på kompileringstidspunktet.

source: The module must be identified by its name and version number. This directive is required.
nb_no: Modulen må identifiseres med navn og versjonsnummer. Dette direktivet er nødvendig.

source: If the module introduces new types, it must declare them with directives like this one. Do not hesitate to create as many types as required rather than granting too many useless rights.
nb_no: Hvis modulen introduserer nye typer, må den si ifra om dem med direktiver som dette. Ikke nøl med å lage så mange typer som kreves i stedet for å gi for mange ubrukelige rettigheter.

source: Those interfaces define the <literal>myapp_t</literal> type as a process domain that should be used by any executable labeled with <literal>myapp_exec_t</literal>. Implicitly, this adds an <literal>exec_type</literal> attribute on those objects, which in turn allows other modules to grant rights to execute those programs: for instance, the <literal>userdomain</literal> module allows processes with domains <literal>user_t</literal>, <literal>staff_t</literal>, and <literal>sysadm_t</literal> to execute them. The domains of other confined applications will not have the rights to execute them, unless the rules grant them similar rights (this is the case, for example, of <command>dpkg</command> with its <literal>dpkg_t</literal> domain).
nb_no: De grensesnittene definerer <literal>myapp_t</literal>-typen som et prosessdomene som skal brukes av alle kjørbare merket med <literal>myapp_exec_t</literal>. Implisitt, de legger til en <literal>exec_type</literal>-attributt til disse objektene, som igjen tillater andre moduler å tildele rettigheter til å kjøre disse programmene, for eksempel tillater <literal>userdomain</literal>-modulen prosesser med domene <literal>user_t</literal>, <literal>staff_t</literal>, og <literal>sysadm_t</literal> til å kjøre dem. Domenene til andre avstengte programmer vil ikke ha rettigheter til å kjøre dem, med mindre reglene gir dem lignende rettigheter (dette er tilfelle, for eksempel, med <command>dpkg</command> med sitt <literal>dpkg_t</literal>-domene).

source: <literal>logging_log_file</literal> is an interface provided by the reference policy. It indicates that files labeled with the given type are log files which ought to benefit from the associated rules (for example granting rights to <command>logrotate</command> so that it can manipulate them).
nb_no: <literal>logging_log_file</literal> er et grensesnitt som tilbys av referanseopplegget. Det indikerer at filene er merket med den gitte typen er loggfiler¸ som burde dra nytte av de tilhørende reglene (for eksempel å gi rettigheter til <command>logrotate</command> slik at den kan håndtere dem).

source: The <literal>allow</literal> directive is the base directive used to authorize an operation. The first parameter is the process domain which is allowed to execute the operation. The second one defines the object that a process of the former domain can manipulate. This parameter is of the form “<replaceable>type</replaceable>:<replaceable>class</replaceable>“ where <replaceable>type</replaceable> is its SELinux type and <replaceable>class</replaceable> describes the nature of the object (file, directory, socket, fifo, etc.). Finally, the last parameter describes the permissions (the allowed operations).
nb_no: <literal>allow</literal>-direktivet er basen direktivet bruker til å godkjenne en operasjon. Den første parameteren er prosessdomenet som har lov til å utføre operasjonen. Det andre definerer objektet som en prosess som det tidligere domenet kan håndtere. Denne parameteren har formen “<replaceable>type</replaceable>:<replaceable>class</replaceable>“ der <replaceable>type</replaceable> er dens SELinux-type, og <replaceable>class</replaceable> beskriver hva slags objekt (fil, mappe, socket, fifi, etc.). Til slutt beskriver den siste parameteren tillatelsene (de tillatte operasjonene).

source: Permissions are defined as the set of allowed operations and follow this template: <literal>{ <replaceable>operation1</replaceable> <replaceable>operation2</replaceable> }</literal>. However, you can also use macros representing the most useful permissions. The <filename>/usr/share/selinux/devel/include/support/obj_perm_sets.spt</filename> lists them.
nb_no: Tillatelser er definert som et sett av tillatte operasjoner og følger denne malen: <literal>{ <replaceable>operation1</replaceable> <replaceable>operation2</replaceable> }</literal>. Men du kan også bruke makroer som representerer de nyttigste tillatelsene.<filename>/usr/share/selinux/devel/include/support/obj_perm_sets.spt</filename> lister dem.

source: The following web page provides a relatively exhaustive list of object classes, and permissions that can be granted. <ulink type="block" url="http://www.selinuxproject.org/page/ObjectClassesPerms" />
nb_no: Følgende nettside gir en relativt uttømmende liste over objektklasser og tillatelser som kan gis. <ulink type="block" url="http://www.selinuxproject.org/page/ObjectClassesPerms" />

source: Now you just have to find the minimal set of rules required to ensure that the target application or service works properly. To achieve this, you should have a good knowledge of how the application works and of what kind of data it manages and/or generates.
nb_no: Nå er det bare å finne det minimalt settet med regler som kreves for å sikre at målprogrammet eller tjenesten fungerer som det skal. For å oppnå dette, bør du ha god kunnskap om hvordan programmet fungerer og hva slags data det styrer og/eller genererer.

source: However, an empirical approach is possible. Once the relevant objects are correctly labeled, you can use the application in permissive mode: the operations that would be forbidden are logged but still succeed. By analyzing the logs, you can now identify the operations to allow. Here is an example of such a log entry:
nb_no: Imidlertid er en empirisk tilnærming mulig. Etter at de relevante objektene er korrekt merket, kan du bruke programmet i tillatelsesmodus: Operasjonene som vil bli forbudt blir logget, men vil likevel lykkes. Ved å analysere loggene, kan du nå identifisere operasjoner som skal tillates. Her er et eksempel på en slik loggoppføring :

source: To better understand this message, let us study it piece by piece.
nb_no: For bedre å forstå dette budskapet, la oss studere det bit for bit.

source: Analysis of an SELinux trace
nb_no: Analyse av et SELinux-spor

source: Message
nb_no: Budskap

source: Description
nb_no: Beskrivelse

source: An operation has been denied.
nb_no: En operasjon er nektet.

source: This operation required the <literal>read</literal> and <literal>write</literal> permissions.
nb_no: Denne operasjonen krevde <literal>read</literal> og <literal>write</literal>-tillatelsene.

source: The process with PID 1876 executed the operation (or tried to execute it).
nb_no: Prosessen med PID 1876 kjørte operasjonen (eller forsøkt å utføre den).

source: The process was an instance of the <literal>syslogd</literal> program.
nb_no: Prosessen var et tilfelle med <literal>syslogd</literal> programmet.

source: The target object was named <literal>xconsole</literal>. Sometimes you can also have a “path” variable — with the full path — instead.
nb_no: Målobjektet ble navngitt <literal>xconsole</literal>. Noen ganger kan du også ha en "sti"-variabel - med hele banen - i stedet.

source: The device hosting the target object is a <literal>tmpfs</literal> (an in-memory filesystem). For a real disk, you could see the partition hosting the object (for example: “sda3”).
nb_no: Enheten som er vert for målobjektet er et <literal>tmpfs</literal> (et i-minne filsystem). Med en ekte disk, kan du se at partisjonen er vert for objektet (for eksempel: "sda3").

source: The object is identified by the inode number 5510.
nb_no: Objektet er identifisert med inode nummer 5510.

source: This is the security context of the process who executed the operation.
nb_no: Dette er sikkerhetskonteksten for prosessen som utførte operasjonen.

source: This is the security context of the target object.
nb_no: Dette er sikkerehetskontektsen til målobjektet.

source: The target object is a FIFO file.
nb_no: Målobjektet er en FIFO-fil.

source: By observing this log entry, it is possible to build a rule that would allow this operation. For example: <literal>allow syslogd_t device_t:fifo_file { read write }</literal>. This process can be automated, and it's exactly what the <command>audit2allow</command> command (of the <emphasis role="pkg">policycoreutils</emphasis> package) offers. This approach is only useful if the various objects are already correctly labeled according to what must be confined. In any case, you will have to carefully review the generated rules and validate them according to your knowledge of the application. Effectively, this approach tends to grant more rights than are really required. The proper solution is often to create new types and to grant rights on those types only. It also happens that a denied operation isn't fatal to the application, in which case it might be better to just add a “<literal>dontaudit</literal>” rule to avoid the log entry despite the effective denial.
nb_no: Ved å observere dette i loggen, er et det mulig å bygge regel som ville tillate denne operasjonen. For eksempel <literal>allow syslogd_t device_t:fifo_file { read write }</literal>. Denne prosessen kan automatiseres, og det er akkurat hva <command>audit2allow</command>-kommandoen (i <emphasis role="pkg">policycoreutils</emphasis>-pakken) tilbyr. Denne tilnærmingen er et bare nyttig hvis de ulike objektene allerede er korrekt merket med det som måtte være begrenset. I alle fall må du lese nøye gjennom de genererte reglene og validere dem i henhold til dine kunnskaper om programmet. Effektivt, tenderer denne tilnærmingen til å gi flere rettigheter enn det som er virkelig nødvendig. Den riktige løsningen er ofte å lage nye typer og for å tildele rettigheter bare til disse typene. Det hender også at en nektet operasjon er fatalt for programmet, og da kan det være bedre å bare legge til “<literal>dontaudit</literal>” en regel for å unngå loggoppføringen til tross for en effektiv nektelse.

source: <emphasis>COMPLEMENTS</emphasis> No roles in policy rules
nb_no: <emphasis>COMPLEMENTS</emphasis> Ingen roller i oppleggsreglene

source: It might seem weird that roles do not appear at all when creating new rules. SELinux uses only the domains to find out which operations are allowed. The role intervenes only indirectly by allowing the user to switch to another domain. SELinux is based on a theory known as <emphasis>Type Enforcement</emphasis> and the type is the only element that matters when granting rights.
nb_no: Det kan virke merkelig at rollene ikke vises i det hele tatt, når du oppretter nye regler. SELinux bruker bare domenene for å finne ut hvilke operasjoner som er tillatt. Rollen griper bare indirekte inn ved å tillate brukeren å bytte til et annet domene. SELinux er basert på en teori som kalles <emphasis>Type Enforcement</emphasis> og typen er det eneste elementet som teller når du gir rettigheter.

source: Compiling the Files
nb_no: Å kompilere filene
