Repository: Debian-VN/debian-handbook
Catalog: */90_derivative-distributions.po
Languages: fa_ir

source: Live CD
fa_ir: دیسک زنده

source: Specificities
fa_ir: مشخصات

source: Particular Choices
fa_ir: انتخاب‌های خاص

source: Derivative Distributions
fa_ir: توزیع‌های مشتق شده

source: <indexterm><primary>derivative distribution</primary></indexterm> <indexterm><primary>distribution, derivative</primary></indexterm> Many Linux distributions are derivatives of Debian and reuse Debian's package management tools. They all have their own interesting properties, and it is possible one of them will fulfill your needs better than Debian itself.
fa_ir: <indexterm><primary>توزیع مشتق شده</primary></indexterm> <indexterm><primary>توزیع, مشتق</primary></indexterm> بسیاری از توزیع‌های لینوکس از دبیان مشتق شده‌اند و از ابزار مدیریت بسته آن استفاده می‌کنند. همه آن‌ها قابلیت خاص خود را دارند و احتمال اینکه یکی از این توزیع‌ها نیاز شما را بهتر از خود دبیان برطرف کند وجود دارد.

source: Census and Cooperation
fa_ir: سرشماری آماری و همکاری

source: The Debian project fully acknowledges the importance of derivative distributions and actively supports collaboration between all involved parties. This usually involves merging back the improvements initially developed by derivative distributions so that everyone can benefit and long-term maintenance work is reduced.
fa_ir: پروژه دبیان به اهمیت توزیع‌های مشتق شده اذعان دارد و از همکاری‌های بین گروه‌های مختلف در این زمینه به شدت حمایت می‌کند. این فرآیند با ادغام قابلیت‌هایی که توزیع‌های دیگر بوجود آورده‌اند، در نسخه دبیان صورت می‌گیرد تا همگی از آن بهره‌مند شوند و هزینه‌های نگهداری در طولانی مدت کاهش یابد.

source: This explains why derivative distributions are invited to become involved in discussions on the <literal>debian-derivatives@lists.debian.org</literal> mailing-list, and to participate in the derivative census. This census aims at collecting information on work happening in a derivative so that official Debian maintainers can better track the state of their package in Debian variants. <ulink type="block" url="https://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="https://wiki.debian.org/Derivatives/Census" />
fa_ir: همین امر گواه بر این است که چرا توزیع‌های مشتق شده دعوت می‌شوند تا در میلینگ لیست <literal>debian-derivatives@lists.debian.org</literal> به بحث و گفتگو بپردازند و در آمار منشتر شده رسمی شرکت کنند. هدف از این آمار، جمع‌آوری اطلاعاتی است که در توزیع‌های مشتق شده وجود دارند و به توسعه‌دهندگان رسمی دبیان این آگاهی را می‌دهد که بسته‌های خود را در این توزیع‌ها به صورت بهتری مدیریت کنند. <ulink type="block" url="https://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="https://wiki.debian.org/Derivatives/Census" />

source: Let us now briefly describe the most interesting and popular derivative distributions.
fa_ir: بگذارید تا به صورت خلاصه برخی از جالب‌ترین و محبوب‌ترین این توزیع‌ها را برشماریم.

source: Ubuntu
fa_ir: اوبونتو

source: <primary>Ubuntu</primary>
fa_ir: <primary>اوبونتو</primary>

source: Ubuntu made quite a splash when it came on the Free Software scene, and for good reason: Canonical Ltd., the company that created this distribution, started by hiring thirty-odd Debian developers and publicly stating the far-reaching objective of providing a distribution for the general public with a new release twice a year. They also committed to maintaining each version for a year and a half.
fa_ir: اوبونتو با وارد شدن به دنیای نرم‌افزار آزاد سر و صدای زیادی به پا کرد، دلیل خوبی هم وجود داشت: کانونیکال، شرکتی که این توزیع را بوجود آورده است، با استخدام بیش از ۳۰ نفر از توسعه‌دهندگان دبیان و اعلام اهداف اصلی خود در جهت ایجاد توزیعی که برای همگان مناسب باشد و با فاصله زمانی ۲ سال یکبار نسخه جدید آن منشتر می‌شود. آن‌ها همچنین متعهد شدند که پشتیبانی از هر نسخه را به مدت ۱۸ ماه ادامه دهند.

source: These objectives necessarily involve a reduction in scope; Ubuntu focuses on a smaller number of packages than Debian, and relies primarily on the GNOME desktop (although an official Ubuntu derivative, called “Kubuntu”, relies on KDE). Everything is internationalized and made available in a great many languages.
fa_ir: این اهداف مستلزم این بود که قلمرو خود را کوچک سازند؛ تمرکز اوبونتو بر تعداد بسیار کمتری از بسته‌ها نسبت به دبیان است و به صورت اولیه مبتنی بر میزکار گنوم بود (با اینکه کوبونتوُ یک توزیع مبتنی بر اوبونتو روی میزکار کی دی ای تمرکز دارد). هر چیزی قابلیت ترجمه و چندزبانه شدن را دارد و برای زبان‌های بسیاری قابل دسترس است.

source: <primary>Kubuntu</primary>
fa_ir: <primary>کوبونتو</primary>

source: So far, Ubuntu has managed to keep this release rhythm. They also publish <emphasis>Long Term Support</emphasis> (LTS) releases, with a 5-year maintenance promise. As of April 2015, the current LTS version is version 14.04, nicknamed Utopic Unicorn. The last non-LTS version is version 15.04, nicknamed Vivid Vervet. Version numbers describe the release date: 15.04, for example, was released in April 2015.
fa_ir: تا اینجا، اوبونتو این چرخه انتشار را مدیریت می‌کرد. آن‌ها همچنین <emphasis>پشتیبانی بلند مدت</emphasis> یا LTS را ایجاد کردند که شامل ۵ سال پشتیبانی رسمی از طرف کانونیکال می‌شد. تا آوریل ۲۰۱۵، نسخه LTS فعلی ۱۴.۰۴ با کد اسب شاخ‌دار (؟) نام دارد. آخرین نسخه‌ای که پشتیبانی بلند مدت ندارد ۱۵.۰۴ است که میمون سرزنده (؟) نام دارد. اعداد موجود در نسخه‌ها سال و ماه انتشار را نمایش می‌دهند: برای نمونه، ۱۵.۰۴ یعنی آوریل ۲۰۱۵.

source: <emphasis>IN PRACTICE</emphasis> Ubuntu's support and maintenance promise
fa_ir: <emphasis>در عمل</emphasis> پشتیبانی و پیمان نگهداری اوبونتو

source: Canonical has adjusted multiple times the rules governing the length of the period during which a given release is maintained. Canonical, as a company, promises to provide security updates to all the software available in the <literal>main</literal> and <literal>restricted</literal> sections of the Ubuntu archive, for 5 years for LTS releases and for 9 months for non-LTS releases. Everything else (available in the <literal>universe</literal> and <literal>multiverse</literal>) is maintained on a best-effort basis by volunteers of the MOTU team (<emphasis>Masters Of The Universe</emphasis>). Be prepared to handle security support yourself if you rely on packages of the latter sections.
fa_ir: کانونیکال بازه زمانی که طی آن از یک انتشار پشتیبانی بعمل می‌آورد را چندین مرتبه تغییر داده است. کانونیکال، به عنوان یک شرکت تجاری، وعده داده است که بروزرسانی‌های امنیتی برای تمام بسته‌های موجود در <literal>main</literal> و <literal>restricted</literal> واقع در بایگانی ابونتو را به مدت ۵ سال برای نسخه‌های بلند مدت و ۹ ماه برای سایر نسخه‌ها، فراهم کند. هر آنچه که باقی بماند (موجود در <literal>universe</literal> و <literal>multiverse</literal>) بر اساس یک تلاش دسته جمعی از طرف داوطلبان تیم MOTU (<emphasis>Masters Of The Universe</emphasis>) صورت می‌گیرد.

source: Ubuntu has reached a wide audience in the general public. Millions of users were impressed by its ease of installation, and the work that went into making the desktop simpler to use.
fa_ir: اوبونتو به طیف گسترده‌ای از مخاطبان عمومی دست یافته است. میلیون‌ها کاربر تحت تاثیر سادگی عملیات نصب و کارهایی که جهت تسهیل میزکار اوبونتو صورت گرفته است، قرار گرفته‌اند.

source: Ubuntu and Debian used to have a tense relationship; Debian developers who had placed great hopes in Ubuntu contributing directly to Debian were disappointed by the difference between the Canonical marketing, which implied Ubuntu were good citizens in the Free Software world, and the actual practice where they simply made public the changes they applied to Debian packages. Things have been getting better over the years, and Ubuntu has now made it general practice to forward patches to the most appropriate place (although this only applies to external software they package and not to the Ubuntu-specific software such as Mir or Unity). <ulink type="block" url="http://www.ubuntu.com/" />
fa_ir: اوبونتو و دبیان سابق بر این یک رابطه سفت و سخت داشتند؛ توسعه‌دهندگان دبیان که امید فراوانی به مشارکت اوبونتو در دبیان داشتند با سیاست‌های متفاوت بازاریابی کانونیکال که دلالت بر مفید بودن اوبونتو در دنیای نرم‌افزار آزاد داشت و اتفاقی که در عمل می‌افتاد، ناامید شده بودند. البته این رویارویی طی سالیان اخیر بهتر شده است و اوبونتو تلاش می‌کند که بروزرسانی‌های خود را به مناسبت‌ترین محل ممکن منتقل سازد (البته این سیاست تنها شامل نرم‌افزارهایی است که خارج از خانواده اوبونتو هستند و نه مواری مانند میر یا یونیتی). <ulink type="block" url="http://www.ubuntu.com/" />

source: Linux Mint
fa_ir: لینوکس مینت

source: <primary>Linux Mint</primary>
fa_ir: <primary>لینوکس مینت</primary>

source: Linux Mint is a (partly) community-maintained distribution, supported by donations and advertisements. Their flagship product is based on Ubuntu, but they also provide a “Linux Mint Debian Edition” variant that evolves continuously (as it is based on Debian Testing). In both cases, the initial installation involves booting a LiveDVD.
fa_ir: لینوکس مینت یک توزیع (تقریبا) مبتنی بر جامعه کاربری خود است، که از طریق حمایت مالی و تبلیغات پشتیبانی می‌شود. گل سر سبد محصولات آن مبتنی بر اوبونتو است، اما آن‌ها یک “نسخه لینوکس مینت دبیانی” هم فراهم کردند که آهسته و پیوسته تکمیل می‌شود (چرا که مبتنی بر آزمون‌های دبیان است). در هر دو مورد، نصب اولیه شامل راه‌اندازی یک دیسک زنده دی‌وی‌دی است.

source: The distribution aims at simplifying access to advanced technologies, and provides specific graphical user interfaces on top of the usual software. For instance, Linux Mint relies on Cinnamon instead of GNOME by default (but it also includes MATE as well as KDE and Xfce); similarly, the package management interface, although based on APT, provides a specific interface with an evaluation of the risk from each package update.
fa_ir: هدف این توزیع آسان‌سازی دسترسی به فناوری‌های پیشرفته است و شامل رابط‌های گرافیک کاربری مشخصی است که بر نرم‌افزارهای فعلی سوار می‌شود. برای نمونه، لینوکس مینت از میزکار سیناموم بجای گنوم استفاده می‌کند (اما همچنین شامل MATE و KDE و XFCE نیز هست)؛ به صورت مشابه، رابط مدیریت بسته‌ آن نیز براساس APT است که رابط گرافیکی جداگانه‌ای برای بروزرسانی و نصب نرم‌افزارها در اختیار کاربر قرار می‌دهد.

source: Linux Mint includes a large amount of proprietary software to improve the experience of users who might need those. For example: Adobe Flash and multimedia codecs. <ulink type="block" url="http://www.linuxmint.com/" />
fa_ir: لینوکس مینت شامل مجموعه‌ای عظیم از نرم‌افزارهای انحصاری است تا به نیازهای گوناگون کاربران پاسخ مناسب دهد. برای نمونه، ادوبی فلش و کدک‌های چندرسانه‌ای. <ulink type="block" url="http://www.linuxmint.com/" />

source: Knoppix
fa_ir: ناپیکس

source: <primary><foreignphrase>LiveCD</foreignphrase></primary>
fa_ir: <primary><foreignphrase>دیسک زنده</foreignphrase></primary>

source: <primary>Knoppix</primary>
fa_ir: <primary>ناپیکس</primary>

source: <primary>bootable CD-ROM</primary>
fa_ir: <primary>دیسک راه‌انداز</primary>

source: <primary>CD-ROM</primary><secondary>bootable</secondary>
fa_ir: <primary>دیسک فشرده</primary><secondary>با قابلیت راه‌اندازی</secondary>

source: The Knoppix distribution barely needs an introduction. It was the first popular distribution to provide a <emphasis>LiveCD</emphasis>; in other words, a bootable CD-ROM that runs a turn-key Linux system with no requirement for a hard-disk — any system already installed on the machine will be left untouched. Automatic detection of available devices allows this distribution to work in most hardware configurations. The CD-ROM includes almost 2 GB of (compressed) software, and the DVD-ROM version has even more.
fa_ir: توزیع ناپیکس به ندرت نیاز به معرفی دارد. این اولین توزیع محبوبی بود که شامل <emphasis>دیسک زنده</emphasis> می‌شد. به عبارت دیگر، یک لوح فشرده با قابلیت اجرا که می‌تواند یک سیستم لینوکس را راه‌اندازی کند بدون آنکه به هارددیسک نیاز داشته باشد - هر سیستمی که روی ماشین نصب باشد بدون تغییر باقی می‌ماند. تشخیص خودکار دستگاه‌های موجود به این توزیع این امکان را می‌دهد که با تنظیمات گوناگون سخت‌افزاری کار کند. لوح فشرده آن شامل ۲ گیگابایت نرم‌افزار (فشرده) است و دی‌وی‌دی آن از این مقدار نیز بیشتر است.

source: Combining this CD-ROM to a USB stick allows carrying your files with you, and to work on any computer without leaving a trace — remember that the distribution doesn't use the hard-disk at all. Knoppix uses LXDE (a lightweight graphical desktop) by default, but the DVD version also includes GNOME and KDE. Many other distributions provide other combinations of desktops and software. This is, in part, made possible thanks to the <emphasis role="pkg">live-build</emphasis> Debian package that makes it relatively easy to create a LiveCD. <ulink type="block" url="http://live.debian.net/" />
fa_ir: ترکیب این لوح فشرده با حافظه فلش این امکان را به شما می‌دهد تا فایل‌های خود را هر کجا می‌خواهید با خود ببرید بدون آنکه کوچکترین ردی از خود بجای گذارید - به یاد داشته باشید که این توزیع اصلا از هارددیسک استفاده نمی‌کند. ناپیکس از LXDE (یک میزکار سبک) به صورت پیش فرض استفاده می‌کند اما نسخه دی‌وی‌دی آن شامل گنوم و کی‌دی‌ای نیز می‌باشد. بسیاری دیگر از توزیع‌ها نیز از ترکیب گوناگون میزکارها و نرم‌افزارها استفاده می‌کنند. این عمل، در واقع به لطف بسته دبیان <emphasis role="pkg">live-build</emphasis> ممکن شد که امکان ایجاد دیسک زنده را آسان می‌سازد. <ulink type="block" url="http://live.debian.net/" />

source: Note that Knoppix also provides an installer: you can first try the distribution as a LiveCD, then install it on a hard-disk to get better performance. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
fa_ir: ناپیکس همچنین یک برنامه نصب را نیز شامل می‌شود: ابتدا می‌توانید آن را به عنوان یک دیسک زنده امتحان کنید سپس آن را روی یک هارددیسک جهت بهبود عملکرد نصب کنید. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />

source: Aptosid and Siduction
fa_ir: اپتوزید و سیداکشن

source: <primary>Sidux</primary>
fa_ir: <primary>سیداکس</primary>

source: <primary>Aptosid</primary>
fa_ir: <primary>اپتوزید</primary>

source: <primary>Siduction</primary>
fa_ir: <primary>سیداکشن</primary>

source: These community-based distributions track the changes in Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>) — hence their name. The modifications are limited in scope: the goal is to provide the most recent software and to update drivers for the most recent hardware, while still allowing users to switch back to the official Debian distribution at any time. Aptosid was previously known as Sidux, and Siduction is a more recent fork of Aptosid. <ulink type="block" url="http://aptosid.com" /> <ulink type="block" url="http://siduction.org" />
fa_ir: این توزیع‌های مبتنی بر جامعه کاربری تغییرات موجود در شاخه دبیان <emphasis role="distribution">Sid</emphasis> را دنبال می‌کنند (<emphasis role="distribution">Unstable</emphasis>) - از این رو نامگذاری شده‌اند. تغییرات محدود به حوزه‌هایی خاص است: هدف از آن‌ها، فراهم‌سازی جدیدترین نرم‌افزارها و بروزرسانی‌های سخت‌افزاری است، با این حال این امکان برای کاربران وجود دارد که به نسخه رسمی دبیان مهاجرت کنند. اپتوزید سابق بر این با نام سیداکس شناخته می‌شد و سیداکشن یک انشعاب جداگانه از اپتوزید است. <ulink type="block" url="http://aptosid.com" /> <ulink type="block" url="http://siduction.org" />

source: Grml is a LiveCD with many tools for system administrators, dealing with installation, deployment, and system rescue. The LiveCD is provided in two flavors, <literal>full</literal> and <literal>small</literal>, both available for 32-bit and 64-bit PCs. Obviously, the two flavors differ by the amount of software included and by the resulting size. <ulink type="block" url="https://grml.org" />
fa_ir: این توزیع یک دیسک زنده با ابزارهایی برای مدیر سیستم‌ها است که شامل فرآیندهای نصب، توسعه و راهکارهای نجات سیستم می‌شود. این دیسک زنده به دو شکل توزیع می‌شود، <literal>بزرگ</literal> و <literal>کوچک</literal> که هر دو برای معماری‌های ۳۲ و ۶۴ بیت موجود هستند. مشخصاً، هر دو گونه در تعداد نرم‌افزارها و اندازه آن‌ها با یکدیگر متفاوت هستند.

source: Tails
fa_ir: تیلز

source: <primary>Tails</primary>
fa_ir: <primary>تیلز</primary>

source: Tails (The Amnesic Incognito Live System) aims at providing a live system that preserves anonymity and privacy. It takes great care in not leaving any trace on the computer it runs on, and uses the Tor network to connect to the Internet in the most anonymous way possible. <ulink type="block" url="https://tails.boum.org" />
fa_ir: هدف تیلز ایجاد دیسک زنده‌ای است که بینامی و حریم شخصی کاربر را رعایت کند. دقت بسیار بالایی در عدم بجایگذاری هیچ ردی روی رایانه‌های مورد استفاده دارد و از شبکه تور برای اتصال به اینترنت در بهترین حالت استفاده می‌کند. <ulink type="block" url="https://tails.boum.org" />

source: Kali Linux
fa_ir: کالی لینوکس

source: <primary>Kali</primary>
fa_ir: <primary>کالی</primary>

source: <primary>penetration testing</primary>
fa_ir: <primary>آزمون نفوذ</primary>

source: Kali Linux is a Debian-based distribution specialising in penetration testing (“pentesting” for short). It provides software that helps auditing the security of an existing network or computer while it is live, and analyze it after an attack (which is known as “computer forensics”). <ulink type="block" url="https://kali.org" />
fa_ir: کالی لینوکس یک توزیع مبتنی بر دبیان است که در حوزه آزمون نفوذ به سامانه‌های رایانه‌ای تخصص دارد که به این عمل pentesting اطلاق می‌شود. شامل نرم‌افزارهایی است که به بررسی امنیت یک شبکه یا رایانه خاص کمک می‌کنند و می‌تواند آن را پس از حمله نیز بررسی کند (که با نام forensics) شناخته می‌شود. <ulink type="block" url="https://kali.org" />

source: Devuan
fa_ir: دیوان

source: <primary>Devuan</primary>
fa_ir: <primary>دیوان</primary>

source: Devuan is a relatively new fork of Debian: it started in 2014 as a reaction to the decision made by Debian to switch to <command>systemd</command> as the default init system. A group of users attached to <command>sysv</command> and opposing (real or perceived) drawbacks to <command>systemd</command> started Devuan with the objective of maintaining a <command>systemd</command>-less system. As of March 2015, they haven't published any real release: it remains to be seen if the project will succeed and find its niche, or if the systemd opponents will learn to accept it. <ulink type="block" url="https://devuan.org" />
fa_ir: دیوان یک انشعاب به نسبت تازه از دبیان است: در سال ۲۰۱۴ و در واکنش به تصمیم دبیان به استفاده از <command>systemd</command> به عنوان سیستم راه‌انداز اولیه شروع شد. گروهی از کاربران که به <command>sysv</command> وابسته بودند (درست یا نادرست) و اشکالات فراوانی در <command>systemd</command> می‌دیدند، این پروژه ار آغاز کردند با هدف سیستم که عاری از <command>systemd</command> باشد. تا مارس ۲۰۱۵، هنوز نسخه‌ای از آن منتشر نشده است: اینطور به نظر می‌رسد که یا پروژه به موفقیت می‌رسد یا مخالفان systemd می‌آموزند که با آن کنار بیایند.

source: Tanglu
fa_ir: تانگلو

source: <primary>Tanglu</primary>
fa_ir: <primary>تانگلو</primary>

source: Tanglu is another Debian derivative; this one is based on a mix of Debian <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis>, with patches to some packages. Its goal is to provide a modern desktop-friendly distribution based on fresh software, without the release constraints of Debian. <ulink type="block" url="http://tanglu.org" />
fa_ir: تانگلو نیز یک توزیع مشتق شده از دبیان است؛ که ترکیبی از شاخه‌های <emphasis role="distribution">Testing</emphasis> و <emphasis role="distribution">Unstable</emphasis> دبیان می‌باشد که شامل بروزرسانی برای برخی بسته‌ها است. هدف آن فراهم‌سازی یک توزیع مناسب برای رایانه‌های رومیزی است که جدیدترین نرم‌افزارها را شامل می‌شوند بدون اینکه درگیر محدودیت‌های انتشار دبیان باشد. <ulink type="block" url="http://tanglu.org" />

source: DoudouLinux
fa_ir: دودو لینوکس

source: <primary>DoudouLinux</primary>
fa_ir: <primary>دودو لینوکس</primary>

source: DoudouLinux targets young children (starting from 2 years old). To achieve this goal, it provides an heavily customized graphical interface (based on LXDE) and comes with many games and educative applications. Internet access is filtered to prevent children from visiting problematic websites. Advertisements are blocked. The goal is that parents should be free to let their children use their computer once booted into DoudouLinux. And children should love using DoudouLinux, just like they enjoy their gaming console. <ulink type="block" url="http://www.doudoulinux.org" />
fa_ir: هدف دودو لینوکس جامعه کاربری کودکان است (که بین ۲ تا ۶ سال سن دارند). برای دستیابی به این هدف، یک رابط گرافیکی به شدت سفارشی‌شده (مبتنی بر LXDE) را فراهم می‌آورد و شامل بسیاری از بازی‌ها و نرم‌افزارهای آموزشی است. دسترسی به اینترنت محدود شده است تا کودکان به وبسایت‌های نامربوط هدایت نشوند. تبلیغات مسدود شده است. هدف این است که والدین با خیالی آسودده بگذارند فرزندانشان از رایانه زمانی که دودو لینوکس راه‌اندازی می‌شود، استفاده کنند. هر کودکی استفاده از دودو لینکوس را لذت‌بخش خواهد دید، درست به همان اندازه که از کنسول‌های بازی لذت می‌برند. <ulink type="block" url="http://www.doudoulinux.org" />

source: Raspbian
fa_ir: رسپبیان

source: <primary>Raspbian</primary>
fa_ir: <primary>رسپبیان</primary>

source: <primary>Raspberry Pi</primary>
fa_ir: <primary>رسپبری پای</primary>

source: Raspbian is a rebuild of Debian optimised for the popular (and inexpensive) Raspberry Pi family of single-board computers. The hardware for that platform is more powerful than what the Debian <emphasis role="architecture">armel</emphasis> architecture can take advantage of, but lacks some features that would be required for <emphasis role="architecture">armhf</emphasis>; so Raspbian is a kind of intermediary, rebuilt specifically for that hardware and including patches targeting this computer only. <ulink type="block" url="https://raspbian.org" />
fa_ir: رسپبیان یک بازسازی از دبیان بهینه‌شده برای رایانه‌های تک‌بردی از خانواده محبوب (و ارزان) رسپبری پای است. سخت‌افزار موجود در این پتلفرم قدرتمندتر از آن است که تنها معماری <emphasis role="architecture">armel</emphasis> دبیان بتواند از آن استفاده کند، اما برخی ویژگی‌های مورد نیاز <emphasis role="architecture">armhf</emphasis> را شامل نمی‌شود؛ بنابراین رسپبیان یک جور بازسازی میانی به خصوص برای سخت‌افزار مورد نظر است و شامل بروزرسانی‌هایی است که تنها شامل این رایانه خاص می‌شوند. <ulink type="block" url="https://raspbian.org" />

source: And Many More
fa_ir: و بسیاری دیگر

source: <primary>Distrowatch</primary>
fa_ir: <primary>دیستروواچ</primary>

source: The Distrowatch website references a huge number of Linux distributions, many of which are based on Debian. Browsing this site is a great way to get a sense of the diversity in the Free Software world. <ulink type="block" url="http://distrowatch.com" />
fa_ir: وبسایت دیستروواچ مرجع تعداد بسیاری از توزیع‌های لینوکس است، که بسیاری از آن‌ها بر اساس دبیان هستند. گشت و گذار در این وبسایت راه بسیار خوبی است تا با تنوع وجود توزیع‌ها در دنیای نرم‌افزار آزاد آشنا شوید. <ulink type="block" url="http://distrowatch.com" />

source: The search form can help track down a distribution based on its ancestry. In March 2015, selecting Debian led to 131 active distributions! <ulink type="block" url="http://distrowatch.com/search.php" />
fa_ir: فرم جستجو می‌تواند به یافتن یک توزیع بر اساس نیا (توزیع پدر) کمک کند. در مارس ۲۰۱۵، ۱۳۱ توزیع فعال مبتنی بر دبیان وجود داشتند! <ulink type="block" url="http://distrowatch.com/search.php" />
