Repository: Debian-VN/debian-handbook
Catalog: */Book_Info.po
Languages: pl_pl

source: The Debian Administrator's Handbook
pl_pl: Podręcznik Administratora Debiana

source: Debian Jessie from Discovery to Mastery
pl_pl: Debian Jessie — Odkryj, aby stać się Mistrzem

source: A reference book presenting the Debian distribution, from initial installation to configuration of services.
pl_pl: Leksykon, prezentujący dystrybucję Debian, począwszy od wstępnej instalacji, aż do konfiguracji usług.

source: ISBN: 979-10-91414-04-3 (English paperback)
pl_pl: ISBN: 979-10-91414-04-3 (wersja papierowa w języku angielskim)

source: ISBN: 979-10-91414-05-0 (English ebook)
pl_pl: ISBN: 979-10-91414-05-0 (książka elektroniczna w języku angielskim)

source: This book is available under the terms of two licenses compatible with the Debian Free Software Guidelines.
pl_pl: Książka jest dostępna na warunkach dwóch licencji zgodnych z Wytycznymi Debiana dotyczącymi wolnego oprogramowania (ang. Debian Free Software Guidelines).

source: Creative Commons License Notice:
pl_pl: Uwaga Licencji Creative Commons:

source: This book is licensed under a Creative Commons Attribution-ShareAlike 3.0 Unported License. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />
pl_pl: Książka jest dostępna na warunkach Creative Commons Attribution-Share Alike 3.0 Unported License. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />

source: GNU General Public License Notice:
pl_pl: Uwaga Powszechnej Licencji Publicznej GNU:

source: This book is free documentation: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 2 of the License, or (at your option) any later version.
pl_pl: Książka jest wolną dokumentacją: można ją rozpowszechniać i/lub modyfikować na warunkach Powszechnej Licencji Publicznej GNU, opublikowanej przez Fundację Wolnego Oprogramowania (ang. Free Software Foundation), według wersji 2. tej Licencji lub (do wyboru) którejś z późniejszych wersji.

source: This book is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
pl_pl: Książka jest rozpowszechniana w nadziei, że będzie użyteczna, ale BEZ ŻADNEJ GWARANCJI; nawet bez żadnej domniemanej gwarancji PRZYDATNOŚCI HANDLOWEJ lub PRZYDATNOŚCI DO OKREŚLONEGO CELU. Więcej szczegółów — zob.: Powszechną Licencja Publiczna GNU.

source: You should have received a copy of the GNU General Public License along with this program. If not, see <ulink url="http://www.gnu.org/licenses/" />.
pl_pl: Wraz z tym programem powinieneś /powinnaś otrzymać kopię Powszechnej Licencji Publicznej GNU. Jeśli nie otrzymałeś /nie otrzymałaś takiej kopii, to zobacz <ulink url="http://www.gnu.org/licenses/" />.

source: Show your appreciation
pl_pl: Wykaż się swoim uznaniem

source: This book is published under a free license because we want everybody to benefit from it. That said maintaining it takes time and lots of effort, and we appreciate being thanked for this. If you find this book valuable, please consider contributing to its continued maintenance either by buying a paperback copy or by making a donation through the book's official website: <ulink type="block" url="http://debian-handbook.info" />
pl_pl: Książka jest opublikowana na wolnej licencji ponieważ chcemy, aby każdy mógł z niej skorzystać. Warto jednak zaznaczyć, że kosztowała nas ona wiele czasu i wysiłku. Będzie nam więc bardzo miło, jeśli otrzymamy za nią drobne wyrazy wdzięczności. Jeśli ta książka wyda ci się wartościowa, to proszę weź pod uwagę własny wkład w jej utrzymywanie, i wesprzyj nas — albo poprzez zakup papierowej wersji albo poprzez darowiznę za pomocą oficjalnej witryny internetowej: <ulink type="block" url="http://debian-handbook.info" />
